{
    "status": "OK",
    "request_id": "4affa6a5-7ce0-4640-a59c-4051841a6178",
    "parameters": {
        "query": "machine learning engineer in san diego, usa",
        "page": 1,
        "num_pages": 1
    },
    "data": [
        {
            "employer_name": "ResMed",
            "employer_logo": "https://media.resmed.com/sites/3/20200316234030/logo-resmed-color-social-media.png",
            "employer_website": "http://www.resmed.com",
            "employer_company_type": "Manufacturing",
            "job_publisher": "LinkedIn",
            "job_id": "xY65IYRCIrgAAAAAAAAAAA==",
            "job_employment_type": "FULLTIME",
            "job_title": "Senior Machine Learning Engineer",
            "job_apply_link": "https://www.linkedin.com/jobs/view/senior-machine-learning-engineer-at-resmed-3583732620",
            "job_apply_is_direct": false,
            "job_apply_quality_score": 0.5673,
            "job_description": "Digital Health Technology team powers digital experiences and engagement to enhance the lives of millions of people every day through connected care. We build, deliver and manage a portfolio of data management platforms and mobile offerings in support of our core businesses. We thrive on simple and elegant architecture and agility. You’ll be immersed in a dynamic high-growth environment and empowered to excel, take informed risks, and drive ingenuity across the enterprise.\n\nLet’s talk about the team:\n\nThe Data Science and AI/ML team collaborates across the organization to identify, develop and deliver Artificial Intelligence (AI) and Machine Learning (ML) powered software solutions that improve patient outcomes, delight our partners and customers, and improve the way we do business in an “AI First” fashion. On any given day, the team could be working on building sophisticated models to delivering personalized recommendations to patients to improve their sleep, identify optimal equipment and settings using our unparalleled store of billion+ nights of sleep data, proactively identify other health risk factors, or help optimize complex, global supply chain operations.\n\nAs a Machine Learning Engineer, your key responsibilities include building automation and leading-edge architecture around model development, deployment, and serving to optimize time to market and quality of AI/ML applications. Specifically, you will give architectural guidance to ensure our global AI/ML systems are production-grade, scalable and use the latest state of the art technology and methodology. You will help define and ensure best coding practices within the team of excellent and engaged engineers. You will be given creative freedom and opportunities to work on advanced AI/ML problems, such as reinforcement learning and a self-serve AI/ML platform. You will do hands-on code development, mentor junior team members, and interact with business stakeholders.\n\nThis is a hybrid role based out of our San Diego office (9001 Spectrum Center Blvd, San Diego, CA 92123).\n\nLet's talk about the role:\n• You will work closely with other stakeholders from Product Management, Engineering, and other business stakeholders to create impactful, intelligent features and products.\n• You will collaborate closely with other team members including Data Scientists and Data Engineers and “own” the end to end process.\n• You will be given wide authority to develop creative model-based solutions but will also be held to high quality and accountability standards.\n• You will thoroughly and diligently document the model design, experiments, tests, validations, and live metrics and outcomes, typically on Confluence. You may be asked to write documents for use in the preparation of intellectual property and technical publications.\n• Build and maintain optimal global AI/ML architectures.\n• Stay informed of industry trends and enable successful AI/ML solutions by leveraging best practices.\n• Participate in and set up Proof of Concepts (POCs) to demonstrate proposed solutions.\n• Identify, design, and implement internal process improvements: Automating manual processes, re-designing infrastructure for greater scalability, etc.\n• Build infrastructure needed for AI/ML systems, such as model inference, automated (re-)training etc.\n• Work with stakeholders including the Executive, Product, Data and Design teams to help with AI/ML-related technical issues and support their AI/ML infrastructure needs.\n• Actively handle escalated incidents to resolution and suggest solutions to limit future exposure.\n• Participate in Code Review and process improvement.\n• You will mentor and train more junior team members.\n\nLet's talk about you:\n• 2+ years’ of industry experience\n• M.S or PhD in Data Science/Machine Learning or closely related areas such as Computer Science, Operations Research, Applied Statistics, and Biomedical Informatics.\n• Deep grounding in machine learning techniques including regression methods (linear, logistic, lasso, support vector, etc.), classification (tree-based models such as XGBoost and Random Forest, Neural Networks, Deep Learning – CNN, RNN, LSTM, etc.), as well as knowledge of clustering and unsupervised learning, time series forecasting and optimization methods.\n• Solid foundation with development of data analytics systems, including data exploration/crawling, feature engineering, model building, performance evaluation, and online deployment of models.\n• Hands-on experience in handling large and distributed datasets on Hadoop, Spark, Hive, etc.\n• Experience with AWS or other cloud-based tools and technologies for data pipelining, model development and deployment.\n• Experience building scalable AI/ML systems for continuous training automation, computer vision, natural language processing, or similarly advanced AI/ML problems.\n• Experience with one or more of the following AWS (Amazon Web Services) cloud services: SageMaker, ECR/EC2 and Docker, AWS Batch processing, Lambda, Glue, EventBridge, etc.\n• Experience with AI/ML operational tools such as Airflow, MLFlow, H2O, etc.\n• Experience with relational SQL and NoSQL databases.\n• Experience with developing production-grade Python code.\n\nWe are shaping the future at ResMed, and we recognize the need to build on and broaden our existing skills and continue to attract and retain the world’s best talent. We work hard to offer holistic benefits packages, provide flexible work arrangements, cultivate a workforce culture that allows employees to grow personally and professionally, and deliver competitive salaries to our team members. Employees scheduled to work 30 or more hours per week are eligible for benefits. This position qualifies for the following benefits package: comprehensive medical, vision, dental, and life, AD&D, short-term and long-term disability insurance, sleep care management, Health Savings Account (HSA), Flexible Spending Account (FSA), commuter benefits, 401(k), Employee Stock Purchase Plan (ESPP), Employee Assistance Program (EAP), and tuition assistance. Employees accrue fifteen days Paid Time Off (PTO) in their first year of employment, receive 11 paid holidays plus 3 floating days and are eligible for 14 weeks of primary caregiver or two weeks of secondary caregiver leave when welcoming new family members. Individual pay decisions are based on a variety of factors, such as the candidate’s geographic work location, relevant qualifications, work experience, and skills. At ResMed, it is not typical for an individual to be hired at or near the top of the range for their role and compensation decisions are dependent on the facts and circumstances of each case. A reasonable estimate of the current range for this position is:\n\n$126,000 -190,000\n\nSubject to the absolute discretion of the company, this role may be eligible to receive stock equity based on company, business unit, and/or individual performance. This role is eligible to receive an annual cash bonus payment based on company, business unit, and/or individual performance.\n\nJoining us is more than saying “yes” to making the world a healthier place. It’s discovering a career that’s challenging, supportive and inspiring. Where a culture driven by excellence helps you not only meet your goals, but also create new ones. We focus on creating a diverse and inclusive culture, encouraging individual expression in the workplace and thrive on the innovative ideas this generates. If this sounds like the workplace for you, apply now!",
            "job_is_remote": false,
            "job_posted_at_timestamp": 1682030792,
            "job_posted_at_datetime_utc": "2023-04-20T22:46:32.000Z",
            "job_city": "San Diego",
            "job_state": "CA",
            "job_country": "US",
            "job_latitude": 32.715736,
            "job_longitude": -117.16109,
            "job_benefits": [
                "retirement_savings",
                "paid_time_off",
                "dental_coverage",
                "health_insurance"
            ],
            "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=machine+learning+engineer+in+san+diego,+usa&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=machine+learning+engineer+in+san+diego,+usa&htidocid=xY65IYRCIrgAAAAAAAAAAA%3D%3D",
            "job_offer_expiration_datetime_utc": "2023-05-20T22:46:32.000Z",
            "job_offer_expiration_timestamp": 1684622792,
            "job_required_experience": {
                "no_experience_required": false,
                "required_experience_in_months": 24,
                "experience_mentioned": true,
                "experience_preferred": false
            },
            "job_required_skills": null,
            "job_required_education": {
                "postgraduate_degree": false,
                "professional_certification": false,
                "high_school": false,
                "associates_degree": false,
                "bachelors_degree": true,
                "degree_mentioned": true,
                "degree_preferred": false,
                "professional_certification_mentioned": false
            },
            "job_experience_in_place_of_education": false,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_currency": null,
            "job_salary_period": null,
            "job_highlights": {
                "Qualifications": [
                    "2+ years’ of industry experience",
                    "M.S or PhD in Data Science/Machine Learning or closely related areas such as Computer Science, Operations Research, Applied Statistics, and Biomedical Informatics",
                    "Deep grounding in machine learning techniques including regression methods (linear, logistic, lasso, support vector, etc.), classification (tree-based models such as XGBoost and Random Forest, Neural Networks, Deep Learning – CNN, RNN, LSTM, etc.), as well as knowledge of clustering and unsupervised learning, time series forecasting and optimization methods",
                    "Solid foundation with development of data analytics systems, including data exploration/crawling, feature engineering, model building, performance evaluation, and online deployment of models",
                    "Hands-on experience in handling large and distributed datasets on Hadoop, Spark, Hive, etc",
                    "Experience with AWS or other cloud-based tools and technologies for data pipelining, model development and deployment",
                    "Experience building scalable AI/ML systems for continuous training automation, computer vision, natural language processing, or similarly advanced AI/ML problems",
                    "Experience with one or more of the following AWS (Amazon Web Services) cloud services: SageMaker, ECR/EC2 and Docker, AWS Batch processing, Lambda, Glue, EventBridge, etc",
                    "Experience with AI/ML operational tools such as Airflow, MLFlow, H2O, etc",
                    "Experience with relational SQL and NoSQL databases",
                    "Experience with developing production-grade Python code"
                ],
                "Responsibilities": [
                    "On any given day, the team could be working on building sophisticated models to delivering personalized recommendations to patients to improve their sleep, identify optimal equipment and settings using our unparalleled store of billion+ nights of sleep data, proactively identify other health risk factors, or help optimize complex, global supply chain operations",
                    "As a Machine Learning Engineer, your key responsibilities include building automation and leading-edge architecture around model development, deployment, and serving to optimize time to market and quality of AI/ML applications",
                    "Specifically, you will give architectural guidance to ensure our global AI/ML systems are production-grade, scalable and use the latest state of the art technology and methodology",
                    "You will help define and ensure best coding practices within the team of excellent and engaged engineers",
                    "You will be given creative freedom and opportunities to work on advanced AI/ML problems, such as reinforcement learning and a self-serve AI/ML platform",
                    "You will do hands-on code development, mentor junior team members, and interact with business stakeholders",
                    "You will work closely with other stakeholders from Product Management, Engineering, and other business stakeholders to create impactful, intelligent features and products",
                    "You will collaborate closely with other team members including Data Scientists and Data Engineers and “own” the end to end process",
                    "You will be given wide authority to develop creative model-based solutions but will also be held to high quality and accountability standards",
                    "You will thoroughly and diligently document the model design, experiments, tests, validations, and live metrics and outcomes, typically on Confluence",
                    "You may be asked to write documents for use in the preparation of intellectual property and technical publications",
                    "Build and maintain optimal global AI/ML architectures",
                    "Stay informed of industry trends and enable successful AI/ML solutions by leveraging best practices",
                    "Participate in and set up Proof of Concepts (POCs) to demonstrate proposed solutions",
                    "Identify, design, and implement internal process improvements: Automating manual processes, re-designing infrastructure for greater scalability, etc",
                    "Build infrastructure needed for AI/ML systems, such as model inference, automated (re-)training etc",
                    "Work with stakeholders including the Executive, Product, Data and Design teams to help with AI/ML-related technical issues and support their AI/ML infrastructure needs",
                    "Actively handle escalated incidents to resolution and suggest solutions to limit future exposure",
                    "Participate in Code Review and process improvement",
                    "You will mentor and train more junior team members"
                ],
                "Benefits": [
                    "We work hard to offer holistic benefits packages, provide flexible work arrangements, cultivate a workforce culture that allows employees to grow personally and professionally, and deliver competitive salaries to our team members",
                    "Employees scheduled to work 30 or more hours per week are eligible for benefits",
                    "This position qualifies for the following benefits package: comprehensive medical, vision, dental, and life, AD&D, short-term and long-term disability insurance, sleep care management, Health Savings Account (HSA), Flexible Spending Account (FSA), commuter benefits, 401(k), Employee Stock Purchase Plan (ESPP), Employee Assistance Program (EAP), and tuition assistance",
                    "Employees accrue fifteen days Paid Time Off (PTO) in their first year of employment, receive 11 paid holidays plus 3 floating days and are eligible for 14 weeks of primary caregiver or two weeks of secondary caregiver leave when welcoming new family members",
                    "This role is eligible to receive an annual cash bonus payment based on company, business unit, and/or individual performance"
                ]
            },
            "job_job_title": "Learning engineer",
            "job_posting_language": "en",
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        },
        {
            "employer_name": "CoreLogic",
            "employer_logo": "https://www.corelogic.com/wp-content/uploads/sites/4/2021/06/Featured_FB_OG-corelogic-logo_1200x1200.png",
            "employer_website": "http://www.corelogic.com",
            "employer_company_type": "Information",
            "job_publisher": "ZipRecruiter",
            "job_id": "AQGhBkhmg_oAAAAAAAAAAA==",
            "job_employment_type": "FULLTIME",
            "job_title": "Senior Machine Learning Engineer",
            "job_apply_link": "https://www.ziprecruiter.com/c/CoreLogic/Job/Senior-Machine-Learning-Engineer/-in-San-Diego,CA?jid=dfa42ad7b61dc8a0",
            "job_apply_is_direct": true,
            "job_apply_quality_score": 0.6771,
            "job_description": "Job Summary:\n\nJoin our team of over 5,000 employees globally, who provide the insights through data and next generation technology that help millions of people find, buy and protect the homes they love. From the beginning, CoreLogic has been driven by a single purpose - to innovate and create solutions that solve our clients' toughest challenges in the housing market. CoreLogic is the trusted source for property intelligence, with deep knowledge of powerful economic, social, and environmental forces that promote healthy housing markets and thriving communities.\n\nWe apply that same dedication to creating a diverse and inclusive work culture that inspires innovation and bold thinking. A place where individuals can work on small teams, feel valued, and directly impact the real estate industry. We believe our team members are the best in the business, and we will continue to recruit, retain, develop and reward our most important asset - our people!\n\nJob Description:\n\nAs a member of CoreLogic's Science and Machine Learning Engineering team you will participate in building models for the global real estate market. This position will allow you to work with other machine learning engineers to create new models using a variety of machine learning techniques and technologies on Google Cloud Platform.\n\nJob Responsibilities:\n• Work with product managers, machine learning engineers, and data science modelers to bring new models and enhancements to existing models to production\n• Work with product managers and machine learning engineers to understand and document the technical requirements for the systems that will run models\n• Estimate the effort required to implement new models or modify existing models\n• Architect/design the software environments needed to both build and run the models on Google Cloud Platform\n• Design and implement the software used to acquire and transform the data for use in the models\n• Works with other engineering teams to integrate the models into CoreLogic's products\n• Employ agile methodologies and practices leading or participating on teams of machine learning engineers\n• Monitor and report to management on the status of project efforts, anticipate/identify issues that inhibit the attainment of project goals, and implement corrective actions\n• Foster and maintain good relationships with customers and other teams within CoreLogic to meet expected delivery dates and service levels\n\nJob Qualifications:\n• Bachelor's degree in Computer Science, Computer Engineering, Data Science, or Machine Learning\n• 5 or more years of experience with software development\n• Experience designing system architectures and applications in cloud-based environments\n• Experience with distributed parallel computing\n• Fluent in Python\n• Knowledge and experience with SQL\n• Good Linux shell scripting skills\n• Knowledge and experience with Google Cloud Platform, Cloud Dataflow/Beam, Kubernetes, Docker, Pub/Sub, BigQuery, Dataproc/Spark, or similar technologies on AWS or Azure.\n• Knowledge and experience with Terraform and Ansible\n• Knowledge and experience with Jenkins\n• Good source code management disciple with experience using Git\n• Experience writing automated unit tests\n• Working knowledge of statistics\n• Knowledge and experience with machine learning techniques and tools\n• Strong written and verbal communication skills\n• Experience with iterative agile development methodology\n\nPreferred Qualifications:\n• Master's degree in Data Science or Machine Learning\n\nAnnual Pay Range:\n106,900 - 145,000 USD\n\nCoreLogic benefits information can be found here: http://www.yourcorebenefits.com/. Qualifications, locations and experience of the individual ultimately selected for the position may impact the final actual offered compensation, which may vary from any posted range.\n\nCoreLogic's Diversity Commitment:\n\nCoreLogic is fully committed to employing a diverseworkforce and creating an inclusive workenvironment that embraces everyone's uniquecontributions, experiences and values. We offer anempowered work environment that encouragescreativity, initiative and professional growth andprovides a competitive salary and benefits package. We are better together when we support and recognize our differences.\n\nEOE AA M/F/Veteran/Disability:\n\nCoreLogic is an Equal Opportunity/Affirmative Actionemployer committed to attracting and retaining thebest-qualified people available, without regard torace, color, religion, national origin, gender, sexualorientation, gender identity, age, disability or statusas a veteran of the Armed Forces, or any other basisprotected by federal, state or local law. CoreLogicmaintains a Drug-Free Workplace.\n\nPlease apply on our website for consideration.\n\nPrivacy Policy - http://www.corelogic.com/privacy.aspx\n\nBy providing your telephone number, you agree to receive automated (SMS) text messages at that number from CoreLogic regarding all matters related to your application and, if you are hired, your employment and company business. Message & data rates may apply. You can opt out at any time by responding STOP or UNSUBSCRIBING and will automatically be opted out company-wide.\n\nConnect with us on social media! Click on the quicklinks below to find out more about our company and associates.",
            "job_is_remote": false,
            "job_posted_at_timestamp": 1682298647,
            "job_posted_at_datetime_utc": "2023-04-24T01:10:47.000Z",
            "job_city": "San Diego",
            "job_state": "CA",
            "job_country": "US",
            "job_latitude": 32.715736,
            "job_longitude": -117.16109,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=machine+learning+engineer+in+san+diego,+usa&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=machine+learning+engineer+in+san+diego,+usa&htidocid=AQGhBkhmg_oAAAAAAAAAAA%3D%3D",
            "job_offer_expiration_datetime_utc": "2023-05-23T00:00:00.000Z",
            "job_offer_expiration_timestamp": 1684800000,
            "job_required_experience": {
                "no_experience_required": false,
                "required_experience_in_months": 60,
                "experience_mentioned": true,
                "experience_preferred": false
            },
            "job_required_skills": null,
            "job_required_education": {
                "postgraduate_degree": false,
                "professional_certification": false,
                "high_school": false,
                "associates_degree": false,
                "bachelors_degree": false,
                "degree_mentioned": true,
                "degree_preferred": true,
                "professional_certification_mentioned": false
            },
            "job_experience_in_place_of_education": false,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_currency": null,
            "job_salary_period": null,
            "job_highlights": {
                "Qualifications": [
                    "Bachelor's degree in Computer Science, Computer Engineering, Data Science, or Machine Learning",
                    "5 or more years of experience with software development",
                    "Experience designing system architectures and applications in cloud-based environments",
                    "Experience with distributed parallel computing",
                    "Fluent in Python",
                    "Knowledge and experience with SQL",
                    "Good Linux shell scripting skills",
                    "Knowledge and experience with Google Cloud Platform, Cloud Dataflow/Beam, Kubernetes, Docker, Pub/Sub, BigQuery, Dataproc/Spark, or similar technologies on AWS or Azure",
                    "Knowledge and experience with Terraform and Ansible",
                    "Knowledge and experience with Jenkins",
                    "Good source code management disciple with experience using Git",
                    "Experience writing automated unit tests",
                    "Working knowledge of statistics",
                    "Knowledge and experience with machine learning techniques and tools",
                    "Strong written and verbal communication skills",
                    "Experience with iterative agile development methodology"
                ],
                "Responsibilities": [
                    "As a member of CoreLogic's Science and Machine Learning Engineering team you will participate in building models for the global real estate market",
                    "This position will allow you to work with other machine learning engineers to create new models using a variety of machine learning techniques and technologies on Google Cloud Platform",
                    "Work with product managers, machine learning engineers, and data science modelers to bring new models and enhancements to existing models to production",
                    "Work with product managers and machine learning engineers to understand and document the technical requirements for the systems that will run models",
                    "Estimate the effort required to implement new models or modify existing models",
                    "Architect/design the software environments needed to both build and run the models on Google Cloud Platform",
                    "Design and implement the software used to acquire and transform the data for use in the models",
                    "Works with other engineering teams to integrate the models into CoreLogic's products",
                    "Employ agile methodologies and practices leading or participating on teams of machine learning engineers",
                    "Monitor and report to management on the status of project efforts, anticipate/identify issues that inhibit the attainment of project goals, and implement corrective actions",
                    "Foster and maintain good relationships with customers and other teams within CoreLogic to meet expected delivery dates and service levels"
                ],
                "Benefits": [
                    "106,900 - 145,000 USD"
                ]
            },
            "job_job_title": "Learning engineer",
            "job_posting_language": "en",
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        },
        {
            "employer_name": "UnitedHealth Group",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcT_H4PUSaq_zXYBW1Opdwt19qJE7I-4hUNq77Np&s=0",
            "employer_website": "https://www.unitedhealthgroup.com",
            "employer_company_type": "Finance",
            "job_publisher": "MotherWorks",
            "job_id": "gnw3OzNMYPQAAAAAAAAAAA==",
            "job_employment_type": "FULLTIME",
            "job_title": "Machine Learning Engineer - Remote",
            "job_apply_link": "https://motherworks.com/job/9189232/machine-learning-engineer-remote/",
            "job_apply_is_direct": false,
            "job_apply_quality_score": 0.5131,
            "job_description": "Optum Home & Community Care, part of the UnitedHealth Group family of businesses, is creating something new in health care. We are uniting industry-leading solutions to build an integrated care model that holistically addresses an individual’s physical, mental and social needs – helping patients access and navigate care anytime and anywhere.\n\nAs a team member of our naviHealth product, we help change the way health care is delivered from hospital to home supporting patients transitioning across care settings. This life-changing work helps give older adults more days at home.\n\nWe’re connecting care to create a seamless health journey for patients across care settings. Join our team, it’s your chance to improve the lives of millions while doing your life’s best work.(sm)\n\nAt naviHealth, our mission is to work with extraordinarily talented people who are committed to making a positive and powerful impact on society by transforming health care. naviHealth is the result of almost two decades of dedicated visionary leaders and innovative organizations challenging the status quo for care transition solutions. We do health care differently and we are changing health care one patient at a time. naviHealth is looking to hire a senior-level software engineer with experience building mission-critical service-oriented applications. This role is a key-contributor to the organization and future technologies. Successful candidates will possess proven experience developing and delivering quality software solutions. Moreover, have a genuine passion and energy to grow within an aggressive and fun environment, using the latest technologies in alignment with the company’s technical vision and strategy.\n\nWhy naviHealth?\n\nAt naviHealth, our mission is to work with extraordinarily talented people who are committed to making a positive and powerful impact on society by transforming health care. naviHealth is the result of almost two decades of dedicated visionary leaders and innovative organizations challenging the status quo for care transition solutions. We do health care differently and we are changing health care one patient at a time. Moreover, have a genuine passion and energy to grow within an aggressive and fun environment, using the latest technologies in alignment with the company’s technical vision and strategy.\n\nYou’ll enjoy the flexibility to work remotely * from anywhere within the U.S. as you take on some tough challenges.\n\nPrimary Responsibilities:\n• Collaborate with naviHealth Product, Business, and IT teams in designing and implementing Machine Learning solutions in production and testing/integrating with operational systems\n• Work with Data Scientists and consuming applications to develop, test and deploy model REST end points\n• Implement automated testing and deployment pipelines for ML models\n• Interface with consuming applications and testing teams to coordinate testing and bug fixing\n• Provide support for models deployed in production\n• Build and enhance our Azure based Machine Learning Platform including Feature Store, ML Workbench, Model deployment and Model Monitoring components\n• Work independently in a fast-paced agile environment\n\nYou’ll be rewarded and recognized for your performance in an environment that will challenge you and give you clear direction on what it takes to succeed in your role as well as provide development for other roles you may be interested in.\n\nRequired Qualifications:\n• Undergraduate degree or equivalent experience\n• 3+ years of experience designing and developing Python web applications and API’s\n• 3+ years of experience with Flask, Django or FastAPI (preferred) frameworks\n• 2+ years of experience deploying APIs/models on Kubernetes or as serverless services\n• 2+ years of experience supporting Data Science teams with ML solutions including data/feature engineering and model deployment\n• 2+ years of experience with cloud. Preferably Azure ML and related services\n• Experience with CI/CD tools like Github Actions, Jenkins, Bamboo, Octopus, etc.\n• Knowledge of Git/GitHub integration with CI/CD tools\n\nPreferred Qualifications:\n• Master’s degree\n• 1+ years of experience with data and/feature engineering\n• 1+ years of experience with AppDynamics or equivalent monitoring/observability tools\n• 1+ years of experience with Databricks and MLflow\n• Experience with API performance testing tools like JMeter, Locust, etc.\n\nAbout naviHealth\n\nBeing a pioneer in post-acute management and care transitions with 19 years of experience, naviHealth is uniquely positioned to manage patients, improve clinical and financial outcomes, and share risk with payors and providers. We provide clinical service support alongside proprietary technology and advisory solutions that empower health systems, health plans and post-acute providers to navigate care episodes across the continuum, with the goal of reducing waste and improving patient outcomes.\n\nCareers with Optum. Our objective is to make health care simpler and more effective for everyone. With our hands at work across all aspects of health, you can play a role in creating a healthier world, one insight, one connection and one person at a time. We bring together some of the greatest minds and ideas to take health care to its fullest potential, promoting health equity and accessibility. Work with diverse, engaged and high-performing teams to help solve important challenges.\n\nCalifornia, Colorado, Connecticut, Nevada, New York, Rhode Island, or Washington Residents Only: The salary range for California, Colorado, Connecticut, Nevada, New York, Rhode Island or Washington residents is $67,800 to $133,100. Pay is based on several factors including but not limited to education, work experience, certifications, etc. In addition to your salary, UnitedHealth Group offers benefits such as, a comprehensive benefits package, incentive and recognition programs, equity stock purchase and 401k contribution (all benefits are subject to eligibility requirements). No matter where or when you begin a career with UnitedHealth Group, you’ll find a far-reaching choice of benefits and incentives.\n\n•All employees working remotely will be required to adhere to UnitedHealth Group’s Telecommuter Policy\n\nAt UnitedHealth Group, our mission is to help people live healthier lives and make the health system work better for everyone. We believe everyone-of every race, gender, sexuality, age, location and income-deserves the opportunity to live their healthiest life. Today, however, there are still far too many barriers to good health which are disproportionately experienced by people of color, historically marginalized groups and those with lower incomes. We are committed to mitigating our impact on the environment and enabling and delivering equitable care that addresses health disparities and improves health outcomes - an enterprise priority reflected in our mission.\n\nDiversity creates a healthier atmosphere: UnitedHealth Group is an Equal Employment Opportunity/Affirmative Action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law.\n\nUnitedHealth Group is a drug-free workplace. Candidates are required to pass a drug test before beginning employment.\n\n#DICE",
            "job_is_remote": false,
            "job_posted_at_timestamp": 1682283854,
            "job_posted_at_datetime_utc": "2023-04-23T21:04:14.000Z",
            "job_city": "San Diego",
            "job_state": "CA",
            "job_country": "US",
            "job_latitude": 32.715736,
            "job_longitude": -117.16109,
            "job_benefits": [
                "health_insurance",
                "retirement_savings"
            ],
            "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=machine+learning+engineer+in+san+diego,+usa&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=machine+learning+engineer+in+san+diego,+usa&htidocid=gnw3OzNMYPQAAAAAAAAAAA%3D%3D",
            "job_offer_expiration_datetime_utc": null,
            "job_offer_expiration_timestamp": null,
            "job_required_experience": {
                "no_experience_required": false,
                "required_experience_in_months": 36,
                "experience_mentioned": true,
                "experience_preferred": true
            },
            "job_required_skills": null,
            "job_required_education": {
                "postgraduate_degree": false,
                "professional_certification": false,
                "high_school": false,
                "associates_degree": false,
                "bachelors_degree": false,
                "degree_mentioned": true,
                "degree_preferred": false,
                "professional_certification_mentioned": true
            },
            "job_experience_in_place_of_education": false,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_currency": null,
            "job_salary_period": null,
            "job_highlights": {
                "Qualifications": [
                    "Undergraduate degree or equivalent experience",
                    "3+ years of experience designing and developing Python web applications and API’s",
                    "2+ years of experience deploying APIs/models on Kubernetes or as serverless services",
                    "2+ years of experience supporting Data Science teams with ML solutions including data/feature engineering and model deployment",
                    "2+ years of experience with cloud",
                    "Preferably Azure ML and related services",
                    "Experience with CI/CD tools like Github Actions, Jenkins, Bamboo, Octopus, etc",
                    "Knowledge of Git/GitHub integration with CI/CD tools"
                ],
                "Responsibilities": [
                    "Collaborate with naviHealth Product, Business, and IT teams in designing and implementing Machine Learning solutions in production and testing/integrating with operational systems",
                    "Work with Data Scientists and consuming applications to develop, test and deploy model REST end points",
                    "Implement automated testing and deployment pipelines for ML models",
                    "Interface with consuming applications and testing teams to coordinate testing and bug fixing",
                    "Provide support for models deployed in production",
                    "Build and enhance our Azure based Machine Learning Platform including Feature Store, ML Workbench, Model deployment and Model Monitoring components",
                    "Work independently in a fast-paced agile environment"
                ],
                "Benefits": [
                    "California, Colorado, Connecticut, Nevada, New York, Rhode Island, or Washington Residents Only: The salary range for California, Colorado, Connecticut, Nevada, New York, Rhode Island or Washington residents is $67,800 to $133,100",
                    "Pay is based on several factors including but not limited to education, work experience, certifications, etc",
                    "In addition to your salary, UnitedHealth Group offers benefits such as, a comprehensive benefits package, incentive and recognition programs, equity stock purchase and 401k contribution (all benefits are subject to eligibility requirements)",
                    "No matter where or when you begin a career with UnitedHealth Group, you’ll find a far-reaching choice of benefits and incentives"
                ]
            },
            "job_job_title": "Learning engineer",
            "job_posting_language": "en",
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        },
        {
            "employer_name": "Leidos",
            "employer_logo": "https://www.leidos.com/themes/custom/leidos/logo.png",
            "employer_website": "http://www.leidos.com",
            "employer_company_type": "Computer Services",
            "job_publisher": "Leidos Careers",
            "job_id": "nvQSfIStrocAAAAAAAAAAA==",
            "job_employment_type": "FULLTIME",
            "job_title": "Machine Learning Signal Processing Engineer",
            "job_apply_link": "https://careers.leidos.com/jobs/12423799-machine-learning-signal-processing-engineer?tm_job=R-00107419-OTHLOC-PL-2D2400&tm_event=view&tm_company=2502&bid=414",
            "job_apply_is_direct": false,
            "job_apply_quality_score": 0.8269,
            "job_description": "Description\n\nJob Description:\n\nToday, Electronic Warfare (EW) is a growing enterprise - protecting the warfighter and our national security against ever-adapting threats. The Leidos Innovations Center (LInC) at Leidos currently has an opening for a Signal Processing Engineer to support EW programs in Arlington, VA or San Diego, CA.\n\nAs part of our team, you will work on programs that improve the robustness and efficacy of sensors and signals in complex environments. More broadly, you will help advance the state-of-the-art in research and advanced applications to support ongoing and future EW programs. Simultaneously, you will work alongside scientists and experts in these fields to grow your own knowledge and career while mentoring junior level engineers and leading tasks.\n\nRegular tasks will include:\n\n- Develop, model, and test algorithms in Matlab, Simulink, or C++\n\n- Analyze results from simulation or real data to identify root causes and trends\n\n- Develop novel and advanced signal processing/machine learning algorithms, performance simulation, and analysis - using simulated and real data in both time series and spectral domains\n\n- Leverage state-of-the-art AI/ML tools and methodologies to improve algorithms performance\n\n- Participate in lab-based and field testing\n\n- Support marketing and business development initiatives\n\n- Engage in multiple projects, interacting with Customers as well\n\nRequired Qualifications:\n\n- Must be U.S. Citizen\n\n- Active Secret clearance\n\n- Bachelors of Science in Electrical Engineering, Physics, Computer Science, Mathematics or related field\n\n- 4+ years’ experience in radar signal processing\n\n- Fluent with tools such as MATLAB, Linux, Mathematica, Python, Simulink - and languages such as C/C++, Java etc.\n\n- Working knowledge areas such as digital filtering, spectral estimation, detection and estimation theory, linear algebra and stochastic processes\n\n- Experience with Machine Learning and/or Artificial Intelligence algorithms and libraries, such as TensorFlow\n\n- Demonstrated strong oral and written communication\n\n- Ability to work in a team environment, as well as independently\n\n- Adaptability to new challenges with a strong motivation to grow and learn in new areas\n\nPreferred Qualifications:\n\n- Active TS/SCI clearance preferred\n\n- Master’s Degree in Electrical Engineering, Physics, Computer Science, Mathematics or related field\n\n- Strong understanding of machine learning frameworks, RF front end design, and signal processing algorithm development\n\n- Task lead or team leadership experience\n\n- Experience translating functional requirements into tasks\n\n- Experience working in areas of modeling and simulation (M&S), radar, adaptive radar, signals processing, algorithm development synthetic aperture radar (SAR) or similar fields\n\nLInC\n\nElectronic Warfare\n\nPay Range:\nPay Range $78,000.00 - $120,000.00 - $162,000.00\n\nThe Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law.",
            "job_is_remote": false,
            "job_posted_at_timestamp": 1680196386,
            "job_posted_at_datetime_utc": "2023-03-30T17:13:06.000Z",
            "job_city": "San Diego",
            "job_state": "CA",
            "job_country": "US",
            "job_latitude": 32.715736,
            "job_longitude": -117.16109,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=machine+learning+engineer+in+san+diego,+usa&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=machine+learning+engineer+in+san+diego,+usa&htidocid=nvQSfIStrocAAAAAAAAAAA%3D%3D",
            "job_offer_expiration_datetime_utc": null,
            "job_offer_expiration_timestamp": null,
            "job_required_experience": {
                "no_experience_required": false,
                "required_experience_in_months": 48,
                "experience_mentioned": true,
                "experience_preferred": false
            },
            "job_required_skills": null,
            "job_required_education": {
                "postgraduate_degree": false,
                "professional_certification": false,
                "high_school": false,
                "associates_degree": false,
                "bachelors_degree": false,
                "degree_mentioned": true,
                "degree_preferred": true,
                "professional_certification_mentioned": false
            },
            "job_experience_in_place_of_education": false,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_currency": null,
            "job_salary_period": null,
            "job_highlights": {
                "Qualifications": [
                    "Must be U.S. Citizen",
                    "Active Secret clearance",
                    "Bachelors of Science in Electrical Engineering, Physics, Computer Science, Mathematics or related field",
                    "4+ years’ experience in radar signal processing",
                    "Fluent with tools such as MATLAB, Linux, Mathematica, Python, Simulink - and languages such as C/C++, Java etc",
                    "Working knowledge areas such as digital filtering, spectral estimation, detection and estimation theory, linear algebra and stochastic processes",
                    "Experience with Machine Learning and/or Artificial Intelligence algorithms and libraries, such as TensorFlow",
                    "Demonstrated strong oral and written communication",
                    "Ability to work in a team environment, as well as independently",
                    "Adaptability to new challenges with a strong motivation to grow and learn in new areas"
                ],
                "Responsibilities": [
                    "More broadly, you will help advance the state-of-the-art in research and advanced applications to support ongoing and future EW programs",
                    "Simultaneously, you will work alongside scientists and experts in these fields to grow your own knowledge and career while mentoring junior level engineers and leading tasks",
                    "Develop, model, and test algorithms in Matlab, Simulink, or C++",
                    "Analyze results from simulation or real data to identify root causes and trends",
                    "Develop novel and advanced signal processing/machine learning algorithms, performance simulation, and analysis - using simulated and real data in both time series and spectral domains",
                    "Leverage state-of-the-art AI/ML tools and methodologies to improve algorithms performance",
                    "Participate in lab-based and field testing",
                    "Support marketing and business development initiatives",
                    "Engage in multiple projects, interacting with Customers as well"
                ],
                "Benefits": [
                    "Pay Range $78,000.00 - $120,000.00 - $162,000.00",
                    "The Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary"
                ]
            },
            "job_job_title": "Processing engineer",
            "job_posting_language": "en",
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        },
        {
            "employer_name": "NanoCellect Biomedical",
            "employer_logo": null,
            "employer_website": "http://nanocellect.com",
            "employer_company_type": null,
            "job_publisher": "San Diego - Geebo",
            "job_id": "aG4nlpOj8dgAAAAAAAAAAA==",
            "job_employment_type": "FULLTIME",
            "job_title": "Machine Learning Engineer at NanoCellect Biomedical in San Diego, CA",
            "job_apply_link": "https://sandiego-ca.geebo.com/jobs-online/view/id/1048013538-machine-learning-engineer-at-/",
            "job_apply_is_direct": true,
            "job_apply_quality_score": 0.4226,
            "job_description": "Company Overview NanoCellect's mission is to facilitate breakthrough biomedical discoveries by making cell sorting and analysis technology more portable, affordable, and easy-to-use. We use microfluidics to make flow cytometers that enable biomedical scientists to analyze and sort cells required for drug discovery, and basic research. NanoCellect's proprietary software is a key component of its products and is critical to the company's success. Job Summary We are seeking a highly motivated individual to join a team of researchers, engineers, and scientists as a Machine Learning Engineer. This person should thrive in a fast-paced collaborative and interdisciplinary environment and be a self-motivated, results-driven individual ready to expand a revolutionary platform for real-time cell analysis and isolation. Responsibilities and Duties Assist with the development of our model training and evaluation infrastructure. Work closely with data scientists to experiment on model architectures and take them to production. Build, maintain, and improve data processing pipelines that process billions of data points and petabytes of data. Work in an interdisciplinary team composed of electrical engineers, firmware engineers, biologists, and software engineers to help solve hard problems which improve biological research. Qualifications and Skills Bachelor's in Computer Science or Data Science or equivalent professional experience 2\nyears of software development experience Expertise in working with at least one deep learning framework, such as PyTorch, TensorFlow, Caffe Experienced in data visualization and image processing Strong analytical and problem-solving skills Be able and open to pick up new skills, work with 3rd party technologies and devices Maintain a high degree of ethical standard and trustworthiness Strong technical written and communication skills On-site position. Work from home as appropriate Proficient in Python, experienced in GPU acceleration is a plus Familiar with computer vision deep learning models and image processing algorithms Experienced in deep learning model deployment and maintenance workflow Experienced in cloud providers such as GCP or AWS Experienced in working with ETL pipelines A track record for delivering Machine Learning projects for a product Strong proactive communication, natural curiosity. Ambition to apply skills to a wide variety of fields Benefits and Perks Unlimited PTO Competitive Medical, Dental, Vision coverage, FSA, Life Insurance and LTD 401K with company match Professional development Casual dress code, free snacks, free onsite gym access Cohesive team environment Great potential for growth\nSalary Range:\n$80K -- $100K\nMinimum Qualification\nData Science & Machine Learning, Software DevelopmentEstimated Salary: $20 to $28 per hour based on qualifications.",
            "job_is_remote": false,
            "job_posted_at_timestamp": 1682294400,
            "job_posted_at_datetime_utc": "2023-04-24T00:00:00.000Z",
            "job_city": "San Diego",
            "job_state": "CA",
            "job_country": "US",
            "job_latitude": 32.715736,
            "job_longitude": -117.16109,
            "job_benefits": [
                "paid_time_off",
                "health_insurance",
                "retirement_savings",
                "dental_coverage"
            ],
            "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=machine+learning+engineer+in+san+diego,+usa&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=machine+learning+engineer+in+san+diego,+usa&htidocid=aG4nlpOj8dgAAAAAAAAAAA%3D%3D",
            "job_offer_expiration_datetime_utc": "2023-05-01T00:00:00.000Z",
            "job_offer_expiration_timestamp": 1682899200,
            "job_required_experience": {
                "no_experience_required": false,
                "required_experience_in_months": 24,
                "experience_mentioned": true,
                "experience_preferred": true
            },
            "job_required_skills": null,
            "job_required_education": {
                "postgraduate_degree": false,
                "professional_certification": false,
                "high_school": false,
                "associates_degree": false,
                "bachelors_degree": false,
                "degree_mentioned": true,
                "degree_preferred": false,
                "professional_certification_mentioned": false
            },
            "job_experience_in_place_of_education": false,
            "job_min_salary": 20,
            "job_max_salary": 28,
            "job_salary_currency": "USD",
            "job_salary_period": "HOUR",
            "job_highlights": {
                "Qualifications": [
                    "Qualifications and Skills Bachelor's in Computer Science or Data Science or equivalent professional experience 2",
                    "years of software development experience Expertise in working with at least one deep learning framework, such as PyTorch, TensorFlow, Caffe Experienced in data visualization and image processing Strong analytical and problem-solving skills Be able and open to pick up new skills, work with 3rd party technologies and devices Maintain a high degree of ethical standard and trustworthiness Strong technical written and communication skills On-site position"
                ],
                "Responsibilities": [
                    "Responsibilities and Duties Assist with the development of our model training and evaluation infrastructure",
                    "Work closely with data scientists to experiment on model architectures and take them to production",
                    "Build, maintain, and improve data processing pipelines that process billions of data points and petabytes of data",
                    "Work in an interdisciplinary team composed of electrical engineers, firmware engineers, biologists, and software engineers to help solve hard problems which improve biological research"
                ],
                "Benefits": [
                    "Ambition to apply skills to a wide variety of fields Benefits and Perks Unlimited PTO Competitive Medical, Dental, Vision coverage, FSA, Life Insurance and LTD 401K with company match Professional development Casual dress code, free snacks, free onsite gym access Cohesive team environment Great potential for growth",
                    "$80K -- $100K"
                ]
            },
            "job_job_title": "Learning engineer",
            "job_posting_language": "en",
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        },
        {
            "employer_name": "Logic20/20 Inc.",
            "employer_logo": "https://media.licdn.com/dms/image/C560BAQFvQ2sTtdeLiA/company-logo_200_200/0/1656686762740?e=2147483647&v=beta&t=Zfm4OQtG-ks9OGmCeeDllT-rjtb_bdGFrelTp6ZmHRI",
            "employer_website": "http://www.logic2020.com",
            "employer_company_type": null,
            "job_publisher": "ZipRecruiter",
            "job_id": "S91KbPniEVwAAAAAAAAAAA==",
            "job_employment_type": "FULLTIME",
            "job_title": "Machine Learning Engineer",
            "job_apply_link": "https://www.ziprecruiter.com/c/Logic20-20-Inc./Job/Machine-Learning-Engineer/-in-San-Diego,CA?jid=01d2984b967ce0df",
            "job_apply_is_direct": false,
            "job_apply_quality_score": 0.5591,
            "job_description": "Company Description\n\nWe're a seven-time Best Company to Work For, where intelligent, talented people come together to do outstanding work - and have a lot of fun while they're at it. Because we're a full-service consulting firm with a diverse client base, you can count on a steady stream of opportunities to work with cutting-edge technologies on projects that make a real difference. Logic20/20's Global Delivery Model creates a connected experience for Logicians across geographies. You'll have access to projects in different locations, the technology to support Connected Teams, and in-person and online culture events in our Connected Hub cities.\n\nJob Description\n\nAbout the Team\n\nThe Logic20/20 Advanced Analytics team combines data engineering, data science, and visual analytics to mitigate risk, optimize operations, and automate processes for the ultimate user experience. Our lean-in learning culture is focused on building expertise and delivering high-value solutions with real business impact across industries, whether they are leveling up or blazing a trail.\n\n\"We build an environment where we really operate as One Team, building up each other's careers and capabilities.\" - Adam Cornille, Senior Director, Advanced Analytics\n\nAbout You\n\nLogic20/20 is seeking a Machine Learning Engineer to lead and support a team at one of the nation's top utilities companies on the west coast that is working on RSE calculations and improvement. This is an exciting opportunity to make an impact by leveraging AI and ML techniques to create production-level systems through the application of machine learning models.\n\nQualifications\n\nMust have:\n• 5+ years of experience building and deploying machine learning models to production in a cloud environment\n• 3+ years of hands-on Python experience\n• Strong experience with Terraform, Ansible, CloudFormation, Basel or Puppet\n• Ability to build CI/CD pipelines\n• Knowledge of professional enterprise software development and practices including software lifecycle, best coding practices, version control, architecture, testing and deployment\n\nPreferred:\n• Experience working in the Utilities industry\n• Master's degree/PhD in computer science or related field\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines.\n\nCompensation range: $130,000 - $200,000, depending on experience\n\nAbout Logic20/20\n\nTo learn more about Logic20/20, please visit: https://www.logic2020.com/careers/life-at-logic\n\nCore Values\n\nAt Logic20/20, we are guided by three core values: Drive toward Excellence, Act with Integrity & Foster a Culture of We. These values were generated and agreed upon by our employees-and they help us pursue our goal of being one of the best companies to work for and to work with. Learn more at https://www.logic2020.com/company/our-values.\n\nLogic20/20 Benefits\n\nWhy Logic20/20? It's our goal to be one of the best companies to work for. One piece of the puzzle is an evolving set of benefits that extend past medical, dental, and 401(k).\n\nYou will have\n• Career Development - A built-in program from day 1, providing a mentor and individually-directed training opportunities, plus access to leaders across the company\n• PTO, Paid Holidays, & Voluntary Leave - Worry-free time off to recharge and pursue your personal goals\n• Community & Committees - As part of our \"Culture of We,\" Logic20/20 invests in providing many social, interest, and learning opportunities\n• Recognition - From peer recognition, swag, and the chance to win a once-in-a-lifetime type of award, we make your Logic20/20 journey stand out\n• Referral Programs & Bonuses - Employee, project, and sales referral programs with paid incentives\n\nEqual Opportunity Statement\n\nWe believe that people should be celebrated: for their talents, ideas, and skills, but most of all, for what makes them unique. We prohibit harassment and/or discrimination based on age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status, or any other basis as protected by federal, state, or local law.\n\nTo learn more about our DE&I initiatives, please visit: https://www.logic2020.com/company/diversity-equity-inclusion\n\nPrivacy Policy\n\nDuring the recruitment and hiring process, we gather, process, and store some of your personal data. We consider data privacy a priority. For further information, please view our company privacy policy.",
            "job_is_remote": false,
            "job_posted_at_timestamp": 1681862400,
            "job_posted_at_datetime_utc": "2023-04-19T00:00:00.000Z",
            "job_city": "San Diego",
            "job_state": "CA",
            "job_country": "US",
            "job_latitude": 32.715736,
            "job_longitude": -117.16109,
            "job_benefits": [
                "dental_coverage",
                "health_insurance",
                "paid_time_off",
                "retirement_savings"
            ],
            "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=machine+learning+engineer+in+san+diego,+usa&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=machine+learning+engineer+in+san+diego,+usa&htidocid=S91KbPniEVwAAAAAAAAAAA%3D%3D",
            "job_offer_expiration_datetime_utc": "2023-05-21T00:00:00.000Z",
            "job_offer_expiration_timestamp": 1684627200,
            "job_required_experience": {
                "no_experience_required": false,
                "required_experience_in_months": 60,
                "experience_mentioned": true,
                "experience_preferred": false
            },
            "job_required_skills": null,
            "job_required_education": {
                "postgraduate_degree": false,
                "professional_certification": false,
                "high_school": false,
                "associates_degree": false,
                "bachelors_degree": false,
                "degree_mentioned": true,
                "degree_preferred": false,
                "professional_certification_mentioned": false
            },
            "job_experience_in_place_of_education": false,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_currency": null,
            "job_salary_period": null,
            "job_highlights": {
                "Qualifications": [
                    "5+ years of experience building and deploying machine learning models to production in a cloud environment",
                    "3+ years of hands-on Python experience",
                    "Strong experience with Terraform, Ansible, CloudFormation, Basel or Puppet",
                    "Ability to build CI/CD pipelines",
                    "Knowledge of professional enterprise software development and practices including software lifecycle, best coding practices, version control, architecture, testing and deployment"
                ],
                "Benefits": [
                    "Compensation range: $130,000 - $200,000, depending on experience",
                    "Career Development - A built-in program from day 1, providing a mentor and individually-directed training opportunities, plus access to leaders across the company",
                    "PTO, Paid Holidays, & Voluntary Leave - Worry-free time off to recharge and pursue your personal goals",
                    "Community & Committees - As part of our \"Culture of We,\" Logic20/20 invests in providing many social, interest, and learning opportunities",
                    "Recognition - From peer recognition, swag, and the chance to win a once-in-a-lifetime type of award, we make your Logic20/20 journey stand out",
                    "Referral Programs & Bonuses - Employee, project, and sales referral programs with paid incentives"
                ]
            },
            "job_job_title": "Learning engineer",
            "job_posting_language": "en",
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        },
        {
            "employer_name": "Harnham",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRSom1UrYd1teIlz6RlzpnKk8cRRgRXWhfM2PbM&s=0",
            "employer_website": null,
            "employer_company_type": null,
            "job_publisher": "LinkedIn",
            "job_id": "v4dDTJftFOIAAAAAAAAAAA==",
            "job_employment_type": "FULLTIME",
            "job_title": "Senior Machine Learning Engineer",
            "job_apply_link": "https://www.linkedin.com/jobs/view/senior-machine-learning-engineer-at-harnham-3391780111",
            "job_apply_is_direct": false,
            "job_apply_quality_score": 0.5721,
            "job_description": "Senior Machine Learning Engineer\n\nSan Diego, CA $140,000 - $160,000 + Competitive Benefits\n\nTHE COMPANY\n• COMPANY: An exciting fintech start up that just signed multiple new clients and is building out their data science function!\n• TEAM: Work with a team of six data scientists and machine learning engineers\n• CULTURE: Casual work environment along with a diverse and inclusive culture.\n\nTHE ROLE\n\nAs a Senior Machine Learning Engineer you will…\n• Modeling: Build advanced algorithms for fraud detection and risk analysis; do feature engineering\n• Deploy models end to end into production and maintain them in production\n• Work with a large amount of customer and historical data\n• Research: Innovate creative advanced machine learning solutions\n• Teamwork: Work directly with stakeholders and clients\n\nYOUR SKILLS AND EXPERIENCE\n• 3+ years of full time experience in data science and machine learning\n• Experience building out machine learning algorithms for fraud detection and risk analysis\n• Experience working end to end and deploying models into production\n• Experience working with large data sets and doing feature engineering\n• Strong communication skills\n• Tools: Python, SQL, AWS Sagemaker\n\nTHE BENEFITS\n\nAs a Senior Machine Learning Engineer, you can expect a base salary between $140,000 to $160,000 (based on experience) plus competitive benefits.\n\nHOW TO APPLY\n\nPlease register your interest by sending your CV to Kristianna Chung via the Apply link on this page",
            "job_is_remote": false,
            "job_posted_at_timestamp": 1680885750,
            "job_posted_at_datetime_utc": "2023-04-07T16:42:30.000Z",
            "job_city": "San Diego",
            "job_state": "CA",
            "job_country": "US",
            "job_latitude": 32.715736,
            "job_longitude": -117.16109,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=machine+learning+engineer+in+san+diego,+usa&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=machine+learning+engineer+in+san+diego,+usa&htidocid=v4dDTJftFOIAAAAAAAAAAA%3D%3D",
            "job_offer_expiration_datetime_utc": "2023-10-03T20:27:57.000Z",
            "job_offer_expiration_timestamp": 1696364877,
            "job_required_experience": {
                "no_experience_required": false,
                "required_experience_in_months": 36,
                "experience_mentioned": true,
                "experience_preferred": true
            },
            "job_required_skills": null,
            "job_required_education": {
                "postgraduate_degree": false,
                "professional_certification": false,
                "high_school": false,
                "associates_degree": false,
                "bachelors_degree": true,
                "degree_mentioned": false,
                "degree_preferred": false,
                "professional_certification_mentioned": false
            },
            "job_experience_in_place_of_education": false,
            "job_min_salary": 140000,
            "job_max_salary": 160000,
            "job_salary_currency": "USD",
            "job_salary_period": "YEAR",
            "job_highlights": {
                "Qualifications": [
                    "3+ years of full time experience in data science and machine learning",
                    "Experience building out machine learning algorithms for fraud detection and risk analysis",
                    "Experience working end to end and deploying models into production",
                    "Experience working with large data sets and doing feature engineering",
                    "Strong communication skills",
                    "Tools: Python, SQL, AWS Sagemaker"
                ],
                "Responsibilities": [
                    "As a Senior Machine Learning Engineer you will…",
                    "Modeling: Build advanced algorithms for fraud detection and risk analysis; do feature engineering",
                    "Deploy models end to end into production and maintain them in production",
                    "Work with a large amount of customer and historical data",
                    "Teamwork: Work directly with stakeholders and clients"
                ],
                "Benefits": [
                    "San Diego, CA $140,000 - $160,000 + Competitive Benefits",
                    "As a Senior Machine Learning Engineer, you can expect a base salary between $140,000 to $160,000 (based on experience) plus competitive benefits"
                ]
            },
            "job_job_title": "Learning engineer",
            "job_posting_language": "en",
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        },
        {
            "employer_name": "LEIDOS",
            "employer_logo": "https://www.leidos.com/themes/custom/leidos/logo.png",
            "employer_website": "http://www.leidos.com",
            "employer_company_type": "Computer Services",
            "job_publisher": "FOX 5 San Diego Jobs",
            "job_id": "GX_x0Mqph5kAAAAAAAAAAA==",
            "job_employment_type": "FULLTIME",
            "job_title": "Machine Learning Signal Processing Engineer",
            "job_apply_link": "https://jobs.fox5sandiego.com/jobs/machine-learning-signal-processing-engineer-la-jolla-california/985673153-2/",
            "job_apply_is_direct": false,
            "job_apply_quality_score": 0.5555,
            "job_description": "Description\n\nJob Description:\n\nToday, Electronic Warfare (EW) is a growing enterprise - protecting the warfighter and our national security against ever-adapting threats. The Leidos Innovations Center (LInC) at Leidos currently has an opening for a Signal Processing Engineer to support EW programs in Arlington, VA or San Diego, CA.\n\nAs part of our team, you will work on programs that improve the robustness and efficacy of sensors and signals in complex environments. More broadly, you will help advance the state-of-the-art in research and advanced applications to support ongoing and future EW programs. Simultaneously, you will work alongside scientists and experts in these fields to grow your own knowledge and career while mentoring junior level engineers and leading tasks.\n\nRegular tasks will include:\n\n- Develop, model, and test algorithms in Matlab, Simulink, or C++\n\n- Analyze results from simulation or real data to identify root causes and trends\n\n- Develop novel and advanced signal processing/machine learning algorithms, performance simulation, and analysis - using simulated and real data in both time series and spectral domains\n\n- Leverage state-of-the-art AI/ML tools and methodologies to improve algorithms performance\n\n- Participate in lab-based and field testing\n\n- Support marketing and business development initiatives\n\n- Engage in multiple projects, interacting with Customers as well\n\nRequired Qualifications:\n\n- Must be U.S. Citizen\n\n- Active Secret clearance\n\n- Bachelors of Science in Electrical Engineering, Physics, Computer Science, Mathematics or related field\n\n- 4+ years' experience in radar signal processing\n\n- Fluent with tools such as MATLAB, Linux, Mathematica, Python, Simulink - and languages such as C/C++, Java etc.\n\n- Working knowledge areas such as digital filtering, spectral estimation, detection and estimation theory, linear algebra and stochastic processes\n\n- Experience with Machine Learning and/or Artificial Intelligence algorithms and libraries, such as TensorFlow\n\n- Demonstrated strong oral and written communication\n\n- Ability to work in a team environment, as well as independently\n\n- Adaptability to new challenges with a strong motivation to grow and learn in new areas\n\nPreferred Qualifications:\n\n- Active TS/SCI clearance preferred\n\n- Master's Degree in Electrical Engineering, Physics, Computer Science, Mathematics or related field\n\n- Strong understanding of machine learning frameworks, RF front end design, and signal processing algorithm development\n\n- Task lead or team leadership experience\n\n- Experience translating functional requirements into tasks\n\n- Experience working in areas of modeling and simulation (M&S), radar, adaptive radar, signals processing, algorithm development synthetic aperture radar (SAR) or similar fields\n\nLInC\n\nElectronic Warfare\n\nPay Range:\nPay Range $78,000.00 - $120,000.00 - $162,000.00\n\nThe Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law.",
            "job_is_remote": false,
            "job_posted_at_timestamp": 1682250303,
            "job_posted_at_datetime_utc": "2023-04-23T11:45:03.000Z",
            "job_city": null,
            "job_state": "CA",
            "job_country": "US",
            "job_latitude": 32.828327,
            "job_longitude": -117.25585,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=machine+learning+engineer+in+san+diego,+usa&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=machine+learning+engineer+in+san+diego,+usa&htidocid=GX_x0Mqph5kAAAAAAAAAAA%3D%3D",
            "job_offer_expiration_datetime_utc": null,
            "job_offer_expiration_timestamp": null,
            "job_required_experience": {
                "no_experience_required": false,
                "required_experience_in_months": 48,
                "experience_mentioned": true,
                "experience_preferred": false
            },
            "job_required_skills": null,
            "job_required_education": {
                "postgraduate_degree": false,
                "professional_certification": false,
                "high_school": false,
                "associates_degree": false,
                "bachelors_degree": false,
                "degree_mentioned": true,
                "degree_preferred": true,
                "professional_certification_mentioned": false
            },
            "job_experience_in_place_of_education": false,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_currency": null,
            "job_salary_period": null,
            "job_highlights": {
                "Qualifications": [
                    "Must be U.S. Citizen",
                    "Active Secret clearance",
                    "Bachelors of Science in Electrical Engineering, Physics, Computer Science, Mathematics or related field",
                    "4+ years' experience in radar signal processing",
                    "Fluent with tools such as MATLAB, Linux, Mathematica, Python, Simulink - and languages such as C/C++, Java etc",
                    "Working knowledge areas such as digital filtering, spectral estimation, detection and estimation theory, linear algebra and stochastic processes",
                    "Experience with Machine Learning and/or Artificial Intelligence algorithms and libraries, such as TensorFlow",
                    "Demonstrated strong oral and written communication",
                    "Ability to work in a team environment, as well as independently",
                    "Adaptability to new challenges with a strong motivation to grow and learn in new areas"
                ],
                "Responsibilities": [
                    "More broadly, you will help advance the state-of-the-art in research and advanced applications to support ongoing and future EW programs",
                    "Simultaneously, you will work alongside scientists and experts in these fields to grow your own knowledge and career while mentoring junior level engineers and leading tasks",
                    "Develop, model, and test algorithms in Matlab, Simulink, or C++",
                    "Analyze results from simulation or real data to identify root causes and trends",
                    "Develop novel and advanced signal processing/machine learning algorithms, performance simulation, and analysis - using simulated and real data in both time series and spectral domains",
                    "Leverage state-of-the-art AI/ML tools and methodologies to improve algorithms performance",
                    "Participate in lab-based and field testing",
                    "Support marketing and business development initiatives",
                    "Engage in multiple projects, interacting with Customers as well"
                ],
                "Benefits": [
                    "Pay Range $78,000.00 - $120,000.00 - $162,000.00",
                    "The Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary"
                ]
            },
            "job_job_title": "Processing engineer",
            "job_posting_language": "en",
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        },
        {
            "employer_name": "Booz Allen Hamilton",
            "employer_logo": "https://boozallen.com/content/dam/boozallen_site/homepage/booz-allen-logo.svg",
            "employer_website": "http://www.boozallen.com",
            "employer_company_type": "Consulting",
            "job_publisher": "Booz Allen Hamilton",
            "job_id": "6FEpqpj65TcAAAAAAAAAAA==",
            "job_employment_type": "FULLTIME",
            "job_title": "Machine Learning Engineer, Lead",
            "job_apply_link": "https://careers.boozallen.com/jobs/JobDetail/San-Diego-Machine-Learning-Engineer-Lead-R0156695/69561",
            "job_apply_is_direct": false,
            "job_apply_quality_score": 0.8145,
            "job_description": "Machine Learning Engineer, Lead\n\nThe Opportunity:\n\nAs an experienced engineer, you know that machine learning is critical to understanding and processing massive datasets. Your ability to conduct statistical analyses on business processes using Machine Learning (ML) techniques makes you an integral part of delivering a customer-focused solution. We need your technical knowledge and desire to problem-solve to support DoD and Federal Agencies. As an ML Engineer on our Global Defense team, you’ll train, test, deploy, and maintain models that learn from data.\n\nIn this role, you’ll lead the direction of mission-critical solutions by applying best-fit ML algorithms and introducing leading-edge technologies. You’ll share your knowledge with a large community of ML Engineers across the firm and collaborate with data engineers, data scientists, solutions architects, and product owners to deliver world class solutions to deliver mentorship, training, and solutions to real world problems. Your advanced consulting skills and extensive technical expertise will guide clients as they navigate the landscape of ML algorithms, tools, and frameworks.\n\nJoin us. The world can’t wait.\n\nYou Have: \n• 4+ years of experience with ML and data science\n• 2+ years of experience implementing, testing, and fielding automation for artificial intelligence and ML solutions\n• 2+ years of experience in a management or advisory role\n• Experience with scripting languages, including Python, R, or Scala\n• Experience with ML frameworks, including Keras, TensorFlow, or PyTorch\n• Experience with Containerization and Kubernetes\n• Experience facing clients and requirements gathering\n• Ability to obtain a security clearance\n• Bachelor's degree\n\nNice If You Have: \n• Experience working in Kanban and Agile development processes\n• Experience with Apache Spark and big data technologies\n• Experience with cloud services, including AWS, Azure, or GCP\n• Experience with Git and collaboration tools, including Jenkins, JIRA, Confluence, Nexus, or Bitbucket\n• Master's degree\n\nClearance: \n\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information.\n\nCreate Your Career:\n\nGrow With Us\n\nYour growth matters to us—that’s why we offer a variety of ways for you to develop your career. With professional and leadership development opportunities like upskilling programs, tuition reimbursement, mentoring, and firm-sponsored networking, you can chart a unique and fulfilling career path on your own terms.\n\nA Place Where You Belong\n\nDiverse perspectives cultivate collective ingenuity. Booz Allen’s culture of respect, equity, and opportunity means that, here, you are free to bring your whole self to work. With an array of business resource groups and other opportunities for connection, you’ll build your community in no time.\n\nSupport Your Well-Being\n\nOur comprehensive benefits package includes wellness programs with HSA contributions, paid holidays, paid parental leave, a generous 401(k) match, and more. With these benefits, plus the option for flexible schedules and remote and hybrid locations, we’ll support you as you pursue a balanced, fulfilling life—at work and at home.\n\nYour Candidate Journey\n\nAt Booz Allen, we know our people are what propel us forward, and we value relationships most of all. Here, we’ve compiled a list of resources so you’ll know what to expect as we forge a connection with you during your journey as a candidate with us.\n\nCompensation\n\nAt Booz Allen, we celebrate your contributions, provide you with opportunities and choices, and support your total well-being. Our offerings include health, life, disability, financial, and retirement benefits, as well as paid leave, professional development, tuition assistance, work-life programs, and dependent care. Our recognition awards program acknowledges employees for exceptional performance and superior demonstration of our values. Full-time and part-time employees working at least 20 hours a week on a regular basis are eligible to participate in Booz Allen’s benefit programs. Individuals that do not meet the threshold are only eligible for select offerings, not inclusive of health benefits. We encourage you to learn more about our total benefits by visiting the Resource page on our Careers site and reviewing Our Employee Benefits page.\n\nSalary at Booz Allen is determined by various factors, including but not limited to location, the individual’s particular combination of education, knowledge, skills, competencies, and experience, as well as contract-specific affordability and organizational requirements. The projected compensation range for this position is $121,200.00 to $275,000.00 (annualized USD). The estimate displayed represents the typical salary range for this position and is just one component of Booz Allen’s total compensation package for employees.\n\nWork Model\nOur people-first culture prioritizes the benefits of flexibility and collaboration, whether that happens in person or remotely.\n• If this position is listed as remote or hybrid, you’ll periodically work from a Booz Allen or client site facility.\n• If this position is listed as onsite, you’ll work with colleagues and clients in person, as needed for the specific role.\n\nEEO Commitment\n\nWe’re an equal employment opportunity/affirmative action employer that empowers our people to fearlessly drive change – no matter their race, color, ethnicity, religion, sex (including pregnancy, childbirth, lactation, or related medical conditions), national origin, ancestry, age, marital status, sexual orientation, gender identity and expression, disability, veteran status, military or uniformed service member status, genetic information, or any other status protected by applicable federal, state, local, or international law.",
            "job_is_remote": false,
            "job_posted_at_timestamp": 1667347200,
            "job_posted_at_datetime_utc": "2022-11-02T00:00:00.000Z",
            "job_city": "San Diego",
            "job_state": "CA",
            "job_country": "US",
            "job_latitude": 32.715736,
            "job_longitude": -117.16109,
            "job_benefits": [
                "health_insurance",
                "retirement_savings"
            ],
            "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=machine+learning+engineer+in+san+diego,+usa&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=machine+learning+engineer+in+san+diego,+usa&htidocid=6FEpqpj65TcAAAAAAAAAAA%3D%3D",
            "job_offer_expiration_datetime_utc": null,
            "job_offer_expiration_timestamp": null,
            "job_required_experience": {
                "no_experience_required": false,
                "required_experience_in_months": 48,
                "experience_mentioned": true,
                "experience_preferred": false
            },
            "job_required_skills": null,
            "job_required_education": {
                "postgraduate_degree": false,
                "professional_certification": false,
                "high_school": false,
                "associates_degree": false,
                "bachelors_degree": false,
                "degree_mentioned": true,
                "degree_preferred": false,
                "professional_certification_mentioned": false
            },
            "job_experience_in_place_of_education": false,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_currency": null,
            "job_salary_period": null,
            "job_highlights": {
                "Qualifications": [
                    "We need your technical knowledge and desire to problem-solve to support DoD and Federal Agencies",
                    "4+ years of experience with ML and data science",
                    "2+ years of experience implementing, testing, and fielding automation for artificial intelligence and ML solutions",
                    "2+ years of experience in a management or advisory role",
                    "Experience with scripting languages, including Python, R, or Scala",
                    "Experience with ML frameworks, including Keras, TensorFlow, or PyTorch",
                    "Experience with Containerization and Kubernetes",
                    "Experience facing clients and requirements gathering",
                    "Ability to obtain a security clearance",
                    "Bachelor's degree",
                    "Experience working in Kanban and Agile development processes",
                    "Experience with Apache Spark and big data technologies",
                    "Experience with cloud services, including AWS, Azure, or GCP",
                    "Experience with Git and collaboration tools, including Jenkins, JIRA, Confluence, Nexus, or Bitbucket",
                    "Master's degree"
                ],
                "Responsibilities": [
                    "Your ability to conduct statistical analyses on business processes using Machine Learning (ML) techniques makes you an integral part of delivering a customer-focused solution",
                    "As an ML Engineer on our Global Defense team, you’ll train, test, deploy, and maintain models that learn from data",
                    "In this role, you’ll lead the direction of mission-critical solutions by applying best-fit ML algorithms and introducing leading-edge technologies",
                    "You’ll share your knowledge with a large community of ML Engineers across the firm and collaborate with data engineers, data scientists, solutions architects, and product owners to deliver world class solutions to deliver mentorship, training, and solutions to real world problems",
                    "Your advanced consulting skills and extensive technical expertise will guide clients as they navigate the landscape of ML algorithms, tools, and frameworks",
                    "If this position is listed as onsite, you’ll work with colleagues and clients in person, as needed for the specific role"
                ],
                "Benefits": [
                    "With professional and leadership development opportunities like upskilling programs, tuition reimbursement, mentoring, and firm-sponsored networking, you can chart a unique and fulfilling career path on your own terms",
                    "Our comprehensive benefits package includes wellness programs with HSA contributions, paid holidays, paid parental leave, a generous 401(k) match, and more",
                    "With these benefits, plus the option for flexible schedules and remote and hybrid locations, we’ll support you as you pursue a balanced, fulfilling life—at work and at home",
                    "At Booz Allen, we celebrate your contributions, provide you with opportunities and choices, and support your total well-being",
                    "Our offerings include health, life, disability, financial, and retirement benefits, as well as paid leave, professional development, tuition assistance, work-life programs, and dependent care",
                    "The projected compensation range for this position is $121,200.00 to $275,000.00 (annualized USD)"
                ]
            },
            "job_job_title": "Learning engineer",
            "job_posting_language": "en",
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        },
        {
            "employer_name": "Apple",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQTeTQbHDml539dUdx0-1eOZXqW6Zs2xwc19Cb1&s=0",
            "employer_website": "http://www.apple.com",
            "employer_company_type": "Manufacturing",
            "job_publisher": "The Muse",
            "job_id": "0YiYMANUcD8AAAAAAAAAAA==",
            "job_employment_type": "FULLTIME",
            "job_title": "Machine Learning Engineer",
            "job_apply_link": "https://www.themuse.com/jobs/apple/machine-learning-engineer-3b0cdb",
            "job_apply_is_direct": false,
            "job_apply_quality_score": 0.7157,
            "job_description": "Summary\n\nPosted: Mar 29, 2023\n\nWeekly Hours: 40\n\nRole Number:200465997\n\nImagine what you could do here. At Apple, we believe new insights have a way of becoming excellent products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The people here at Apple don't just create products - they create the kind of wonder that's revolutionized entire industries. It's the diversity of those people and their ideas that inspires the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. It takes deeply dedicated, intelligent individuals to maintain and exceed the high expectations for the iPhone brand at Apple. The Product Operations team is looking for an extraordinary engineer to join our team. You will help design and implement our machine learning strategy to the substantial iPhone supply chain and help build the future of our manufacturing systems and smarter factories. We will be collaborating and working with multi-functional teams and applying algorithms to large-scale data.\n\nKey Qualifications\n• Experience and interest of solving a real-world complex problem\n• You collaborate effectively with other teams and communicate clearly about your work\n• Experience of implementing custom deep learning models in PyTorch or Tensorflow; define careful metrics; perform error analysis and data deep dives\n• Familiar with network architectures such as convolutional networks, recurrent architectures, Transformers, etc\n• The ideal candidate should be an excellent programmer (python, C/C++) and also excel in one or more of the following areas: image processing/modeling or implementation transformer models for sequential data\n• Experience with large language model\n• Experience with manufacturing\n\nDescription\n\nOperations Advanced Analytics team is looking for creative and motivated hands-on individual contributors who thrive in a dynamic environment and enjoy working with multi-functional teams. You will work with a very talented team on applying AI and machine-learning algorithms to a wide range of problems; you would be working on large data sets of different modalities, collected by various sources - transactional, acoustic, image, video and sensor data streaming. You would work with the team to build end to end machine learning systems and modules, and deploy the models to our factories. You'll be collaborating with Software Engineers, Machine Learning Engineers, Operations, and Hardware Engineering teams across the company.\n\nEducation & Experience\n\nPhD or Master of Science degree in Computer Science or similar, alternatively a comparable industry career with a consistent track record of successful projects\n\nAdditional Requirements\n\nPay & Benefits\n• At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $115,000 and $177,000, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple's discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple's Employee Stock Purchase Plan. You'll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses - including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.",
            "job_is_remote": false,
            "job_posted_at_timestamp": 1680257990,
            "job_posted_at_datetime_utc": "2023-03-31T10:19:50.000Z",
            "job_city": "San Diego",
            "job_state": "CA",
            "job_country": "US",
            "job_latitude": 32.715736,
            "job_longitude": -117.16109,
            "job_benefits": [
                "health_insurance",
                "dental_coverage",
                "retirement_savings"
            ],
            "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=machine+learning+engineer+in+san+diego,+usa&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=machine+learning+engineer+in+san+diego,+usa&htidocid=0YiYMANUcD8AAAAAAAAAAA%3D%3D",
            "job_offer_expiration_datetime_utc": null,
            "job_offer_expiration_timestamp": null,
            "job_required_experience": {
                "no_experience_required": false,
                "required_experience_in_months": null,
                "experience_mentioned": true,
                "experience_preferred": false
            },
            "job_required_skills": null,
            "job_required_education": {
                "postgraduate_degree": false,
                "professional_certification": false,
                "high_school": false,
                "associates_degree": false,
                "bachelors_degree": false,
                "degree_mentioned": true,
                "degree_preferred": true,
                "professional_certification_mentioned": false
            },
            "job_experience_in_place_of_education": false,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_currency": null,
            "job_salary_period": null,
            "job_highlights": {
                "Qualifications": [
                    "Experience and interest of solving a real-world complex problem",
                    "You collaborate effectively with other teams and communicate clearly about your work",
                    "Experience of implementing custom deep learning models in PyTorch or Tensorflow; define careful metrics; perform error analysis and data deep dives",
                    "Familiar with network architectures such as convolutional networks, recurrent architectures, Transformers, etc",
                    "The ideal candidate should be an excellent programmer (python, C/C++) and also excel in one or more of the following areas: image processing/modeling or implementation transformer models for sequential data",
                    "Experience with large language model",
                    "Experience with manufacturing",
                    "PhD or Master of Science degree in Computer Science or similar, alternatively a comparable industry career with a consistent track record of successful projects"
                ],
                "Responsibilities": [
                    "You will help design and implement our machine learning strategy to the substantial iPhone supply chain and help build the future of our manufacturing systems and smarter factories",
                    "We will be collaborating and working with multi-functional teams and applying algorithms to large-scale data",
                    "You will work with a very talented team on applying AI and machine-learning algorithms to a wide range of problems; you would be working on large data sets of different modalities, collected by various sources - transactional, acoustic, image, video and sensor data streaming",
                    "You would work with the team to build end to end machine learning systems and modules, and deploy the models to our factories",
                    "You'll be collaborating with Software Engineers, Machine Learning Engineers, Operations, and Hardware Engineering teams across the company"
                ],
                "Benefits": [
                    "Pay & Benefits",
                    "At Apple, base pay is one part of our total compensation package and is determined within a range",
                    "The base pay range for this role is between $115,000 and $177,000, and your base pay will depend on your skills, qualifications, experience, and location",
                    "You'll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses - including tuition",
                    "Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation"
                ]
            },
            "job_job_title": "Learning engineer",
            "job_posting_language": "en",
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        }
    ]
}