{
    "status": "OK",
    "request_id": "7823843b-f5f1-4b7a-bc0c-0d3423327106",
    "parameters": {
        "query": "machine learning engineer in tempe, usa",
        "page": 1,
        "num_pages": 1
    },
    "data": [
        {
            "employer_name": "DriveTime",
            "employer_logo": "https://www.drivetime.com/assets/img/dt-logo.png",
            "employer_website": "http://www.drivetime.com",
            "employer_company_type": "Retail",
            "job_publisher": "LinkedIn",
            "job_id": "e34dg_WrvYYAAAAAAAAAAA==",
            "job_employment_type": "FULLTIME",
            "job_title": "Machine Learning Engineer",
            "job_apply_link": "https://www.linkedin.com/jobs/view/machine-learning-engineer-at-drivetime-3531158208",
            "job_apply_is_direct": false,
            "job_apply_quality_score": 0.5721,
            "job_description": "DriveTime Needs a Machine Learning Engineer I\n\nHeadquartered in Tempe, Arizona, DriveTime is the largest privately owned used car sales and finance company in the country (yes, we are THAT good)! With more than 130 dealerships, 3 operations centers and 15 reconditioning centers across the nation, our 4,000+ employees are focused on getting the right customer in the right car, at the right terms. With over 25 years of industry experience, and our dedication to streamlining the purchase process, we're redefining what it means to buy and finance a used car.\n\nAs focused as we are on our customer, we take that same focus on finding the right talent for the right opportunities within our organization. Across the nation, from our home office and operations centers to our retail locations and reconditioning centers, we are looking for talented individuals like yourself to join our ever-growing team!\n\nThat’s Nice, But What’s the Job?\n\nIn short, as a Machine Learning Engineer you will design, develop and implement analytical solutions to support multiple products, business units and verticals.\n\nIn long, the Machine Learning Engineer is responsible for:\n• Work with business partners to define objectives and build appropriate analytical solutions\n• Partner with IT-DevOps to design, develop, maintain and implement of CI/CD pipelines for delivery of analytical solutions\n• Partner with Data Scientists in the development and implementation of models\n• Make recommendations and improve ML Ops design and cloud architecture\n\nSo What Kind of Folks Are We Looking for?\n• Excellent verbal and written communication skills. The ability to talk and write with confidence, charisma and competence for a wide variety of audiences including management.\n• Organization and time management skills in spades. You’ll be handling multiple projects and deadlines that will require you to prioritize then re-prioritize… then… re-prioritize again.\n• Intellectual curiosity. Why? What? How? Do you find yourself always wanting to learn more and broaden your knowledge base? If so, this could be the role for you.\n• Agile in a fast-paced environment. We move, and we move quickly. Thriving in an environment that never stops, is a must.\n• Rebel with a cause. You are always looking beyond the obvious for continuous improvement.\n\nThe Requirements.\n• Bachelor’s Degree in Math, Statistics, Physics, Computer Science, or related discipline. Master’s degree preferred.\n• 0-2 Years of Experience Working in Machine Learning\n• 1+ Years of experience working with DevOps, MLOps or other CI/CD driven\n• Demonstrated expertise in Python, R, Julia, Scala or other analytical software\n• Demonstrated experience in developing and deploying statistical learning/machine learning techniques with significant business outcomes\n• Experience with Linux, git/version control and Build/release pipelines.\n• Experience leveraging MLOps methodology in Azure, AWS or GCP. Cloud certifications is a plus\n• Experience leading complete data science projects end-to-end\n\nAnything Else? Absolutely.\n\nDriveTime was awarded Top Companies to Work for in AZ by AZCentral.com for our great culture and one of the Best Places to Work in IT as awarded by PBJ. Essentially we offer a creative, transparent and fun environment since, well, we work here too. DriveTime was also voted the Fastest-Growing Private Companies by Inc 5000, and we aren’t slowing down anytime soon!\n\nSo What About the Perks? Perks matter.\n• Medical, Dental and Vision. DriveTime pays a nice chunk of your premiums to keep the cost as low as possible for our employees.\n• 16 days of PTO and 6 paid Holidays. Because who doesn’t love time off?\n• Benefits like 401(k), company paid life insurance, short and long-term disability.\n• Casual Dress. Come dressed in jeans (you’ll fit right in with the rest of us).\n• Game Room. Gimme a break – no, not a Kit Kat ad but we do have a ping-pong table, pool table and Virtual Reality if you ever need a break in your day.\n• Wellness Program and In-House Gym. We want our employees to be the best versions of themselves. That’s why we offer a Wellness Program that includes an in-house gym, teeth cleanings, biometric screenings and much more!\n• Growth opportunities. DriveTime takes a lot of pride in promoting from within. We have spent the last 14 years growing our team members and taking them on the path to owning their careers!\n\nAnd when it comes to hiring, we don't just look for the right person for the job, we seek out the right person for DriveTime. Buckle up for plenty of opportunities to grow in a professional, fun, and high-energy environment!",
            "job_is_remote": false,
            "job_posted_at_timestamp": 1680865125,
            "job_posted_at_datetime_utc": "2023-04-07T10:58:45.000Z",
            "job_city": "Tempe",
            "job_state": "AZ",
            "job_country": "US",
            "job_latitude": 33.42551,
            "job_longitude": -111.94,
            "job_benefits": [
                "health_insurance",
                "paid_time_off",
                "retirement_savings",
                "dental_coverage"
            ],
            "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=machine+learning+engineer+in+tempe,+usa&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=machine+learning+engineer+in+tempe,+usa&htidocid=e34dg_WrvYYAAAAAAAAAAA%3D%3D",
            "job_offer_expiration_datetime_utc": "2023-05-22T00:31:28.000Z",
            "job_offer_expiration_timestamp": 1684715488,
            "job_required_experience": {
                "no_experience_required": false,
                "required_experience_in_months": 300,
                "experience_mentioned": true,
                "experience_preferred": true
            },
            "job_required_skills": null,
            "job_required_education": {
                "postgraduate_degree": false,
                "professional_certification": false,
                "high_school": false,
                "associates_degree": false,
                "bachelors_degree": true,
                "degree_mentioned": true,
                "degree_preferred": true,
                "professional_certification_mentioned": true
            },
            "job_experience_in_place_of_education": false,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_currency": null,
            "job_salary_period": null,
            "job_highlights": {
                "Qualifications": [
                    "Excellent verbal and written communication skills",
                    "The ability to talk and write with confidence, charisma and competence for a wide variety of audiences including management",
                    "Organization and time management skills in spades",
                    "Intellectual curiosity",
                    "Agile in a fast-paced environment",
                    "Thriving in an environment that never stops, is a must",
                    "Bachelor’s Degree in Math, Statistics, Physics, Computer Science, or related discipline",
                    "Experience leading complete data science projects end-to-end"
                ],
                "Responsibilities": [
                    "In short, as a Machine Learning Engineer you will design, develop and implement analytical solutions to support multiple products, business units and verticals",
                    "Work with business partners to define objectives and build appropriate analytical solutions",
                    "Partner with IT-DevOps to design, develop, maintain and implement of CI/CD pipelines for delivery of analytical solutions",
                    "Partner with Data Scientists in the development and implementation of models",
                    "Make recommendations and improve ML Ops design and cloud architecture"
                ],
                "Benefits": [
                    "Perks matter",
                    "Medical, Dental and Vision",
                    "DriveTime pays a nice chunk of your premiums to keep the cost as low as possible for our employees",
                    "16 days of PTO and 6 paid Holidays",
                    "Benefits like 401(k), company paid life insurance, short and long-term disability",
                    "Casual Dress",
                    "Growth opportunities"
                ]
            },
            "job_job_title": "Learning engineer",
            "job_posting_language": "en",
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        },
        {
            "employer_name": "Recruiting from Scratch",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRLtIXPHOasXtT9oT9TUd5MyG8XvOJk5P1sc3n4&s=0",
            "employer_website": null,
            "employer_company_type": null,
            "job_publisher": "LinkedIn",
            "job_id": "JChA6wspiI8AAAAAAAAAAA==",
            "job_employment_type": "FULLTIME",
            "job_title": "Senior Machine Learning Engineer",
            "job_apply_link": "https://www.linkedin.com/jobs/view/senior-machine-learning-engineer-at-recruiting-from-scratch-3538579796",
            "job_apply_is_direct": false,
            "job_apply_quality_score": 0.5689,
            "job_description": "About Our Client\n\nWe are the global leader in e-commerce technology, helping companies seize the full potential of every transaction moment to grow revenue and acquire new customers at scale. Live Nation, Groupon, Staples, Lands’ End, Fanatics, UrbanStems, GoDaddy, Vistaprint and HelloFresh are among the more than 2,500 leading global businesses and advertisers that are using our solutions to drive more value through every transaction by offering highly relevant messages to their customers at the moment they are most likely to convert.\n\nWith our December 2021 Series E raise of USD$325M, we're is expanding rapidly and globally – operating in 19 countries across North America, Europe and the Asia-Pacific region with the largest office in NYC and a major R&D hub in Sydney. With annual revenues of more than US$200M and vibrant company culture, we have been listed in ‘Great Places to Work’ in the US and Australia. Our award-winning culture is guided by our five core values: Smart with Humility, Own the Outcomes, Force for Good, Conquer New Frontiers, and Enjoy the Ride. These values help us attract, engage, and develop the right talent around the globe and ensure we have the right conditions to do our best work. Keen to join a fast-growing company and a vibrant culture?\n\nOur engineering team builds best-in-class e-commerce technology that provides personalized and relevant experiences for customers globally and empowers marketers with sophisticated, AI-driven tooling to better understand consumers. Our bespoke platform handles millions of transactions per day and considers billions of data points which give engineers the opportunity to build technology at scale, collaborate across teams and gain exposure to a wide range of technology. We are expanding rapidly in our major R&D centers in NYC and Sydney. We are passionate about using intelligent systems to improve the transaction moment for retailers everywhere. Come join us and build the future!\n\nThe Role\n\nAs a Senior Machine Learning Engineer, you are someone who has significant expertise in both machine learning and software engineering. You will be working with our engineering and product teams to design, build and productionize proprietary machine learning models to solve different business challenges including smart bidding, lookalike modelling, forecasting, and etc.\n\nResponsibilities\n• Collaborate closely with product managers and other engineers to understand business priorities, frame machine learning problems, architect machine learning solutions.\n• Build and productionize machine learning models including data preparation/processing pipelines, machine learning orchestrations, improvements of services performance and reliability and etc.\n• Contribute and maintain the high quality of code base with tests that provide a high level of functional coverage as well as non-functional aspects with load testing, unit testing, integration testing, etc.\n• Keep track of emerging tech and trends, research the state-of-art deep learning models, prototype new modelling ideas, and conduct offline and online experiments.\n• Share your knowledge by giving brown bags, tech talks, and evangelizing appropriate tech and engineering best practices.\n• Mentor other team members, facilitate within/across team workshops and lead the agile development.\n\nRequirements\n• Bachelor’s degree in Computer Science, a similar technical field of study or equivalent practical experience.\n• 3+ years of industry experience in building production-grade machine learning systems with all aspects of model training, tuning, deploying, serving and monitoring.\n• 5+ years of industry experience in software engineering roles and development experience in Python, SQL, Go, and/or other programming languages.\n• Strong understanding in software engineering, system design, data engineering and/or cloud architecture.\n• Knowledge in at least one of following areas - Bayesian methods, Econometrics, Reinforcement learning, Gradient boosting machine, Natural language processing, Computer vision, etc.\n• Be motivated, self-driven in a fast (we truly mean fast) paced environment with a proven track record demonstrating impact across several teams and/or organizations.\n• Ability to communicate and collaborate effectively with business stakeholders and manage tasks in a timely manner.\n• Our client encourages autonomy; teams have complete ownership of their systems including building, running and monitoring. As such, you may be required to be on-call and respond to systems alerts should they arise.\n• Ideas, opinions, and the ability to share them through respectful proposals, presentations, and team-wide discussions, An eagerness to work and learn in the open and share your learnings with your teammates.\n• Experience in DevOps, MLOps and SRE is a massive plus.\n• Experience of Kubernetes, Kubeflow, TFX and Feature Store in a production environment is a massive plus.\n\nBenefits\n• Force for Good.\n• We actively invest in the growth of our people and the strengthening of our communities. Our NYC office is 100% vaccinated to keep our employees and community safe and healthy. We require all stars as well as anyone else who will be onsite at our NYC office – clients, contractors, vendors, and suppliers – to show proof of vaccination and their booster shot.\n• Work with the greatest talent in town.\n• Our recruiting process is tough. We hold a high bar because we have a high-performing, high-velocity culture - we only want the brightest and the best.\n• Join a community.\n• We believe the best things happen when we come together to solve complex problems and make meaningful connections with each other through interest groups, sports clubs, and social events.\n• Accelerate your career.\n• Develop through our global training events, ‘Level Up’ investment, online training courses, and our fantastic people leaders. Take your career to race car speed - Grow your career in our rapidly growing company.\n• Take a break.\n• When you work hard, we know you also need to rest. We offer generous time off and parental leave policies, as well as mental health and wellness days for all employees. We also offer a paid Sabbatical for employees who have been with us for 3 years or more.\n• Stay happy and healthy.\n• Enjoy catered lunch 3 times a week and healthy snacks in the office. Plus join the gym on us! In the US, access generous retirement plans like a 4% dollar-for-dollar 401K matching plan and get fully funded premium health insurance for your whole family. And our NYC office is dog-friendly!\n• Become a shareholder.\n• All employees have stock options. If we succeed, everyone enjoys the upside.\n• See the world!\n• Along with our global all-staff events in amazing locations (Phuket, Thailand in January 2020, Hawaii in May 2022), we also offer generous relocation packages for those interested in moving to another office. We have cool offices in great cities - New York, Sydney, London, Singapore, Tokyo.\n• Get the best of both worlds with a hybrid workplace.\n• We currently work 3 days a week in office, allowing you to enjoy the best of both worlds (please note: this is subject to change based on the needs of the business and some support roles still require a full time presence). One week per quarter, you also have the flexibility to work from anywhere.\n• We believe in equality.\n• We are an Equal Opportunity Employer and recognizes that a diverse workforce is crucial to our success as a business. We would love you to apply for one of our open roles - irrespective of socio-economic status or background, age, gender identity, race, religion, sexual orientation, color, pregnancy, carer/family responsibilities, national and social origin, political opinion, marital, veteran, or disability status.\n\nSalary range: $200,000 - $300,000 / year\n\nLocation: Hybrid 3 days, of your choice, a week in office at the intersection of SoHo and TriBeCa within walking distance of the bike path and outdoor fields on the Hudson River. You’ll be tempted to skip the catered lunches to try out all of the delicious local eateries in the area.\n\nWho is Recruiting from Scratch:\n\nRecruiting from Scratch is a premier talent firm that focuses on placing the best product managers, software, and hardware talent at innovative companies. Our team is 100% remote and we work with teams across the United States to help them hire. We work with companies funded by the best investors including Sequoia Capital, Lightspeed Ventures, Tiger Global Management, A16Z, Accel, DFJ, and more.",
            "job_is_remote": false,
            "job_posted_at_timestamp": 1677746225,
            "job_posted_at_datetime_utc": "2023-03-02T08:37:05.000Z",
            "job_city": "Tempe",
            "job_state": "AZ",
            "job_country": "US",
            "job_latitude": 33.42551,
            "job_longitude": -111.94,
            "job_benefits": [
                "paid_time_off",
                "retirement_savings",
                "health_insurance"
            ],
            "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=machine+learning+engineer+in+tempe,+usa&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=machine+learning+engineer+in+tempe,+usa&htidocid=JChA6wspiI8AAAAAAAAAAA%3D%3D",
            "job_offer_expiration_datetime_utc": "2023-04-26T08:37:05.000Z",
            "job_offer_expiration_timestamp": 1682498225,
            "job_required_experience": {
                "no_experience_required": false,
                "required_experience_in_months": 36,
                "experience_mentioned": true,
                "experience_preferred": true
            },
            "job_required_skills": null,
            "job_required_education": {
                "postgraduate_degree": false,
                "professional_certification": false,
                "high_school": false,
                "associates_degree": false,
                "bachelors_degree": true,
                "degree_mentioned": true,
                "degree_preferred": true,
                "professional_certification_mentioned": false
            },
            "job_experience_in_place_of_education": false,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_currency": null,
            "job_salary_period": null,
            "job_highlights": {
                "Qualifications": [
                    "Bachelor’s degree in Computer Science, a similar technical field of study or equivalent practical experience",
                    "3+ years of industry experience in building production-grade machine learning systems with all aspects of model training, tuning, deploying, serving and monitoring",
                    "5+ years of industry experience in software engineering roles and development experience in Python, SQL, Go, and/or other programming languages",
                    "Strong understanding in software engineering, system design, data engineering and/or cloud architecture",
                    "Knowledge in at least one of following areas - Bayesian methods, Econometrics, Reinforcement learning, Gradient boosting machine, Natural language processing, Computer vision, etc",
                    "Be motivated, self-driven in a fast (we truly mean fast) paced environment with a proven track record demonstrating impact across several teams and/or organizations",
                    "Ability to communicate and collaborate effectively with business stakeholders and manage tasks in a timely manner",
                    "Ideas, opinions, and the ability to share them through respectful proposals, presentations, and team-wide discussions, An eagerness to work and learn in the open and share your learnings with your teammates",
                    "Experience in DevOps, MLOps and SRE is a massive plus",
                    "Experience of Kubernetes, Kubeflow, TFX and Feature Store in a production environment is a massive plus"
                ],
                "Responsibilities": [
                    "You will be working with our engineering and product teams to design, build and productionize proprietary machine learning models to solve different business challenges including smart bidding, lookalike modelling, forecasting, and etc",
                    "Collaborate closely with product managers and other engineers to understand business priorities, frame machine learning problems, architect machine learning solutions",
                    "Build and productionize machine learning models including data preparation/processing pipelines, machine learning orchestrations, improvements of services performance and reliability and etc",
                    "Contribute and maintain the high quality of code base with tests that provide a high level of functional coverage as well as non-functional aspects with load testing, unit testing, integration testing, etc",
                    "Keep track of emerging tech and trends, research the state-of-art deep learning models, prototype new modelling ideas, and conduct offline and online experiments",
                    "Share your knowledge by giving brown bags, tech talks, and evangelizing appropriate tech and engineering best practices",
                    "Mentor other team members, facilitate within/across team workshops and lead the agile development",
                    "Our client encourages autonomy; teams have complete ownership of their systems including building, running and monitoring",
                    "As such, you may be required to be on-call and respond to systems alerts should they arise"
                ],
                "Benefits": [
                    "Force for Good",
                    "We actively invest in the growth of our people and the strengthening of our communities",
                    "Accelerate your career",
                    "Develop through our global training events, ‘Level Up’ investment, online training courses, and our fantastic people leaders",
                    "Take a break",
                    "When you work hard, we know you also need to rest",
                    "We offer generous time off and parental leave policies, as well as mental health and wellness days for all employees",
                    "We also offer a paid Sabbatical for employees who have been with us for 3 years or more",
                    "Stay happy and healthy",
                    "Enjoy catered lunch 3 times a week and healthy snacks in the office",
                    "In the US, access generous retirement plans like a 4% dollar-for-dollar 401K matching plan and get fully funded premium health insurance for your whole family",
                    "All employees have stock options",
                    "We currently work 3 days a week in office, allowing you to enjoy the best of both worlds (please note: this is subject to change based on the needs of the business and some support roles still require a full time presence)",
                    "One week per quarter, you also have the flexibility to work from anywhere",
                    "Salary range: $200,000 - $300,000 / year",
                    "Location: Hybrid 3 days, of your choice, a week in office at the intersection of SoHo and TriBeCa within walking distance of the bike path and outdoor fields on the Hudson River"
                ]
            },
            "job_job_title": "Learning engineer",
            "job_posting_language": "en",
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        },
        {
            "employer_name": "Recruiting from Scratch",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRLtIXPHOasXtT9oT9TUd5MyG8XvOJk5P1sc3n4&s=0",
            "employer_website": null,
            "employer_company_type": null,
            "job_publisher": "LinkedIn",
            "job_id": "kzTEcb2ZSoQAAAAAAAAAAA==",
            "job_employment_type": "FULLTIME",
            "job_title": "Senior Machine Learning Engineer",
            "job_apply_link": "https://www.linkedin.com/jobs/view/senior-machine-learning-engineer-at-recruiting-from-scratch-3433853819",
            "job_apply_is_direct": false,
            "job_apply_quality_score": 0.5689,
            "job_description": "Who is Recruiting from Scratch:\n\nRecruiting from Scratch is a premier talent firm that focuses on placing the best product managers, software, and hardware talent at innovative companies. Our team is 100% remote and we work with teams across the United States to help them hire. We work with companies funded by the best investors including Sequoia Capital, Lightspeed Ventures, Tiger Global Management, A16Z, Accel, DFJ, and more.\n\nSr. Machine Learning Engineer\n\nNYC-hybrid or 100% Remote (US)\n\nWe believe everyone has a story to tell. Our mission is to make professional video and content creation accessible to all. We are taking recent advancements in computer graphics, the web, and machine learning to push the boundaries of creativity and in turn, lower the barriers of content creation; unfastening a new wave of storytelling   \n\nOver the last three years, we’ve raised funding from top-tier investors including Coatue, Lux, and Amplify, all with a team small enough to fit at one (growing) table. Our team consists of creative, open minded, caring and entrepreneurial individuals from all walks of life. We aspire to build incredible things which starts with building an incredible team, so we’d love to hear from you!   \n\nAbout The Role   \n\nWe’re building a next-generation creative tool that enables a new level of interactivity with cloud-based machine learning models. For our tool to be maximally expressive, we’re working to establish a seamless feedback loop between our users and the machine learning models powering our abilities. It’s not sufficient for our models to be accurate; nor is it enough for our user interface to be beautiful and responsive; we need to ensure that the link between the two is as fast and reliable as possible.\n\nFor this reason, we’re looking for a Machine Learning Engineer who can help us create the server-side engine that powers our interactive tools for image and video synthesis. You’ll be working closely with our research and frontend teams to design and build low-latency, high-reliability machine learning deployments. We’re looking for someone who is deeply interested in the intersection of machine learning and systems design, and has extensive experience building web-based real-time server applications.\n\nA peek at our technical stack   \n\nThe rich UI of our video editing and collaboration tools is powered by Typescript and React/Redux, while the real time compositing and graphics engine behind our interactive preview runs on WebGL2 and WebAssembly. Our video streaming backend components are written in Python, use a lot of FFmpeg/libav and HLS for on-the-fly transcoding, PyTorch and TorchScript for ML inference, and are deployed as containerized services on Kubernetes. Our API endpoints for real-time collaboration and media asset management are written in Typescript and node.js and are deployed as serverless functions on AWS Lambda.\n\nWhat You’ll Do   \n• Work with a world-class engineering team pushing the boundaries of content creation on the browser\n• Collaborate with our research team to deploy state-of-the-art computer vision models to production\n• Improve the performance and efficiency of our machine learning deployments\n\nWhat You’ll Need   \n• Solid knowledge of at least one machine learning research framework (e.g. PyTorch, Tensorflow), and at least one high-performance inference framework (e.g. TensorRT, Apache TVM)\n• Experience profiling and optimizing deep neural networks, including knowledge of GPU profiling tools such as NVIDIA Nsight\n• Familiarity with Python-based image and video manipulation/encoding/decoding frameworks, such as OpenCV and PyAV\n• Experience with cloud orchestration systems such as Kubernetes and cloud providers such as AWS, GCP, and Azure\n• Ability to write robust and maintainable client-server architectures and APIs\n• Ability to rapidly prototype solutions and iterate on them with tight product deadlines\n• Strong communication, collaboration, and documentation skills\n\nWe strives to recruit and retain exceptional talent from diverse backgrounds while ensuring pay equity for our team. Our salary ranges are based on competitive market rates for our size, stage and industry, and salary is just one part of the overall compensation package we provide.\n\nThere are many factors that go into salary determinations, including relevant experience, skill level and qualifications assessed during the interview process, and maintaining internal equity with peers on the team. The range shared below is a general expectation for the function as posted, but we are also open to considering candidates who may be more or less experienced than outlined in the job description. In this case, we will communicate any updates in the expected salary range.\n\nLastly, the provided range is the expected salary for candidates in the U.S. Outside of those regions, there may be a change in the range, which again, will be communicated to candidates.\n\nWorking Here   \n\nWe are a small and growing team of artists, engineers, researchers, and dreamers working together to reimagine creativity. And we’re building a unique team of talented individuals from diverse backgrounds. We believe that this will allow us to continue to up-level each other, our company, and our product. We’re looking for people that will add to our culture, not just fit in.\n\nWe’re committed to creating a space where our employees can bring their full selves to work and have equal opportunity to succeed. So regardless of race, gender identity or expression, sexual orientation, religion, origin, ability, age, veteran status, if joining this mission speaks to you, we encourage you to apply!\n\nSalary: $165-210k base",
            "job_is_remote": false,
            "job_posted_at_timestamp": 1673663808,
            "job_posted_at_datetime_utc": "2023-01-14T02:36:48.000Z",
            "job_city": "Tempe",
            "job_state": "AZ",
            "job_country": "US",
            "job_latitude": 33.42551,
            "job_longitude": -111.94,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=machine+learning+engineer+in+tempe,+usa&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=machine+learning+engineer+in+tempe,+usa&htidocid=kzTEcb2ZSoQAAAAAAAAAAA%3D%3D",
            "job_offer_expiration_datetime_utc": "2023-05-05T17:25:43.000Z",
            "job_offer_expiration_timestamp": 1683307543,
            "job_required_experience": {
                "no_experience_required": false,
                "required_experience_in_months": null,
                "experience_mentioned": true,
                "experience_preferred": false
            },
            "job_required_skills": null,
            "job_required_education": {
                "postgraduate_degree": false,
                "professional_certification": false,
                "high_school": false,
                "associates_degree": false,
                "bachelors_degree": true,
                "degree_mentioned": true,
                "degree_preferred": false,
                "professional_certification_mentioned": false
            },
            "job_experience_in_place_of_education": false,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_currency": null,
            "job_salary_period": null,
            "job_highlights": {
                "Qualifications": [
                    "We’re looking for someone who is deeply interested in the intersection of machine learning and systems design, and has extensive experience building web-based real-time server applications",
                    "Solid knowledge of at least one machine learning research framework (e.g. PyTorch, Tensorflow), and at least one high-performance inference framework (e.g",
                    "Experience profiling and optimizing deep neural networks, including knowledge of GPU profiling tools such as NVIDIA Nsight",
                    "Familiarity with Python-based image and video manipulation/encoding/decoding frameworks, such as OpenCV and PyAV",
                    "Experience with cloud orchestration systems such as Kubernetes and cloud providers such as AWS, GCP, and Azure",
                    "Ability to write robust and maintainable client-server architectures and APIs",
                    "Ability to rapidly prototype solutions and iterate on them with tight product deadlines"
                ],
                "Responsibilities": [
                    "You’ll be working closely with our research and frontend teams to design and build low-latency, high-reliability machine learning deployments",
                    "Work with a world-class engineering team pushing the boundaries of content creation on the browser",
                    "Collaborate with our research team to deploy state-of-the-art computer vision models to production",
                    "Improve the performance and efficiency of our machine learning deployments"
                ],
                "Benefits": [
                    "Our salary ranges are based on competitive market rates for our size, stage and industry, and salary is just one part of the overall compensation package we provide",
                    "Salary: $165-210k base"
                ]
            },
            "job_job_title": "Learning engineer",
            "job_posting_language": "en",
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        },
        {
            "employer_name": "Viasat, Inc.",
            "employer_logo": "https://www.viasat.com/content/dam/viasat/us/en/int_vsat_TM_rgb_grd_72x24.svg",
            "employer_website": "http://www.viasat.com",
            "employer_company_type": "Information",
            "job_publisher": "Karkidi",
            "job_id": "D-7lZYEbv0AAAAAAAAAAAA==",
            "job_employment_type": "FULLTIME",
            "job_title": "Machine Learning Engineer Intern",
            "job_apply_link": "https://www.karkidi.com/job-details/36209-machine-learning-engineer-intern-job",
            "job_apply_is_direct": false,
            "job_apply_quality_score": 0.5326,
            "job_description": "As a Machine Learning Engineer Intern, you will be part of a diverse team of engineers developing next-generation, vertically integrated products and services at Viasat. You will develop novel algorithms and techniques for analyzing complex data sets collected during Viasat’s product and service lifecycles. You will help define and develop models that produce new inferences and enable action by adjacent teams. You will work with software engineers to create new tools, libraries, and services that can expand Viasat’s ability to understand these complex data sets. You will be part of a growing team developing cloud-based solutions for tackling problems found at the cutting edge of technological development and manufacturing.\n\nOn this team, you will build a breadth of knowledge including distributed systems, predictive analytics, and machine learning. You will design, develop, and deploy analytic pipelines to answer questions across multiple business areas and disciplines for Viasat’s broad but vertically integrated products. We encourage learning through curiosity, immersion, collaboration, and action. We value adaptability and learning agility. Our ideal candidate is someone focused on solving tough problems using data and who loves doing so.\n\nAs a Machine Learning Engineer Intern, you will contribute with:\n• Analytics: Architect, design, and build data analysis pipelines working with large and complex data sets to monitor and analyze metrics\n• Inference: Use statistical tools to design experiments and determine causality\n• Algorithms: Design and create predictive and decision-making machine learning models for various business needs\n• Data engineering: Transforming and understanding data from many systems\n\nRequirements\n• Currently pursuing a Bachelor's degree or higher in Data Science, Applied Mathematics, Computer Science, Computer Engineering, Physics, or related field\n• Experience with several statistical and machine learning models\n• Experience with software development in Python\n• Able to commit to a 10-12 week summer internship\n\nPreferences\n• Pursuing a MS/PhD in a data-related field such as applied mathematics, computer science, computer engineering, physics, or similar\n• Knowledge of RF engineering, RF electronics, integrated circuits, electronics manufacturing, or digital communication systems\n• Interest in or desire to work on anomaly detection, broadly defined\n• Knowledge of or Interest in learning Bayesian approaches\n\nAdditional Requirements and Information\n\nMinimum Education: High School Diploma or GED\n\nYears of Experience: 0-2 years\n\nTravel: None\n\nCitizenship: US Citizenship required\n\nWorker Classification: Intern",
            "job_is_remote": false,
            "job_posted_at_timestamp": 1674691200,
            "job_posted_at_datetime_utc": "2023-01-26T00:00:00.000Z",
            "job_city": "Tempe",
            "job_state": "AZ",
            "job_country": "US",
            "job_latitude": 33.42551,
            "job_longitude": -111.94,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=machine+learning+engineer+in+tempe,+usa&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=machine+learning+engineer+in+tempe,+usa&htidocid=D-7lZYEbv0AAAAAAAAAAAA%3D%3D",
            "job_offer_expiration_datetime_utc": null,
            "job_offer_expiration_timestamp": null,
            "job_required_experience": {
                "no_experience_required": false,
                "required_experience_in_months": null,
                "experience_mentioned": true,
                "experience_preferred": false
            },
            "job_required_skills": [
                "Python Programming"
            ],
            "job_required_education": {
                "postgraduate_degree": false,
                "professional_certification": false,
                "high_school": false,
                "associates_degree": false,
                "bachelors_degree": false,
                "degree_mentioned": true,
                "degree_preferred": false,
                "professional_certification_mentioned": false
            },
            "job_experience_in_place_of_education": false,
            "job_min_salary": 94130,
            "job_max_salary": 127130,
            "job_salary_currency": "USD",
            "job_salary_period": "YEAR",
            "job_highlights": {
                "Qualifications": [
                    "Our ideal candidate is someone focused on solving tough problems using data and who loves doing so",
                    "Currently pursuing a Bachelor's degree or higher in Data Science, Applied Mathematics, Computer Science, Computer Engineering, Physics, or related field",
                    "Experience with several statistical and machine learning models",
                    "Experience with software development in Python",
                    "Able to commit to a 10-12 week summer internship",
                    "Pursuing a MS/PhD in a data-related field such as applied mathematics, computer science, computer engineering, physics, or similar",
                    "Knowledge of RF engineering, RF electronics, integrated circuits, electronics manufacturing, or digital communication systems",
                    "Interest in or desire to work on anomaly detection, broadly defined",
                    "Knowledge of or Interest in learning Bayesian approaches",
                    "Minimum Education: High School Diploma or GED",
                    "Years of Experience: 0-2 years",
                    "Citizenship: US Citizenship required"
                ],
                "Responsibilities": [
                    "You will develop novel algorithms and techniques for analyzing complex data sets collected during Viasat’s product and service lifecycles",
                    "You will help define and develop models that produce new inferences and enable action by adjacent teams",
                    "You will work with software engineers to create new tools, libraries, and services that can expand Viasat’s ability to understand these complex data sets",
                    "You will be part of a growing team developing cloud-based solutions for tackling problems found at the cutting edge of technological development and manufacturing",
                    "On this team, you will build a breadth of knowledge including distributed systems, predictive analytics, and machine learning",
                    "You will design, develop, and deploy analytic pipelines to answer questions across multiple business areas and disciplines for Viasat’s broad but vertically integrated products",
                    "Analytics: Architect, design, and build data analysis pipelines working with large and complex data sets to monitor and analyze metrics",
                    "Inference: Use statistical tools to design experiments and determine causality",
                    "Algorithms: Design and create predictive and decision-making machine learning models for various business needs",
                    "Data engineering: Transforming and understanding data from many systems"
                ]
            },
            "job_job_title": "Learning engineer",
            "job_posting_language": "en",
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        },
        {
            "employer_name": "Recruiting from Scratch",
            "employer_logo": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRLtIXPHOasXtT9oT9TUd5MyG8XvOJk5P1sc3n4&s=0",
            "employer_website": null,
            "employer_company_type": null,
            "job_publisher": "LinkedIn",
            "job_id": "6C141PzuGW8AAAAAAAAAAA==",
            "job_employment_type": "FULLTIME",
            "job_title": "Senior Machine Learning Engineer, TV Startup",
            "job_apply_link": "https://www.linkedin.com/jobs/view/senior-machine-learning-engineer-tv-startup-at-recruiting-from-scratch-3534433586",
            "job_apply_is_direct": false,
            "job_apply_quality_score": 0.5689,
            "job_description": "Who is Recruiting from Scratch:\n\nRecruiting from Scratch is a premier talent firm that focuses on placing the best product managers, software, and hardware talent at innovative companies. Our team is 100% remote and we work with teams across the United States to help them hire. We work with companies funded by the best investors including Sequoia Capital, Lightspeed Ventures, Tiger Global Management, A16Z, Accel, DFJ, and more.\n\nAbout Our Client\n\nOur client is the leading local & world news service on Connected TVs reaching millions of users! This is a unique opportunity to work at our client, one of the fastest-growing TV startups in the world. They are already preloaded on 37% of all TVs shipped in the US!\n\nBe part of a Silicon Valley startup and work directly with the founding team. Jumpstart your career by working with Stanford & Carnegie Mellon alumni and faculty who have already been part of other successful startups in Silicon Valley.\n\nThe Job:\n\nWe are looking for an outstanding machine learning engineer to join our client and help improve the experience of millions of users that rely on them to get the news every day. Within the team you’ll find many opportunities to work on various aspects of Machine Learning and Data Engineering. The job offers the opportunity of generating a major impact on the product while working with an awesome and talented team, using the latest technologies.\n\nYou will:\n• Analyze large data sets to get insights using statistical analysis tools and techniques\n• Build, evaluate and deploy machine learning models\n• Maintain ongoing reliability, performance, and support of the data infrastructure, providing solutions based on application needs and anticipated growth.\n• Work with tools to configure, monitor and orchestrate data infrastructure and pipelines.\n• Run and monitor AB Tests\n• Build and manage APIs\n\nQualifications And Requirements\n• CS, EE or related degree with at least 5+ years of professional experience working on supervised ML projects\n• At least 3 years experience doing ML Personalization for consumer service with millions of users\n• Proficient in Python and experience with ML libraries such as sklearn and xgboost\n• Experience with SQL (e.g. postgres, snowflake)\n• Experience doing data analysis, data cleanup, modeling, training, deploying and monitoring ML models in prod\n• Show rapid career growth (e.g. from junior to senior to lead eng)\n• Understanding of the NEWS personalization space is a BIG Plus.\n\nThe budgeted range is $150,000 to $180,000",
            "job_is_remote": false,
            "job_posted_at_timestamp": 1679603822,
            "job_posted_at_datetime_utc": "2023-03-23T20:37:02.000Z",
            "job_city": "Tempe",
            "job_state": "AZ",
            "job_country": "US",
            "job_latitude": 33.42551,
            "job_longitude": -111.94,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=machine+learning+engineer+in+tempe,+usa&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=machine+learning+engineer+in+tempe,+usa&htidocid=6C141PzuGW8AAAAAAAAAAA%3D%3D",
            "job_offer_expiration_datetime_utc": "2023-05-19T20:37:48.000Z",
            "job_offer_expiration_timestamp": 1684528668,
            "job_required_experience": {
                "no_experience_required": false,
                "required_experience_in_months": 60,
                "experience_mentioned": true,
                "experience_preferred": false
            },
            "job_required_skills": null,
            "job_required_education": {
                "postgraduate_degree": false,
                "professional_certification": false,
                "high_school": false,
                "associates_degree": false,
                "bachelors_degree": true,
                "degree_mentioned": true,
                "degree_preferred": false,
                "professional_certification_mentioned": false
            },
            "job_experience_in_place_of_education": false,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_currency": null,
            "job_salary_period": null,
            "job_highlights": {
                "Qualifications": [
                    "CS, EE or related degree with at least 5+ years of professional experience working on supervised ML projects",
                    "At least 3 years experience doing ML Personalization for consumer service with millions of users",
                    "Proficient in Python and experience with ML libraries such as sklearn and xgboost",
                    "Experience with SQL (e.g. postgres, snowflake)",
                    "Experience doing data analysis, data cleanup, modeling, training, deploying and monitoring ML models in prod",
                    "Show rapid career growth (e.g. from junior to senior to lead eng)",
                    "Understanding of the NEWS personalization space is a BIG Plus"
                ],
                "Responsibilities": [
                    "Analyze large data sets to get insights using statistical analysis tools and techniques",
                    "Build, evaluate and deploy machine learning models",
                    "Maintain ongoing reliability, performance, and support of the data infrastructure, providing solutions based on application needs and anticipated growth",
                    "Work with tools to configure, monitor and orchestrate data infrastructure and pipelines",
                    "Run and monitor AB Tests",
                    "Build and manage APIs"
                ],
                "Benefits": [
                    "The budgeted range is $150,000 to $180,000"
                ]
            },
            "job_job_title": "Learning engineer",
            "job_posting_language": "en",
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        },
        {
            "employer_name": "Kubota",
            "employer_logo": "https://www.kubota.com/newsroom/common/images/img_pickup_highlightTopics.jpg",
            "employer_website": "http://www.kubota.co.jp",
            "employer_company_type": "Manufacturing",
            "job_publisher": "Dayforcehcm.com",
            "job_id": "j-t_aUZ-6AcAAAAAAAAAAA==",
            "job_employment_type": "FULLTIME",
            "job_title": "Software Engineer (Artificial Intelligence & Machine Learning)",
            "job_apply_link": "https://us63.dayforcehcm.com/CandidatePortal/en-US/kubota/Posting/View/4623",
            "job_apply_is_direct": false,
            "job_apply_quality_score": 0.8304,
            "job_description": "BASIC PURPOSE AND SCOPE OF POSITIONDesign, develop, and maintain industrial-grade applications for automation application systems within off-highway machinery. Responsible for performing software design and development tasks on components embedded in hardware devices. PRINCIPAL ACTIVITIES:Work with a cross-functional team to design, test, and develop software components written in C, C++ on a proprietary hardware platform running a scheduler, real-time operating system, Linux, Windows, or ROS/ROS2. Design, develop, test and document quality software to user and functional requirements within specified timeframes and in accordance with the Company’s coding standards. Design and implement complex embedded and desktop software on a variety of hardware platforms. Ability to bring up and debug new hardware platforms. Program in C, C++, assembly for both desktop and embedded targets. Generate rapid prototypes for feasibility testing. Work with engineering testing and production teams for software validation/verification. Generate all documentation relevant to software operation. Perform tasks as specified by the Software Development Team Lead(s). Adhere to the Quality Management System (QMS) ISO9001:2008. Contribute to the improvement of development systems and processes to ensure efficient and effective work procedures are maintained and/or improved. Communicate effectively with customers on technical or sensitive issues. Provide on-site customer support when required (only on very sensitive or urgent issues). MINIMUM QUALIFICATIONS:Bachelors in Computer Engineering, Computer Science, Robotics or a related field required. 5 years professional software development experience required. Minimum 3 years professional C++ and C experience including fluency with OOA/OOD/OOP methodologies required. Minimum five years microprocessor project experience, ARM preferred, using embedded Linux, ROS/ROS2, and RT OS platforms required. Experience with relational and NoSQL databases preferred. Experience in Model-based System Design in MATLAB/Simulink environment preferred. Fluency in Linux development environments preferred. Experience performing vehicle dynamics simulations preferred. Experience using simulation models to validate vehicle controls and functional safety preferred. Knowledge of GIS and mapping integration is preferred. Experience with computer vision and/or video processing is preferred.",
            "job_is_remote": false,
            "job_posted_at_timestamp": 1678752000,
            "job_posted_at_datetime_utc": "2023-03-14T00:00:00.000Z",
            "job_city": "Scottsdale",
            "job_state": "AZ",
            "job_country": "US",
            "job_latitude": 33.49417,
            "job_longitude": -111.92605,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=machine+learning+engineer+in+tempe,+usa&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=machine+learning+engineer+in+tempe,+usa&htidocid=j-t_aUZ-6AcAAAAAAAAAAA%3D%3D",
            "job_offer_expiration_datetime_utc": null,
            "job_offer_expiration_timestamp": null,
            "job_required_experience": {
                "no_experience_required": false,
                "required_experience_in_months": 60,
                "experience_mentioned": true,
                "experience_preferred": true
            },
            "job_required_skills": null,
            "job_required_education": {
                "postgraduate_degree": false,
                "professional_certification": false,
                "high_school": false,
                "associates_degree": false,
                "bachelors_degree": false,
                "degree_mentioned": false,
                "degree_preferred": false,
                "professional_certification_mentioned": false
            },
            "job_experience_in_place_of_education": false,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_currency": null,
            "job_salary_period": null,
            "job_highlights": {
                "Qualifications": [
                    "Program in C, C++, assembly for both desktop and embedded targets",
                    "MINIMUM QUALIFICATIONS:Bachelors in Computer Engineering, Computer Science, Robotics or a related field required",
                    "5 years professional software development experience required",
                    "Minimum 3 years professional C++ and C experience including fluency with OOA/OOD/OOP methodologies required"
                ],
                "Responsibilities": [
                    "BASIC PURPOSE AND SCOPE OF POSITIONDesign, develop, and maintain industrial-grade applications for automation application systems within off-highway machinery",
                    "Responsible for performing software design and development tasks on components embedded in hardware devices",
                    "PRINCIPAL ACTIVITIES:Work with a cross-functional team to design, test, and develop software components written in C, C++ on a proprietary hardware platform running a scheduler, real-time operating system, Linux, Windows, or ROS/ROS2",
                    "Design, develop, test and document quality software to user and functional requirements within specified timeframes and in accordance with the Company’s coding standards",
                    "Design and implement complex embedded and desktop software on a variety of hardware platforms",
                    "Generate rapid prototypes for feasibility testing",
                    "Work with engineering testing and production teams for software validation/verification",
                    "Generate all documentation relevant to software operation",
                    "Perform tasks as specified by the Software Development Team Lead(s)",
                    "Adhere to the Quality Management System (QMS) ISO9001:2008",
                    "Contribute to the improvement of development systems and processes to ensure efficient and effective work procedures are maintained and/or improved",
                    "Communicate effectively with customers on technical or sensitive issues",
                    "Provide on-site customer support when required (only on very sensitive or urgent issues)"
                ]
            },
            "job_job_title": "Software engineer",
            "job_posting_language": "en",
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        },
        {
            "employer_name": "Defendry",
            "employer_logo": null,
            "employer_website": "http://defendry.com",
            "employer_company_type": null,
            "job_publisher": "Glassdoor",
            "job_id": "3GoVMqjvahgAAAAAAAAAAA==",
            "job_employment_type": "FULLTIME",
            "job_title": "Machine Learning Engineer",
            "job_apply_link": "https://www.glassdoor.com/job-listing/machine-learning-engineer-defendry-JV_IC1133911_KO0,25_KE26,34.htm?jl=1006657712642",
            "job_apply_is_direct": false,
            "job_apply_quality_score": 0.5667,
            "job_description": "Do you want to make a difference and help save lives? We at Defendry are on a mission to address the current active shooter epidemic by doing what we do best — creating tech solutions. We’re searching for people who share our same passion.\n\nYou will be joining a fast paced, dynamic environment and product team, working with top talent in the fields of Data Science / Machine Learning, Cloud Computing, App Development and Integration (IoT, Drones, Security Systems).\n\nThe Machine Learning Engineer Will work with the Defendry Chief Science Officer to refine current computer vision models, as well as create new features and abilities with new models.\n\nRequirements:\n• Python fluency\n• Experience building new computer vision models with Tensorflow/PyTorch/Caffe.\n• Knowledge of the various classification/localization techniques (SSD, Yolo, FasterRCNN, etc.)\n• Some form of quantitative background\n\nNice to Have:\n• Experience creating new computer vision models from scratch.",
            "job_is_remote": false,
            "job_posted_at_timestamp": 1679702400,
            "job_posted_at_datetime_utc": "2023-03-25T00:00:00.000Z",
            "job_city": "Scottsdale",
            "job_state": "AZ",
            "job_country": "US",
            "job_latitude": 33.49417,
            "job_longitude": -111.92605,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=machine+learning+engineer+in+tempe,+usa&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=machine+learning+engineer+in+tempe,+usa&htidocid=3GoVMqjvahgAAAAAAAAAAA%3D%3D",
            "job_offer_expiration_datetime_utc": "2023-05-21T00:00:00.000Z",
            "job_offer_expiration_timestamp": 1684627200,
            "job_required_experience": {
                "no_experience_required": false,
                "required_experience_in_months": null,
                "experience_mentioned": true,
                "experience_preferred": false
            },
            "job_required_skills": null,
            "job_required_education": {
                "postgraduate_degree": false,
                "professional_certification": false,
                "high_school": false,
                "associates_degree": false,
                "bachelors_degree": false,
                "degree_mentioned": false,
                "degree_preferred": false,
                "professional_certification_mentioned": false
            },
            "job_experience_in_place_of_education": false,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_currency": null,
            "job_salary_period": null,
            "job_highlights": {
                "Qualifications": [
                    "Python fluency",
                    "Experience building new computer vision models with Tensorflow/PyTorch/Caffe",
                    "Knowledge of the various classification/localization techniques (SSD, Yolo, FasterRCNN, etc.)",
                    "Some form of quantitative background",
                    "Experience creating new computer vision models from scratch"
                ],
                "Responsibilities": [
                    "The Machine Learning Engineer Will work with the Defendry Chief Science Officer to refine current computer vision models, as well as create new features and abilities with new models"
                ]
            },
            "job_job_title": "Learning engineer",
            "job_posting_language": "en",
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        },
        {
            "employer_name": "Wells Fargo",
            "employer_logo": "https://www.wellsfargo.com/assets/images/logos/wellsfargo/logo_974x1050.png",
            "employer_website": "http://www.wellsfargo.com",
            "employer_company_type": "Finance",
            "job_publisher": "EOP'S Diversity And Inclusion Career Center - Equal Opportunity Publications",
            "job_id": "y6tgSie_18oAAAAAAAAAAA==",
            "job_employment_type": "FULLTIME",
            "job_title": "Proactive Response AI Consultant",
            "job_apply_link": "https://careercenter.eop.com/job/proactive-response-ai-consultant/68891605/",
            "job_apply_is_direct": false,
            "job_apply_quality_score": 0.5659,
            "job_description": "About this role:\n\nWells Fargo is seeking a Senior Artificial Intelligence Solutions Consultant to drive early detection of system anomalies and craft mitigation responses toward sustaining system availability.\n\nIn this role, you will:\n• Develop early detection capabilities that enable the Command Center to become aware of anomalies, rapidly detect and respond to emerging issues, and invoke enterprise self-healing cmdlets\n• Leverage data visualization tools for guiding the development of environmental health monitoring and the signaling of anomalies or emerging problems\n• Perform environment baselining and the analysis of complex variables toward automating the identification of rare events, unexpected items, or unusual observations that may represent signals for early warning\n• Build machine learning/AI models or other analytical techniques to assist with detecting an emerging issue and understanding and issue in detail, including its causes and potential impact\n• Organize and commoditize observability data collected from various monitoring sources, including social media, APM tools, tracing tools, and AIOps, to provide keen insights for making generalized business decisions\n• Develop strategies to mitigate the impact of emerging issues, including defining alert thresholds, escalation strategies, and automated response. This could involve collaborating with other teams within the organization to coordinate the response to emerging issues and ensure that appropriate measures are taken\n• Communicate with various stakeholders, including senior management, other departments, and external partners or customers, to inform them about emerging issues and the steps to address them. This could involve drafting reports, preparing presentations, or directly communicating with stakeholders\n• Continuously monitor and evaluate the effectiveness of the new systems, processes, and technologies to ensure that they are achieving their intended outcomes. This could involve conducting regular system performance reviews, analyzing data and metrics, and making necessary adjustments to improve performance\nEssential Soft Skills:\n• Critical thinking : The ability to analyze complex situations and identify potential issues before they become problems is crucial in a command center\n• Communication skills : Effective communication skills are essential for both internal and external communication, particularly in high-pressure situations\n• Problem-solving : The ability to identify problems and develop effective solutions quickly is critical in a command center\n• Attention to detail : Detecting emerging issues often requires a keen eye for detail and the ability to identify subtle changes or patterns\n• Technical expertise : Broad technical expertise in areas such as cybersecurity, networking, infrastructure, and data analytics.\n• Time management : Detection and prevention occurs in real-time and often requires quick decisions, so the ability to manage time effectively is critical\n• Adaptability : Wells Fargo's environment is sophisticated and dynamic so the ability to adapt to changing circumstances and priorities is vital\n• Teamwork : Collaboration with other team members is essential to ensure that emerging issues are identified and addressed quickly and effectively\n• Leadership : May require leadership skills to coordinate efforts across different teams or departments\nRequired Qualifications:\n• 3+ years of Site Reliability Engineering, Systems Engineering, Technology Architecture experience, or equivalent experience demonstrated through one or a combination of the following: work experience, training, military experience, and education\n• 2+ years of AI/ML modelling and algorithms with a strong command of clustering, regression, and classification use cases\n• 2+ years of statistical analysis or equivalent experience demonstrated through one or a combination of the following: work experience, training, military experience, and education\n• 2+ years of Cloud administration, Technology Operations experience, or equivalent demonstrated through one or a combination of the following: work experience, training, military experience, and education\nDesired Qualifications:\n• 2+ years of Analytics experience, or equivalent demonstrated through one or a combination of the following: work experience, training, military experience, education\nJob Expectations:\n• Current corporate policy is Remote work available for 2 days per week\nWe Value Diversity\n\nAt Wells Fargo, we believe in diversity, equity and inclusion in the workplace; accordingly, we welcome applications for employment from all qualified candidates, regardless of race, color, gender, national origin, religion, age, sexual orientation, gender identity, gender expression, genetic information, individuals with disabilities, pregnancy, marital status, status as a protected veteran or any other status protected by applicable law.\n\nEmployees support our focus on building strong customer relationships balanced with a strong risk mitigating and compliance-driven culture which firmly establishes those disciplines as critical to the success of our customers and company. They are accountable for execution of all applicable risk programs (Credit, Market, Financial Crimes, Operational, Regulatory Compliance), which includes effectively following and adhering to applicable Wells Fargo policies and procedures, appropriately fulfilling risk and compliance obligations, timely and effective escalation and remediation of issues, and making sound risk decisions. There is emphasis on proactive monitoring, governance, risk identification and escalation, as well as making sound risk decisions commensurate with the business unit's risk appetite and all risk and compliance program requirements.\n\nCandidates applying to job openings posted in US: All qualified applicants will receive consideration for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran.\n\nCandidates applying to job openings posted in Canada: Applications for employment are encouraged from all qualified candidates, including women, persons with disabilities, aboriginal peoples and visible minorities. Accommodation for applicants with disabilities is available upon request in connection with the recruitment process.\n\nDrug and Alcohol Policy\n\nWells Fargo maintains a drug free workplace. Please see our Drug and Alcohol Policy to learn more.",
            "job_is_remote": false,
            "job_posted_at_timestamp": 1681948800,
            "job_posted_at_datetime_utc": "2023-04-20T00:00:00.000Z",
            "job_city": "Tempe",
            "job_state": "AZ",
            "job_country": "US",
            "job_latitude": 33.42551,
            "job_longitude": -111.94,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=machine+learning+engineer+in+tempe,+usa&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=machine+learning+engineer+in+tempe,+usa&htidocid=y6tgSie_18oAAAAAAAAAAA%3D%3D",
            "job_offer_expiration_datetime_utc": "2023-05-20T00:00:00.000Z",
            "job_offer_expiration_timestamp": 1684540800,
            "job_required_experience": {
                "no_experience_required": false,
                "required_experience_in_months": 24,
                "experience_mentioned": true,
                "experience_preferred": false
            },
            "job_required_skills": null,
            "job_required_education": {
                "postgraduate_degree": false,
                "professional_certification": false,
                "high_school": false,
                "associates_degree": false,
                "bachelors_degree": false,
                "degree_mentioned": false,
                "degree_preferred": false,
                "professional_certification_mentioned": false
            },
            "job_experience_in_place_of_education": false,
            "job_min_salary": null,
            "job_max_salary": null,
            "job_salary_currency": null,
            "job_salary_period": null,
            "job_highlights": {
                "Qualifications": [
                    "Critical thinking : The ability to analyze complex situations and identify potential issues before they become problems is crucial in a command center",
                    "Communication skills : Effective communication skills are essential for both internal and external communication, particularly in high-pressure situations",
                    "Problem-solving : The ability to identify problems and develop effective solutions quickly is critical in a command center",
                    "Attention to detail : Detecting emerging issues often requires a keen eye for detail and the ability to identify subtle changes or patterns",
                    "Technical expertise : Broad technical expertise in areas such as cybersecurity, networking, infrastructure, and data analytics",
                    "Time management : Detection and prevention occurs in real-time and often requires quick decisions, so the ability to manage time effectively is critical",
                    "Adaptability : Wells Fargo's environment is sophisticated and dynamic so the ability to adapt to changing circumstances and priorities is vital",
                    "Teamwork : Collaboration with other team members is essential to ensure that emerging issues are identified and addressed quickly and effectively",
                    "Leadership : May require leadership skills to coordinate efforts across different teams or departments",
                    "3+ years of Site Reliability Engineering, Systems Engineering, Technology Architecture experience, or equivalent experience demonstrated through one or a combination of the following: work experience, training, military experience, and education",
                    "2+ years of AI/ML modelling and algorithms with a strong command of clustering, regression, and classification use cases",
                    "2+ years of Cloud administration, Technology Operations experience, or equivalent demonstrated through one or a combination of the following: work experience, training, military experience, and education"
                ],
                "Responsibilities": [
                    "Develop early detection capabilities that enable the Command Center to become aware of anomalies, rapidly detect and respond to emerging issues, and invoke enterprise self-healing cmdlets",
                    "Leverage data visualization tools for guiding the development of environmental health monitoring and the signaling of anomalies or emerging problems",
                    "Perform environment baselining and the analysis of complex variables toward automating the identification of rare events, unexpected items, or unusual observations that may represent signals for early warning",
                    "Build machine learning/AI models or other analytical techniques to assist with detecting an emerging issue and understanding and issue in detail, including its causes and potential impact",
                    "Organize and commoditize observability data collected from various monitoring sources, including social media, APM tools, tracing tools, and AIOps, to provide keen insights for making generalized business decisions",
                    "Develop strategies to mitigate the impact of emerging issues, including defining alert thresholds, escalation strategies, and automated response",
                    "This could involve collaborating with other teams within the organization to coordinate the response to emerging issues and ensure that appropriate measures are taken",
                    "Communicate with various stakeholders, including senior management, other departments, and external partners or customers, to inform them about emerging issues and the steps to address them",
                    "This could involve drafting reports, preparing presentations, or directly communicating with stakeholders",
                    "Continuously monitor and evaluate the effectiveness of the new systems, processes, and technologies to ensure that they are achieving their intended outcomes",
                    "This could involve conducting regular system performance reviews, analyzing data and metrics, and making necessary adjustments to improve performance"
                ]
            },
            "job_job_title": "Consultant",
            "job_posting_language": "en",
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        },
        {
            "employer_name": "Amazon.com Services LLC",
            "employer_logo": null,
            "employer_website": null,
            "employer_company_type": null,
            "job_publisher": "Tempe, AZ - Geebo",
            "job_id": "IuylxOoFfxUAAAAAAAAAAA==",
            "job_employment_type": "FULLTIME",
            "job_title": "Data Scientist",
            "job_apply_link": "https://tempe-az.geebo.com/jobs-online/view/id/816533602-data-scientist-/",
            "job_apply_is_direct": true,
            "job_apply_quality_score": 0.4435,
            "job_description": "Our team is passionate about Brands who sell on Amazon - we help them grow their businesses, build their story, and serve their customers.\nHow do we do this? Data! Help us serve this valuable data to our Brands in digestible ways so they can run their businesses more effectively.\nAmazon Science gives you insight into the company's approach to customer-obsessed scientific innovation.\nAmazon fundamentally believes that scientific innovation is essential to being the most customer-centric company in the world.\nIt's the company's ability to have an impact at scale that allows us to attract some of the brightest minds in artificial intelligence and related fields.\nOur scientists continue to publish, teach, and engage with the academic community, in addition to utilizing our working backwards method to enrich the way we live and work.\nPlease visit https:\n//www.\namazon.\nscience for more information.\nWe are looking for a customer obsessed Data Scientist who can apply the latest research, state of the art algorithms and machine learning to build highly scalable systems in the e-commerce domain.\nAs a member of our team you will develop and evaluate machine learning models using large data-sets and cloud services to drive the growth of Brand owners on Amazon.\nWorking closely with best-in-class engineers you will have the opportunity to apply a variety of machine learning algorithms, including deep learning, and work on one of the world's largest data sets to influence the long term evolution of our science and recommendation roadmap.\n.\nEstimated Salary: $20 to $28 per hour based on qualifications.",
            "job_is_remote": false,
            "job_posted_at_timestamp": 1682035200,
            "job_posted_at_datetime_utc": "2023-04-21T00:00:00.000Z",
            "job_city": "Tempe",
            "job_state": "AZ",
            "job_country": "US",
            "job_latitude": 33.42551,
            "job_longitude": -111.94,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=machine+learning+engineer+in+tempe,+usa&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=machine+learning+engineer+in+tempe,+usa&htidocid=IuylxOoFfxUAAAAAAAAAAA%3D%3D",
            "job_offer_expiration_datetime_utc": "2023-04-28T00:00:00.000Z",
            "job_offer_expiration_timestamp": 1682640000,
            "job_required_experience": {
                "no_experience_required": false,
                "required_experience_in_months": null,
                "experience_mentioned": false,
                "experience_preferred": false
            },
            "job_required_skills": null,
            "job_required_education": {
                "postgraduate_degree": false,
                "professional_certification": false,
                "high_school": false,
                "associates_degree": false,
                "bachelors_degree": false,
                "degree_mentioned": false,
                "degree_preferred": false,
                "professional_certification_mentioned": false
            },
            "job_experience_in_place_of_education": false,
            "job_min_salary": 20,
            "job_max_salary": 28,
            "job_salary_currency": "USD",
            "job_salary_period": "HOUR",
            "job_highlights": {
                "Benefits": [
                    "Estimated Salary: $20 to $28 per hour based on qualifications"
                ]
            },
            "job_job_title": "Data scientist",
            "job_posting_language": "en",
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        },
        {
            "employer_name": "Amazon Web Services, Inc.",
            "employer_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/93/Amazon_Web_Services_Logo.svg/1200px-Amazon_Web_Services_Logo.svg.png",
            "employer_website": "http://aws.amazon.com",
            "employer_company_type": null,
            "job_publisher": "Tempe, AZ - Geebo",
            "job_id": "akzEUc_yEZgAAAAAAAAAAA==",
            "job_employment_type": "FULLTIME",
            "job_title": "Sr. Marketing Program Manager, Machine Learning Solutions",
            "job_apply_link": "https://tempe-az.geebo.com/jobs-online/view/id/826959537-sr-marketing-program-manager-/",
            "job_apply_is_direct": true,
            "job_apply_quality_score": 0.4365,
            "job_description": "Talented, self-directed Senior Marketing Program Manager to drive campaign development for Amazon Web Services (AWS) Machine Learning Global Campaigns.\nThe Senior Marketing Program Manager is responsible for the development, execution and optimization of Global Campaigns, working with the rest of the Global Campaigns team, and internal stakeholders, including Product Marketing, Brand Marketing, Executive Programs, Customer Marketing as well as external agencies and third-party content developers and publications.\nThe ideal candidate successfully manages multiple programs at one time, and will have a proven track record executing integrated awareness and lead generation campaigns that drive lead generation, acquire new customers, increase product adoption, and expand awareness of AWS solutions.\nThis role is located in Seattle but also open to Las Vegas, Minneapolis, Phoenix, Portland, and Salt Lake City.\nRelocation assistance available within the US to Seattle only.\nKey\nResponsibilities:\nLead the development, execution and optimization of integrated campaigns, focused on key AWS priority machine learning solution themes and topics, that are designed to generate leads for AWS Sellers globally.\nWork across a dynamic ecosystem of stakeholders to define, develop and implement campaign strategy.\nOrchestrate campaign and content development across a network of contributors and stakeholders.\nManage program budget with accountability for campaign ROI.\nPartner with external agencies in support of campaign tactic creation and execution.\nDive deep into data with reports and dashboards in Tableau to provide visibility into marketing campaign results and measure campaign effectiveness.\nDevelop and analyze campaign performance metrics to drive future marketing decisions and optimize campaign strategy.\nClear, consistent, and frequent communication with stakeholder teams to outline strategy, tactics, goals, and performance for campaigns.\nTravel Required:\nWhen safe, 15%, including international.\nEstimated Salary: $20 to $28 per hour based on qualifications.",
            "job_is_remote": false,
            "job_posted_at_timestamp": 1682035200,
            "job_posted_at_datetime_utc": "2023-04-21T00:00:00.000Z",
            "job_city": "Tempe",
            "job_state": "AZ",
            "job_country": "US",
            "job_latitude": 33.42551,
            "job_longitude": -111.94,
            "job_benefits": null,
            "job_google_link": "https://www.google.com/search?gl=us&hl=en&rciv=jb&q=machine+learning+engineer+in+tempe,+usa&start=0&ibp=htl;jobs#fpstate=tldetail&htivrt=jobs&htiq=machine+learning+engineer+in+tempe,+usa&htidocid=akzEUc_yEZgAAAAAAAAAAA%3D%3D",
            "job_offer_expiration_datetime_utc": "2023-04-28T00:00:00.000Z",
            "job_offer_expiration_timestamp": 1682640000,
            "job_required_experience": {
                "no_experience_required": false,
                "required_experience_in_months": null,
                "experience_mentioned": false,
                "experience_preferred": false
            },
            "job_required_skills": null,
            "job_required_education": {
                "postgraduate_degree": false,
                "professional_certification": false,
                "high_school": false,
                "associates_degree": false,
                "bachelors_degree": false,
                "degree_mentioned": false,
                "degree_preferred": false,
                "professional_certification_mentioned": false
            },
            "job_experience_in_place_of_education": false,
            "job_min_salary": 20,
            "job_max_salary": 28,
            "job_salary_currency": "USD",
            "job_salary_period": "HOUR",
            "job_highlights": {
                "Responsibilities": [
                    "The Senior Marketing Program Manager is responsible for the development, execution and optimization of Global Campaigns, working with the rest of the Global Campaigns team, and internal stakeholders, including Product Marketing, Brand Marketing, Executive Programs, Customer Marketing as well as external agencies and third-party content developers and publications",
                    "The ideal candidate successfully manages multiple programs at one time, and will have a proven track record executing integrated awareness and lead generation campaigns that drive lead generation, acquire new customers, increase product adoption, and expand awareness of AWS solutions",
                    "Lead the development, execution and optimization of integrated campaigns, focused on key AWS priority machine learning solution themes and topics, that are designed to generate leads for AWS Sellers globally",
                    "Work across a dynamic ecosystem of stakeholders to define, develop and implement campaign strategy",
                    "Orchestrate campaign and content development across a network of contributors and stakeholders",
                    "Manage program budget with accountability for campaign ROI",
                    "Partner with external agencies in support of campaign tactic creation and execution",
                    "Dive deep into data with reports and dashboards in Tableau to provide visibility into marketing campaign results and measure campaign effectiveness",
                    "Develop and analyze campaign performance metrics to drive future marketing decisions and optimize campaign strategy",
                    "Clear, consistent, and frequent communication with stakeholder teams to outline strategy, tactics, goals, and performance for campaigns"
                ],
                "Benefits": [
                    "Estimated Salary: $20 to $28 per hour based on qualifications"
                ]
            },
            "job_job_title": "Program manager",
            "job_posting_language": "en",
            "job_onet_soc": "15111100",
            "job_onet_job_zone": "5"
        }
    ]
}