{"data": "main", "children": [{"data": "software engineer_san diego", "children": [{"data": "BD", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Software Engineer - REMOTE", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://jobs.bd.com/job/san-diego/software-engineer-remote/159/46765261680", "children": []}]}, {"data": "job_description", "children": [{"data": "Job Description Summary\n\nJob Description\n\nWe are the makers of possible\n\nBD is one of the largest global medical technology companies in the world. Advancing the world of health™ is our Purpose, and it’s no small feat. It takes the imagination and passion of all of us—from design and engineering to the manufacturing and marketing of our billions of MedTech products per year—to look at the impossible and find transformative solutions that turn dreams into possibilities.\n\nWe believe that the human element, across our global teams, is what allows us to continually evolve. Join us and discover an environment in which you’ll be supported to learn, grow and become your best self. Become a maker of possible with us.\n\nThe Pyxis ES Development team currently are looking for software engineers. Candidates who would fit well in this position have an educational background in computer science or related degree, ideally possess some real-world experience working in collaborative, enterprise environments, are knowledgeable of the C#/.NET stack and/or modern web frameworks (especially React/NodeJS, Spring, Ruby, etc), collaborate well with high-pace, high-performing agile teams, and are passionate about personal and team growth. Desirable experience also includes container frameworks, security implementation (e.g. TLS/PKI, OAuth 2.0), messaging systems (e.g. Kafka, RabbitMQ), database familiarity (e.g. SQL Server, MySQL), and construction and implementation of monitoring, management, observability, and log collation in systems. An ideal candidate will have demonstrated experience with microservices architectures and a mix of on-premise and cloud native system deployments.\n\nDuties & Responsibilities:\n• Perform software design and implementation, following coding guidelines and considering system characteristics to produce optimal performance, reliability, and maintainability\n• Conduct software evaluation and testing of own software, software from other engineering staff, and third-party software\n• Provide technical documentation for the design, implementation and testing of the software\n• Attend design review meetings as needed to adhere to the software development procedures\n• Document and repair errors related to software\n• Enhance professional growth and development through participation in educational programs, current literature, in-service meetings and workshops\n• Work with cross-functional project teams to complete Product Engineering projects with minimal guidance\n• Develop cohesive interpersonal working relationships with all peers and team members\n• Work with source code management tools (e.g. Github) and work tracking tools (e.g. JIRA)\n\nMinimum Requirements:\n• Educational background in computer science or related degree\n\nFor certain roles at BD, employment is contingent upon the Company’s receipt of sufficient proof that you are fully vaccinated against COVID-19. In some locations, testing for COVID-19 may be available and/or required. Consistent with BD’s Workplace Accommodations Policy, requests for accommodation will be considered pursuant to applicable law.\n\nWhy Join Us?\n\nA career at BD means being part of a team that values your opinions and contributions and that encourages you to bring your authentic self to work. It’s also a place where we help each other be great, we do what’s right, we hold each other accountable, and learn and improve every day.\n\nYou will learn and work alongside inspirational leaders and colleagues who are equally passionate and committed to fostering an inclusive, growth-centered, and rewarding culture. You will have the opportunity to help shape the trajectory of BD while leaving a legacy at the same time. And through the organization’s investment in BD University, you will continually level up your tech skills and expertise.\n\nTo find purpose in the possibilities, we need people who can see the bigger picture, who understand the human story that underpins everything we do. We welcome people with the imagination and drive to help us reinvent the future of health. At BD, you’ll discover a culture in which you can learn, grow and thrive. And find satisfaction in doing your part to make the world a better place.\n\nTo learn more about BD visit https://bd.com/careers\n\nBecton, Dickinson and Company is an Equal Opportunity/Affirmative Action Employer. We do not unlawfully discriminate on the basis of race, color, religion, age, sex, creed, national origin, ancestry, citizenship status, marital or domestic or civil union status, familial status, affectional or sexual orientation, gender identity or expression, genetics, disability, military eligibility or veteran status, or any other protected status.\n\n#LI-PRO\n\nPrimary Work Location\nUSA CA - San Diego TC Bldg C&D\n\nAdditional Locations\n\nWork Shift\n\nAt BD, we are strongly committed to investing in our associates—their well-being and development, and in providing rewards and recognition opportunities that promote a performance-based culture. We demonstrate this commitment by offering a valuable, competitive package of compensation and benefits programs which you can learn more about on our Careers Site under Our Commitment to You.\n\nSalary ranges have been implemented to reward associates fairly and competitively, as well as to support recognition of associates’ progress, ranging from entry level to experts in their field, and talent mobility. There are many factors, such as location, that contribute to the range displayed. The salary offered to a successful candidate is based on experience, education, skills, and actual work location. Salary ranges may vary for Field-based and Remote roles.\n\nSalary Range Information\n$33.10 - $54.60", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-03-31T00:00:00.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["Candidates who would fit well in this position have an educational background in computer science or related degree, ideally possess some real-world experience working in collaborative, enterprise environments, are knowledgeable of the C#/.NET stack and/or modern web frameworks (especially React/NodeJS, Spring, Ruby, etc), collaborate well with high-pace, high-performing agile teams, and are passionate about personal and team growth", "TLS/PKI, OAuth 2.0), messaging systems (e.g", "An ideal candidate will have demonstrated experience with microservices architectures and a mix of on-premise and cloud native system deployments"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["We demonstrate this commitment by offering a valuable, competitive package of compensation and benefits programs which you can learn more about on our Careers Site under Our Commitment to You", "Salary ranges have been implemented to reward associates fairly and competitively, as well as to support recognition of associates’ progress, ranging from entry level to experts in their field, and talent mobility", "The salary offered to a successful candidate is based on experience, education, skills, and actual work location", "Salary ranges may vary for Field-based and Remote roles", "$33.10 - $54.60"], "children": []}]}]}, {"data": "Apple", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Pre-Silicon Software Engineer", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://www.ziprecruiter.com/c/Apple/Job/Pre-Silicon-Software-Engineer/-in-San-Diego,CA?jid=7a24a12968f1a081", "children": []}]}, {"data": "job_description", "children": [{"data": "Summary Posted: Apr 21, 2023\nWeekly Hours: 40\nRole Number:200475380\n\nAre you a big-picture thinker who loves setting ambitious goals? Do you have a passion for understanding how each line of code affects all the others? In the Core Operating Systems group, you’ll be an essential part of our brand’s personality, ensuring the OS is inseparable from each device’s identity as a whole. That’s because this group is committed to building fully integrated operating systems that combine hardware, software, and apps into a single Apple experience. Your dedication to cross-disciplinary collaboration will help develop groundbreaking technologies, such as iOS, macOS, watchOS, and tvOS. By crafting these distinct, holistic user experiences, you’ll continue to uphold and advance the excellence people expect from Apple devices. The Pre-Silicon Evolution team within Apple's CoreOS organization is searching for dedicated software engineers to develop software infrastructure and tooling for Apple Silicon SoCs. Our team lives at the intersection of hardware and software, and we push the boundaries of full-system, pre-silicon simulation to enable software development for iOS and macOS products during the earliest phases of their development.\nKey Qualifications\n• Highly proficient in Python.\n• Backend development experience using Django or Flask.\n• Proficiency with UNIX: bash scripting, networking, triaging issues using error logs.\n• Experience with PostgreSQL or similar.\n• Curiosity about learning embedded firmware, macOS kernel and driver internals, and ARM SoC simulation technologies.\n\nDescription\nThe software tooling and cloud infrastructure we develop is used across Apple's hardware and software organizations. We design technologies that enable development and testing of both hardware and software features for future Apple products to ensure that they work seamlessly together before they are manufactured. As a Pre-Silicon Evolution engineer (Full Stack), you will play a significant part in crafting a cloud Pre-Silicon simulation environment used across the organization for a broad range of upcoming Apple devices.\n\nEducation & Experience\nBS in CS, CE, EE or equivalent industry experience required\n\nAdditional Requirements\n• Experience designing and implementing REST APIs.\n• Experience automating deployment using Docker or Kubernetes.\n• Experience with JavaScript (jQuery, Angular, React, Vue) and CSS\n\nPay & Benefits\n• At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $95,000 and $177,000 annualized, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-24T16:15:32.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["Highly proficient in Python", "Backend development experience using Django or Flask", "Proficiency with UNIX: bash scripting, networking, triaging issues using error logs", "Experience with PostgreSQL or similar", "Curiosity about learning embedded firmware, macOS kernel and driver internals, and ARM SoC simulation technologies", "BS in CS, CE, EE or equivalent industry experience required", "Experience designing and implementing REST APIs", "Experience automating deployment using Docker or Kubernetes", "Experience with JavaScript (jQuery, Angular, React, Vue) and CSS"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["Pay & Benefits", "At Apple, base pay is one part of our total compensation package and is determined within a range", "The base pay range for this role is between $95,000 and $177,000 annualized, and your base pay will depend on your skills, qualifications, experience, and location", "You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition", "Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation"], "children": []}]}]}, {"data": "UC San Diego", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Senior .NET Software Engineer (Remote) - 119553", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://employment.ucsd.edu/senior-net-software-engineer-remote-119553/job/21460808", "children": []}]}, {"data": "job_description", "children": [{"data": "Payroll Title:\nAPPLICATIONS PROGR 4 Department:\nINFORMATION TECHNOLOGY SVCS Hiring Pay Scale\n$95,000 - $115,500 / Year Worksite:\nHybrid Remote Appointment Type:\nContract Appointment Percent:\n100% Union:\nUncovered Total Openings:\n1 Work Schedule:\nDays, 8 hrs/day, Mon-Fri\n\n#119553 Senior .NET Software Engineer (Remote)\nInitial Review Date: Mon 12/5/2022\nApply Now\n\nUC San Diego values equity, diversity, and inclusion. If you are interested in being part of our team, possess the needed licensure and certifications, and feel that you have most of the qualifications and/or transferable skills for a job opening, we strongly encourage you to apply.\n\nFor the safety and well-being of the entire university community, the University of California requires, with few exceptions, that all students, faculty and staff be vaccinated against the COVID-19 virus and influenza before they will be allowed on campus or in a facility or office. For more information visit: Flu Vaccine Mandate / COVID Vaccine Policy\n\nThis is a Contract/Limited position. This appointment may be extended or converted to career status based on the needs of the department.\n\nUC San Diego Policy will not allow this position to receive work visa sponsorship.\n\nFully remote or Hybrid work will be considered.\n\nDESCRIPTION\n\nUC San Diego is ranked the 9th best public university in the nation by U.S. News and World Report and is the largest employer based in San Diego County. Reporting to the VC-CFO, Information Technology Services (ITS) delivers Enterprise information technology services to the University of California, San Diego (UCSD) under the leadership of the campus Chief Information Officer (CIO). Information Technology Services (IT Services) uses world-class services and technologies to empower UC San Diego's mission to transform California and the world as a student-centered, research-focused, service-oriented public university. As a strategic member of the UC San Diego community, IT Services embraces innovation in their delivery of IT services, infrastructure, applications, and support. IT Services is customer-focused and committed to collaboration, continuous improvement, and accountability.\n\nEquity, Diversity, and Inclusion are core values at UC San Diego and within Information Technology Services. Crafting a culture around these values allows us to more deeply connect with and appreciate our employees, students, and campus partners. Information Technology Services is continuously working to build a community where we all feel safe, empowered, and encouraged to bring our authentic selves to work. We do this not only because it is what’s right, but because we know that diversity drives insight and innovation. We are proud to partner closely UC San Diego’s Office for Equity, Diversity, and Inclusion, as their dedication to this mission helps us all to drive change.\n\nBusiness Technology Services, a division of IT Services, provides enterprise solutions and application development for the UC San Diego community. We deliver quality and reliable systems and services that help our campus continuously improve business processes. Our combined technical resources allow us to build, integrate, host, and deliver campus-wide enterprise systems for both our campus and collaboratively with other campuses within the UC system. Additionally, the team offers custom integration and application development services, business analysis services and data management services for a variety of departments on the campus.\n\nThe Application Development & Integration Services (ADIS) team provides enterprise solutions for the UC San Diego community. We strive to consistently deliver quality and reliable services that help our campus achieve its administrative goals. Our combined technical resources allow us to build, integrate, host, and deliver enterprise services for both our campus and collaboratively with other campuses within the UC system. Additionally, the team offers custom integration and application development services, business analysis services and data management services for a variety of departments on the campus.\n\nTechnical leader and integral team member, responsibilities include advanced software concepts and objectives to large scale projects of broad scope and complexity; including researching, designing, developing, modifying, testing, debugging, troubleshooting and maintaining source code. Also having direct or related involvement in designing related databases, user interfaces, integration to other systems/applications, content or multimedia processes. Collaborates with stakeholders, process owners and ITS colleagues to define and execute strategically-aligned project plans. Establishes software development, SDLC and IT standards.\n\nUnder the direction of the Director of Application Development, provides leadership and guidance to the team. Serves as a senior member of the unit leadership team consisting of technical experts and functional leaders, supervising professional technical staff and taking responsibility for development and support of campus-wide, mission critical services.\nRESPONSIBILITIES\n\nApplies advanced software concepts and objectives to medium to large projects of broad scope and complexity. Regularly resolves highly complex issues where analysis of situations or data requires an in-depth evaluation of variable factors. Selects tools, methods, techniques, and evaluation criteria to obtain results.\nQUALIFICATIONS\n• Bachelor's degree in related area and / or equivalent experience / training\n• Highly advanced skills associated with software specification, design, modification, implementation and deployment of large-scale scope. Ability to create technical designs and estimates for implementing complex data integrations and software applications that span multiple environments and platforms, such as Cloud, Linux.\n• The knowledge and ability to implement authentication and authorization methods, object/entities and relationships.\n• Advanced knowledge of frameworks, platforms and tools including: .NET Core, .NET Framework, NHibernate, IIS, SSIS, and MS SQL Server.\n• Advanced database knowledge and design concepts, including tables and data types, stored procedures, views and security.\n• Ability to write highly complex queries, define relationships, create objects: tables, views, stored procedures and design indexes.\n• Capable of configuring and monitoring connection pools; SQL optimization, manage database changes and deployments with respect to application lifecycle.\n• Proven complex problem- solving skills. Ability to investigate and diagnose all aspects of application issues, including security, business logic, database connection, entities, queries, performance, memory management and load issues. Make recommendations to the department on tools and problem solving techniques.\n• Advanced knowledge of code repositories, build and deployment process and tool sets, especially as related to Cloud platforms, SaaS and iPaaS. Tools such as git, jenkins, static code analyzers, and binary repos.\n\nSPECIAL CONDITIONS\n• Employee must be available to work evenings and weekends.\n• Employee must be available to travel as required.\n• Job offer is contingent on clear background check.\n\nOur employees enjoy competitive compensation packages and educational opportunities in a diverse, stimulating workforce.\n\nThis position is eligible for full:\n- Health/Dental/Vision Insurance\n- Vacation/Holidays\n- Life Insurance\n- UC Retirement Plan.\n\nFor more information about UCSD Benefits visit and UCSD Work/Life visit\n\nTo calculate an approximate value of the UC Total Compensation package, please click here.\n\nPay Transparency Act\n\nAnnual Full Pay Range: $71,000 - $160,000 (will be prorated if the appointment percentage is less than 100%)\n\nHourly Equivalent: $34.00 - $76.63\n\nFactors in determining the appropriate compensation for a role include experience, skills, knowledge, abilities, education, licensure and certifications, and other business and organizational needs. The Hiring Pay Scale referenced in the job posting is the budgeted salary or hourly range that the University reasonably expects to pay for this position. The Annual Full Pay Range may be broader than what the University anticipates to pay for this position, based on internal equity, budget, and collective bargaining agreements (when applicable).\n\nApply Now\n\nJob offer is contingent on successful engagement in the UC COVID-19 Vaccination program (fully vaccinated with documented proof or approved exception/deferral).\n\nTo foster the best possible working and learning environment, UC San Diego strives to cultivate a rich and diverse environment, inclusive and supportive of all students, faculty, staff and visitors. For more information, please visit UC San Diego Principles of Community.\n\nThe University of California is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, age, protected veteran status, gender identity or sexual orientation. For the complete University of California nondiscrimination and affirmative action policy see: http://www-hr.ucsd.edu/saa/nondiscr.html\n\nUC San Diego is a smoke and tobacco free environment. Please visit smokefree.ucsd.edu for more information.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-10T00:00:00.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["Bachelor's degree in related area and / or equivalent experience / training", "Highly advanced skills associated with software specification, design, modification, implementation and deployment of large-scale scope", "Ability to create technical designs and estimates for implementing complex data integrations and software applications that span multiple environments and platforms, such as Cloud, Linux", "The knowledge and ability to implement authentication and authorization methods, object/entities and relationships", "Advanced knowledge of frameworks, platforms and tools including: .NET Core, .NET Framework, NHibernate, IIS, SSIS, and MS SQL Server", "Advanced database knowledge and design concepts, including tables and data types, stored procedures, views and security", "Ability to write highly complex queries, define relationships, create objects: tables, views, stored procedures and design indexes", "Capable of configuring and monitoring connection pools; SQL optimization, manage database changes and deployments with respect to application lifecycle", "Proven complex problem- solving skills", "Ability to investigate and diagnose all aspects of application issues, including security, business logic, database connection, entities, queries, performance, memory management and load issues", "Tools such as git, jenkins, static code analyzers, and binary repos", "Employee must be available to work evenings and weekends", "Employee must be available to travel as required"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["Our employees enjoy competitive compensation packages and educational opportunities in a diverse, stimulating workforce", "Health/Dental/Vision Insurance", "Life Insurance", "UC Retirement Plan", "For more information about UCSD Benefits visit and UCSD Work/Life visit", "Annual Full Pay Range: $71,000 - $160,000 (will be prorated if the appointment percentage is less than 100%)", "Hourly Equivalent: $34.00 - $76.63"], "children": []}]}]}, {"data": "Scientific Research Corporation", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Software Engineer", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://www.indeed.com/viewjob?jk=cb6e3202435dee09", "children": []}]}, {"data": "job_description", "children": [{"data": "PRIMARY DUTIES & RESPONSIBILITIES:\n• Provides on-site development and support to the Ship's Signal Exploitation Equipment (SSEE) Family of Systems\n• Identifies, deconflicts and orchestrates integration of competing software branches\n• Refactors legacy Java/JavaScript code for efficiency enhancements\n• Supports with AWS environment and software development\n• Builds modular and highly re-usable code\n• Self-directs research, including decomposition of existing systems and design of new systems and configurations\n• Researches and implements integrations between various new/existing systems to provide new functionality\n• Troubleshoots existing Java code\n• Researches and recommends new innovative system features as well as improvements for existing system functionality\n\nRequirements:\nMINIMUM SKILLS & REQUIREMENTS:\n• Must possess an active Top Secret/SCI clearance\n• Minimum of two plus (2+) years of software development experience\n• Coding experience in one or more of the following:\n• Java\n• Python\n• Node.js\n• Strong experience developing/integrating Restful APIs\n• Experience with CI/CD pipeline common tools (Jenkins, Artifactory, SonarQube, BitBucket or similar) and practices Strong experience with multi-threaded, asynchronous or event driven code\n• Experience with source control applications such as Git or SVN\n• Must currently hold a DoD 8570-compliant IAT II certification (SSCP or Security+ CE with appropriate CE/OS certificate) or be able to obtain within six months\n• Have developed communication skills and the ability to express thoughts and ideas clearly and concisely, employing technical writing techniques\n• Must be a team player, dedicated to program support, capable of multitasking and working several complex and diverse tasks with simultaneous or near simultaneous deadlines\n• Be a self-starter who is accountable and requires minimal direction and supervision; a person who is open to new ideas\n\nDESIRED SKILLS & REQUIREMENTS:\n• Familiarization with container concepts\n• Experience with cloud technology platforms such as AWS, Azure and/or Google Cloud\n• Experience with real-time streaming data and/or socket programming\n• Experience with RedHat based Linux\n• Experience creating and deploying Linux services\n• Experience creating and deploying an RPM\n• Understanding of network fundamentals\n\nSRC IS A CONTRACTOR FOR THE U.S. GOVERNMENT, THIS POSITION WILL REQUIRE U.S. CITIZENSHIP AS WELL AS, A U.S. GOVERNMENT SECURITY CLEARANCE AT THE TOP SECRET / SCI LEVEL WITH TOP SECRET / SCI with CI POLY ELIGIBILITY\n\nABOUT US\n\nScientific Research Corporation is an advanced information technology and engineering company that provides innovative products and services to government and private industry, as well as independent institutions. At the core of our capabilities is a seasoned team of highly skilled engineers and scientists with multidisciplinary backgrounds. This team is challenged daily to provide cutting edge technology solutions to our clients.\n\nScientific Research Corporation offers a competitive salary, an extensive benefits package and a work environment that encourages excellence. For positions requiring a security clearance, selected applicants will be subject to a government security investigation and must meet eligibility requirements for access to classified information.\n\nDIVERSITY & INCLUSION\n\nWe strongly believe in the abundance of differences among individuals. We value different points of view and appreciate diverse perspectives. We truly believe this is what makes our organization inclusive and more responsive to the needs of our diverse customers.\n\nEQUAL OPPORTUNITY EMPLOYER\n\nScientific Research Corporation is an equal opportunity and affirmative action employer that does not discriminate in employment.\n\nAll qualified applicants will receive consideration for employment without regard to their race, color, religion, sex, age, sexual orientation, gender identity, or national origin, disability or protected veteran status.\n\nScientific Research Corporation endeavors to make www.scires.com accessible to any and all users. If you would like to contact us regarding the accessibility of our website or need assistance completing the application process, please contact srchr@scires.com for assistance. This contact information is for accommodation requests only and cannot be used to inquire about the status of applications.\n\nCovid 19\n\nSRC does not currently require COVID-19 vaccinations for its employees. Pending the outcome of various court proceedings and resultant government action, SRC and all other Federal Contractor employees may be required, at some point in the future, to be fully vaccinated subject to accommodations for valid medical or religious reasons. Please visit https://www.saferfederalworkforce.gov/contractors/ to read more about the Federal Government's current position on COVID-19 vaccines for Federal Contractor employees.\n\n[#CJ #LI-LL1]", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-24T15:07:38.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["Must possess an active Top Secret/SCI clearance", "Minimum of two plus (2+) years of software development experience", "Coding experience in one or more of the following:", "Java", "Python", "Node.js", "Strong experience developing/integrating Restful APIs", "Experience with CI/CD pipeline common tools (Jenkins, Artifactory, SonarQube, BitBucket or similar) and practices Strong experience with multi-threaded, asynchronous or event driven code", "Experience with source control applications such as Git or SVN", "Must currently hold a DoD 8570-compliant IAT II certification (SSCP or Security+ CE with appropriate CE/OS certificate) or be able to obtain within six months", "Have developed communication skills and the ability to express thoughts and ideas clearly and concisely, employing technical writing techniques", "Must be a team player, dedicated to program support, capable of multitasking and working several complex and diverse tasks with simultaneous or near simultaneous deadlines", "Be a self-starter who is accountable and requires minimal direction and supervision; a person who is open to new ideas", "CITIZENSHIP AS WELL AS, A U.S. GOVERNMENT SECURITY CLEARANCE AT THE TOP SECRET / SCI LEVEL WITH TOP SECRET / SCI with CI POLY ELIGIBILITY"], "children": []}]}, {"data": "Benefits", "children": [{"data": "No benefits data available", "children": []}]}]}, {"data": "Brain Corp", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Senior Software Engineer", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://braincorp.com/company/careers/job/?id=6618642002", "children": []}]}, {"data": "job_description", "children": [{"data": "We are Brain Corp and we enable smarter operations. We set out to create the most intelligent tools ever, and now we power the world’s largest fleet of robots operating in commercial public spaces. By injecting intelligence into our customers' operations, we transform manual operations into automated workflows, making the lives of people safer, easier and more productive. Our robots are running around thousands of stores, schools, warehouses, hospitals, offices, airports and more, solving practical challenges with revolutionary solutions. For more information on how we are turning robots into tools that serve a purpose and to learn how you can become a brainiac, please visit: https://www.braincorp.com/.\n\nPosition Summary:\n\nHave you ever had an online order canceled because something was out of stock or wasted time going to a store to look at something the website said was available only to find out that it was not? This is the problem we are trying to help our retail customers solve to maximize shopper experience and on shelf availability.\n\nAs a Senior Software Engineer on the Software Engineering Applications team, you will be part of a fast-paced team that is pioneering products built on our BrainOS platform to revolutionize the Retail Inventory Analytics Space. You naturally take ownership over feature and project outcomes that span multiple components or individual tasks. You often participate in technical decision making and provide guidance to junior team members in design and implementation details. You thrive in solving complex software systems and challenging technical problems that are not straightforward.\n\nOur robotic solutions integrate multiple hardware and software disciplines in order to provide scalable solutions for our customers. For example, we get to think about how to apply autonomous navigation, camera configurations, and data pipeline workflows to ensure that the highest quality images are captured so that inventory insights through computer vision can be realized by our customers. While this job is highly technical, and being a top code-contributor is expected, this role is expected to be involved in discussions across teams, ensuring scalable system designs and implementations, and having deep understanding of product and customer use cases.\n\nDuties and Responsibilities:\n• Designing, developing and implementing complex software systems in application level code.\n• Mentoring junior engineers, providing technical guidance and driving best practices for code development, review, testing, and deployment that will ensure high quality software releases.\n• Participating in technical decision making, project planning, and technical roadmapping in coordination with Product, Program, and engineering Management.\n• Identifying and fixing software bugs to improve system performance and production quality.\n• Ensuring software is reliable, scalable and maintainable.\n\nWhat you need:\n• BS or MS in Computer Science or applicable engineering discipline.\n• 5 years (suggested) of demonstrated experience in software development for complex function-based software that interacts with sensor inputs, control loops and redundancy.\n• Demonstrated proficiency with OOO implementation in C++ and/or Python production level coding.\n• Demonstrated experience leading, mentoring and developing mid-size software engineering teams in a fast-paced environment.\n• Delivered complete software products that meet rigorous functional safety-critical requirements.\n• Demonstrated experience being part of agile (scrum) development teams and tailoring processes to maximize team’s productivity and efficiency.\n• Excellent technical and analytical skills across different types of data sets.\n• Excellent communication skills across verbal, visual and written forms.\n\nThings that make a difference:\n• Experience in autonomous vehicles, robotics, or related industry.\n• Experience with robotic motion planning, perception, or SLAM\n• Experience in IOT, Data Analytics and Machine Learning.\n• Disciplined to stay up to date on new technologies and development trends.\n\nPhysical Demands:\n\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Essential functions may require maintaining the physical condition necessary for sitting, walking or standing for periods of time; operating a computer and keyboard; talk and hear at normal room levels; using hands to finger, and grasp; repetitive motion; close visual acuity to prepare and analyze data and figures; transcribing; viewing a computer terminal; extensive reading; visual inspection involving small defects, small parts, and/or operation of machines; use of measurement devices; and/or assembly or fabrication parts at distances close to the eyes; push or pull up to 10 pounds.\n\nWork Environment:\n\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. The noise level in the work environment is usually quiet to moderate. Employees are exposed to the typical office environment with computers, printers and telephones.\n\nSalary Range:\n\nThe anticipated salary range for candidates who will work in San Diego, California is $136,500 to $143,325. The final salary offered to a successful candidate will be dependent on several factors that may include but are not limited to the type and length of experience within the job, type and length of experience within the industry, education, etc. Brain Corp is a multi-state employer and this salary range may not reflect positions that work in other states.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-02-14T00:00:00.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["BS or MS in Computer Science or applicable engineering discipline", "5 years (suggested) of demonstrated experience in software development for complex function-based software that interacts with sensor inputs, control loops and redundancy", "Demonstrated proficiency with OOO implementation in C++ and/or Python production level coding", "Demonstrated experience leading, mentoring and developing mid-size software engineering teams in a fast-paced environment", "Delivered complete software products that meet rigorous functional safety-critical requirements", "Demonstrated experience being part of agile (scrum) development teams and tailoring processes to maximize team’s productivity and efficiency", "Excellent technical and analytical skills across different types of data sets", "Excellent communication skills across verbal, visual and written forms", "Experience in autonomous vehicles, robotics, or related industry", "Experience with robotic motion planning, perception, or SLAM", "Experience in IOT, Data Analytics and Machine Learning", "Disciplined to stay up to date on new technologies and development trends", "Essential functions may require maintaining the physical condition necessary for sitting, walking or standing for periods of time; operating a computer and keyboard; talk and hear at normal room levels; using hands to finger, and grasp; repetitive motion; close visual acuity to prepare and analyze data and figures; transcribing; viewing a computer terminal; extensive reading; visual inspection involving small defects, small parts, and/or operation of machines; use of measurement devices; and/or assembly or fabrication parts at distances close to the eyes; push or pull up to 10 pounds"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["The anticipated salary range for candidates who will work in San Diego, California is $136,500 to $143,325", "The final salary offered to a successful candidate will be dependent on several factors that may include but are not limited to the type and length of experience within the job, type and length of experience within the industry, education, etc"], "children": []}]}]}, {"data": "Apple", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Media Experience Software Engineer", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://www.ziprecruiter.com/c/Apple/Job/Media-Experience-Software-Engineer/-in-San-Diego,CA?jid=7b42b587bb9b0dba", "children": []}]}, {"data": "job_description", "children": [{"data": "Summary Posted: Apr 21, 2023\nWeekly Hours: 40\nRole Number:200473902\n\nAt Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. To help Apple get there, the Connected Media software team is seeking a self-motivated Software Engineer to ensure a stellar Media Experience across the entire Apple Ecosystem. Do you bring passion and dedication to your job? If yes, we are looking for individuals like you. This team is a part of the Audio and Media Technologies group (AMT) that provides the media and audio foundation across all of Apple's innovative products including iPhone, iPad, Apple Watch, AppleTV, HomePod, Mac and the AirPod/Beats line of Products. The team has played a major role in delivering some of the recent exciting features such as automatic AirPods switching devices, Picture-In-Picture, HomePod as permanent speaker for Apple TV, AirPlay2, SharePlay, Microphone usage reporting and customized haptics and audio feedback for apps. As a member of this team, you will have an outstanding opportunity to work across all Apple products and play a central role in the audio software stack. As part of middleware, we interpret an application's desired audio behavior and configure the underlying audio stack accordingly. Working in conjunction with design and other engineering teams, we are in charge of all the audio routing and system policies that impact user behavior as defined here: https://developer.apple.com/design/human-interface-guidelines/ios/user-interaction/audio/ (https://developer.apple.com/design/human-interface-guidelines/ios/user-interaction/audio/).\nKey Qualifications\n• Excellent programming skills with knowledge of C/C++ or Objective-C\n• Knowledge of computer architecture, multi-threading and high-level operating systems\n• Proficient in debugging problems in a large code base\n• Produce good quality work under tight schedules and rapid development cycles\n\nDescription\nThe Connected Media team is looking for a software engineer with strong technical, programming, debugging and analytical skills. You will be involved in all stages of developing ground breaking features as well as supporting our existing ecosystem.\n\nEducation & Experience\nBS/MS in Computer Science or equivalent\n\nAdditional Requirements\n• ADDITIONAL REQUIREMENTS (NICE TO HAVE, BUT NOT REQUIRED):\n• 3+ years industry experience\n• Experience working in audio or media software stacks\n• Debugging sophisticated problems in a highly concurrent environments\n• Ability to work with designers and recommend behavioral policies based on hardware and software capabilities and limitations\n• Ability to work with quality engineers to develop test plans for new features\n• A track record of designing and building architectural platforms that hold up over time to the addition of new features and hardware platforms\n\nPay & Benefits\n• At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $95,000 and $177,000 annualized, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-24T16:15:32.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["Excellent programming skills with knowledge of C/C++ or Objective-C", "Knowledge of computer architecture, multi-threading and high-level operating systems", "Proficient in debugging problems in a large code base", "BS/MS in Computer Science or equivalent", "ADDITIONAL REQUIREMENTS (NICE TO HAVE, BUT NOT REQUIRED):", "3+ years industry experience", "Experience working in audio or media software stacks", "Debugging sophisticated problems in a highly concurrent environments", "Ability to work with designers and recommend behavioral policies based on hardware and software capabilities and limitations", "Ability to work with quality engineers to develop test plans for new features", "A track record of designing and building architectural platforms that hold up over time to the addition of new features and hardware platforms"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["Pay & Benefits", "At Apple, base pay is one part of our total compensation package and is determined within a range", "The base pay range for this role is between $95,000 and $177,000 annualized, and your base pay will depend on your skills, qualifications, experience, and location", "You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition", "Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation"], "children": []}]}]}, {"data": "Google", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Embedded Software Engineer, Pixel Power Optimization", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://www.indeed.com/viewjob?jk=f3bca0f694bc177b", "children": []}]}, {"data": "job_description", "children": [{"data": "Note: By applying to this position you will have an opportunity to share your preferred working location from the following: Mountain View, CA, USA; Boulder, CO, USA; San Diego, CA, USA.\nMinimum qualifications:\n• Bachelor’s degree or equivalent practical experience.\n• 2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree.\n• 2 years of experience with data structures or algorithms.\n• 2 years of experience working with embedded operating systems focusing on power optimization.\n\nPreferred qualifications:\n• Master's degree or PhD in Computer Science or related technical field.\n• 2 years of experience working with embedded operating systems.\n• 2 years of experience with Linux kernel development around power management (e.g. system and runtime) and power optimization.\n• Experience developing accessible technologies.\n\nAbout the job\n\nGoogle's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n\nWith your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.\n\nThe Pixel Power Management Software team leads creating and supporting software solutions to manage, measure, and monitor Pixel device power along with detection, attribution, and mitigation of power issues to improve battery life for Pixel devices and by extension the Android ecosystem.\n\nThe Google Pixel team focuses on designing and delivering the world's most helpful mobile experience. The team works on shaping the future of Pixel devices and services through some of the most advanced designs, techniques, products, and experiences in consumer electronics. This includes bringing together the best of Google’s artificial intelligence, software, and hardware to build global smartphones and create transformative experiences for users across the world.\n\nThe US base salary range for this full-time position is $133,000-$194,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.\n\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.\n\nResponsibilities\n• Develop and support software solutions and tools for Pixel power management and power optimization.\n• Lead efforts in design, development and support for advanced power optimization software/firmware for Pixel Android Kernel, and prioritize optimization of power, latency, and system stability.\n• Contribute to Linux kernel development around power management and power optimization.\n• Develop and support test suites to detect power regression and system stability during power state transitions.\n• Improve observability of the hardware and subsystem power states to Android HAL.\n\nGoogle is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. See also Google's EEO Policy and EEO is the Law. If you have a disability or special need that requires accommodation, please let us know by completing our Accommodations for Applicants form.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-24T20:17:10.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["Bachelor’s degree or equivalent practical experience", "2 years of experience with software development in one or more programming languages, or 1 year of experience with an advanced degree", "2 years of experience with data structures or algorithms", "2 years of experience working with embedded operating systems focusing on power optimization", "We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["The US base salary range for this full-time position is $133,000-$194,000 + bonus + equity + benefits", "Our salary ranges are determined by role, level, and location"], "children": []}]}]}, {"data": "Intuit", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Software Engineer 2, Big Data", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://www.salary.com/job/intuit/software-engineer-2-big-data/j202302131824265282242?location=San%20Diego,%20CA", "children": []}]}, {"data": "job_description", "children": [{"data": "Overview\n\nThe Intuit Data Engineering team is looking for a Software Engineer 2, Big Data with a winning track record in Software Engineering and Distributed Systems. We’re using data in groundbreaking ways to uncover customer insights, personalize customer experiences through AI/ML, and provide a unified customer view across all Intuit products.\n\nNote: By applying to this position, your application is automatically submitted to the following locations: Mountain View, Los Angeles, San Diego and the following teams ([ Link removed ] - Click here to apply to Software Engineer 2, Big Data at Intuit.\n\nWhat you'll bring\n• 1-2 years professional Java coding experience\n• Experience writing SQL\n• Exposure to cloud technologies (nice to have): Aws or GCP or Azure\n• Strong CS fundamentals including data structures and algorithms\n• BS/MS in Computer Science or equivalent work experience\n• Bring your passion and a learning mindset!\n• Be collaborative!\n\nHow you will lead\n• Develop web services that make big data available in real-time for in-product applications.\n• Design and build scalable, best-in-class data products in close coordination with our engineering teams in other geographies\n• Customer empathy and delight will be the main drivers for success\n• Design end to end data pipelines given business and ops requirements (ingestion, processing and storage).\n• Conduct code reviews and build with a high level of quality\n• Focus on operational excellence through root cause analysis and continuous improvement. Ability to proactively follow issues through to resolution will be important.\n• Contribute to innovations that fuel the growth of Intuit around the world\n\nEOE AA M/F/Vet/Disability. Intuit will consider for employment qualified applicants with criminal histories in a manner consistent with requirements of local law.\n\nRecommended Skills\n• Application Development\n• Problem Solving\n• Information Technology\n• Operating Systems\n• Agile Software Development\n• Troubleshooting (Problem Solving)", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-02-15T00:00:00.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["1-2 years professional Java coding experience", "Experience writing SQL", "Exposure to cloud technologies (nice to have): Aws or GCP or Azure", "Strong CS fundamentals including data structures and algorithms", "BS/MS in Computer Science or equivalent work experience", "Bring your passion and a learning mindset!", "Be collaborative!", "Application Development", "Operating Systems", "Agile Software Development", "Troubleshooting (Problem Solving)"], "children": []}]}, {"data": "Benefits", "children": [{"data": "No benefits data available", "children": []}]}]}, {"data": "Google", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Senior Software Engineer, Firmware, Pixel", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://careers.google.com/jobs/results/77755006582694598-senior-software-engineer-firmware-pixel/?distance=50&page=7&q=Data%20Scientist%20Technical%20Lead", "children": []}]}, {"data": "job_description", "children": [{"data": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n\nWith your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.\n\nThe Google Pixel team focuses on designing and delivering the world's most helpful mobile experience. The team works on shaping the future of Pixel devices and services through some of the most advanced designs, techniques, products, and experiences in consumer electronics. This includes bringing together the best of Google’s artificial intelligence, software, and hardware to build global smartphones and create transformative experiences for users across the world.\n\nThe US base salary range for this full-time position is $139,000-$208,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.\n\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-13T16:30:49.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": "No Qualifications data available", "children": []}]}, {"data": "Benefits", "children": [{"data": ["The US base salary range for this full-time position is $139,000-$208,000 + bonus + equity + benefits", "Our salary ranges are determined by role, level, and location"], "children": []}]}]}, {"data": "Leidos", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Senior Software Engineer", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://careers.leidos.com/jobs/11947472-senior-software-engineer", "children": []}]}, {"data": "job_description", "children": [{"data": "Description\n\nLeidos is looking for a Senior Software Engineer to join a high performing agile team using the Scaled Agile Framework (SAFe) methodology to support a nationally significant and fast-paced cryptographic key management program. Program execution follows DEVOPS best practices and employs robust development, test, and production environments. Additionally, the program is using Behavioral Driven Development (BDD) and test automation tools alongside a full suite of team collaboration tools. Leidos is the prime contractor providing system engineering, development, test, integration, and operational support. This new program is focused on injecting new technology and adding advanced capabilities over the coming three years while continuing to support an on-going mission and operational system.\n\nJob Summary:\n\nThe selected individual will perform software development activities as a member of an agile development team. Development includes the full range of turning agile stories into implementable concepts, through development, testing, and deployment of the new capabilities in this complex system. Following the BDD pattern, our developers are responsible for implementing robust testing leveraging DEVOPS automation and, where appropriate, use of test automation commercial tools. There are a range of opportunities for server-side business logic implementation as well as client web application and user interface (UI) development. Java, Python, embedded C/C++, Java cryptographic framework, XML, web UI and special purpose device programming opportunities are available.\n• *Qualified candidates are eligible for enhanced incentives including up to a 20K cash sign on bonus or a paid time off bonus.\n\nPrimary Responsibilities:\n\nThe selected individual will be responsible for analyzing and resolving highly complex software issues related to multiple aspects and components of the system. He/she will collaborate with other experts within the program and in the user community to design, develop, and debug existing software, and to design and develop enhancements that incorporate new capabilities into various components of the existing systems. The candidate will provide technical leadership for software development activities as a member of an agile team and will actively participate in program increment planning and related team activities. The selected individual will perform high-level software development functions including design, development, troubleshooting, and debugging of software programs. He/she will analyze and system requirements and develop and maintain software infrastructures using Computer Aided Software Engineering (CASE) tools. The selected individual will be responsible for using sound software engineering principles to ensure that developed code is modifiable, efficient, reliable, understandable, fault tolerant, and reusable, including providing software process management and control throughout the coding portion of the software development process. The candidate will work with other Software Engineers and System Engineers in resolving complex technical issues and problems that impact multiple facets of the system.\n\nSecurity Clearance requirement:\n• Must have possess an active TS/SCI with Polygraph to be considered for this role.\n\nBasic Qualifications:\n• Bachelor’s degree in a technical discipline and a minimum of twelve (12) or more years of prior relevant software engineering/development experience.\n• Additional experience may be substituted for a Degree.\n• Specific experience with one or more of the following: Java/JEE, Python, C/C++, SQL, SOAP, WSDL, WADL\n• Experience with User Interface development, knowledge of databases and structures, and/or experience working with XHTML, HTML, XML, XSLT\n• Experience developing on Windows, and/or Linux operating systems\n• Experience with one or more of the following: Java, Python, PERL, PowerShell, VBS, Eclipse, Postgres, Oracle, Jenkins on a Windows platforms.\n• Must have a strong understanding of sound software development principles and practices\n• Must be able to plan and prioritize personal tasking and be able to communicate effectively verbally and in writing\n• Must be an independent thinker, capable of performing high quality work, both independently and with a team in a fast-moving environment\n\nPreferred Qualifications:\n• Experience with the following: JEE, SQL, application servers (Tomcat, WebLogic, JBoss), scripting\n• Experience with high level requirements management including requirements decomposition, secure systems engineering and development, trade-off analysis, interface control, and testing and continuous integration\n• 5+ years of experience in software development on Agile teams using Agile Developer practices such as Pair Programming, TDD, Refactoring, and ATDD\n• Experience with FITNesse, Mockito, Cucumber, Unified Functional Tester (UFT), Selenium\n• Experience with Behavior Driven Development (BDD) or Test-Driven Development (TDD)\n• Secure Software development (i.e. Layer 7 Policy)\n• Experience with the Scaled Agile Framework (SAFe) methodology, SAFe Agilest Certification, or experience as a member of an agile team\n\nCSSKEY\n\nCONMD\n\ncareers.leidos.com/CONMD\n\nPay Range:\nPay Range $118,300.00 - $182,000.00 - $245,700.00\n\nThe Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-11T20:42:34.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["Must have possess an active TS/SCI with Polygraph to be considered for this role", "Bachelor’s degree in a technical discipline and a minimum of twelve (12) or more years of prior relevant software engineering/development experience", "Additional experience may be substituted for a Degree", "Specific experience with one or more of the following: Java/JEE, Python, C/C++, SQL, SOAP, WSDL, WADL", "Experience with User Interface development, knowledge of databases and structures, and/or experience working with XHTML, HTML, XML, XSLT", "Experience developing on Windows, and/or Linux operating systems", "Experience with one or more of the following: Java, Python, PERL, PowerShell, VBS, Eclipse, Postgres, Oracle, Jenkins on a Windows platforms", "Must have a strong understanding of sound software development principles and practices", "Must be able to plan and prioritize personal tasking and be able to communicate effectively verbally and in writing", "Must be an independent thinker, capable of performing high quality work, both independently and with a team in a fast-moving environment", "Experience with the Scaled Agile Framework (SAFe) methodology, SAFe Agilest Certification, or experience as a member of an agile team"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["*Qualified candidates are eligible for enhanced incentives including up to a 20K cash sign on bonus or a paid time off bonus", "Pay Range $118,300.00 - $182,000.00 - $245,700.00", "The Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary"], "children": []}]}]}, {"data": "question", "children": [{"data": ["You have a 100 coins laying flat on a table, each with a head side and a tail side.  10 of them are heads up, 90 are tails up.  You can't feel, see or in any other way find out which side is up.  Split the coins into two piles such that there are the same number of heads in each pile.", "An array of 99 elements contains integers from 1 to 100 with one missing element. Find the missing element.", "Write some pseudo code to raise a number to a power.", "Given an array of numbers, replace each number with the product of all the\r\nnumbers in the array except the number itself *without* using division.\r\n", "How many unique handshakes if each person in a group of 10 give handshakes out to each and every other individual.\r\n(a) 100 (b) 50 (c) 45 (d) 20 (e) 10", "Suppose you have a matrix of numbers. How can you easily compute the sum of any rectangle (i.e. a range [row_start, row_end, col_start, col_end]) of those numbers? How would you code this?", "What sort would you use if you required tight max time bounds and wanted highly regular performance.", "What is a JavaScript callback function?", "Implement a binary tree and explain it's function", "Implement a method to determine whether a string is a palindrome."], "children": []}]}, {"data": "min_sal", "children": [{"data": 107763, "children": []}]}, {"data": "max_sal", "children": [{"data": 163291, "children": []}]}, {"data": "med_sal", "children": [{"data": 132653, "children": []}]}]}, {"data": "machine learning engineer_san diego", "children": [{"data": "Apple", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Realtime Video Processing and Machine Learning Engineer", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://www.ziprecruiter.com/c/Apple/Job/Realtime-Video-Processing-and-Machine-Learning-Engineer/-in-San-Diego,CA?jid=631017c339d13766", "children": []}]}, {"data": "job_description", "children": [{"data": "Summary Posted: Apr 17, 2023\nWeekly Hours: 40\nRole Number:200473900\n\nImagine what you could do here! At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you bring passion and dedication to your job? If so, we are looking for individuals like you. We are looking for talent who will join us to shape the future of video communication. Our team develops cutting edge technology and system that enable intelligent and interactive experience in Apple’s video communication products, such as FaceTime, Screen Share, Continuity Camera, AirPlay, CarPlay, Sidecar, etc. You will work closely with a group of highly motivated experts to develop exciting video communication and computer vision technologies that will make a huge impact in the products.\nKey Qualifications\n• Strong software development experience in one or more of the following: C, C++, Python\n• Solid understanding of fundamental theories and practices of video coding and processing\n• Industrial machine learning experience in image and video processing\n• Strong analytical, programming and debugging skills\n\nDescription\nAs a realtime video engineer in this role, you will be responsible for prototyping and developing new features, writing unit tests, contributing to architecture and algorithms design and development, performance analysis and optimization that will shape the future of video communications products at Apple. We are looking for a collaborative strong software engineer to join our team.\n\nEducation & Experience\nMS Electrical Engineering or MS Computer Science or equivalent\n\nAdditional Requirements\n\nPay & Benefits\n• At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $115,000 and $217,500, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-24T16:15:32.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["Strong software development experience in one or more of the following: C, C++, Python", "Solid understanding of fundamental theories and practices of video coding and processing", "Industrial machine learning experience in image and video processing", "Strong analytical, programming and debugging skills", "MS Electrical Engineering or MS Computer Science or equivalent"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["Pay & Benefits", "At Apple, base pay is one part of our total compensation package and is determined within a range", "The base pay range for this role is between $115,000 and $217,500, and your base pay will depend on your skills, qualifications, experience, and location", "Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs", "Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan", "You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition", "Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation"], "children": []}]}]}, {"data": "Logic20/20 Inc.", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Machine Learning Engineer", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://www.ziprecruiter.com/c/Logic20-20-Inc./Job/Machine-Learning-Engineer/-in-San-Diego,CA?jid=01d2984b967ce0df", "children": []}]}, {"data": "job_description", "children": [{"data": "Company Description\n\nWe're a seven-time Best Company to Work For, where intelligent, talented people come together to do outstanding work - and have a lot of fun while they're at it. Because we're a full-service consulting firm with a diverse client base, you can count on a steady stream of opportunities to work with cutting-edge technologies on projects that make a real difference. Logic20/20's Global Delivery Model creates a connected experience for Logicians across geographies. You'll have access to projects in different locations, the technology to support Connected Teams, and in-person and online culture events in our Connected Hub cities.\n\nJob Description\n\nAbout the Team\n\nThe Logic20/20 Advanced Analytics team combines data engineering, data science, and visual analytics to mitigate risk, optimize operations, and automate processes for the ultimate user experience. Our lean-in learning culture is focused on building expertise and delivering high-value solutions with real business impact across industries, whether they are leveling up or blazing a trail.\n\n\"We build an environment where we really operate as One Team, building up each other's careers and capabilities.\" - Adam Cornille, Senior Director, Advanced Analytics\n\nAbout You\n\nLogic20/20 is seeking a Machine Learning Engineer to lead and support a team at one of the nation's top utilities companies on the west coast that is working on RSE calculations and improvement. This is an exciting opportunity to make an impact by leveraging AI and ML techniques to create production-level systems through the application of machine learning models.\n\nQualifications\n\nMust have:\n• 5+ years of experience building and deploying machine learning models to production in a cloud environment\n• 3+ years of hands-on Python experience\n• Strong experience with Terraform, Ansible, CloudFormation, Basel or Puppet\n• Ability to build CI/CD pipelines\n• Knowledge of professional enterprise software development and practices including software lifecycle, best coding practices, version control, architecture, testing and deployment\n\nPreferred:\n• Experience working in the Utilities industry\n• Master's degree/PhD in computer science or related field\n\nAdditional Information\n\nAll your information will be kept confidential according to EEO guidelines.\n\nCompensation range: $130,000 - $200,000, depending on experience\n\nAbout Logic20/20\n\nTo learn more about Logic20/20, please visit: https://www.logic2020.com/careers/life-at-logic\n\nCore Values\n\nAt Logic20/20, we are guided by three core values: Drive toward Excellence, Act with Integrity & Foster a Culture of We. These values were generated and agreed upon by our employees-and they help us pursue our goal of being one of the best companies to work for and to work with. Learn more at https://www.logic2020.com/company/our-values.\n\nLogic20/20 Benefits\n\nWhy Logic20/20? It's our goal to be one of the best companies to work for. One piece of the puzzle is an evolving set of benefits that extend past medical, dental, and 401(k).\n\nYou will have\n• Career Development - A built-in program from day 1, providing a mentor and individually-directed training opportunities, plus access to leaders across the company\n• PTO, Paid Holidays, & Voluntary Leave - Worry-free time off to recharge and pursue your personal goals\n• Community & Committees - As part of our \"Culture of We,\" Logic20/20 invests in providing many social, interest, and learning opportunities\n• Recognition - From peer recognition, swag, and the chance to win a once-in-a-lifetime type of award, we make your Logic20/20 journey stand out\n• Referral Programs & Bonuses - Employee, project, and sales referral programs with paid incentives\n\nEqual Opportunity Statement\n\nWe believe that people should be celebrated: for their talents, ideas, and skills, but most of all, for what makes them unique. We prohibit harassment and/or discrimination based on age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status, or any other basis as protected by federal, state, or local law.\n\nTo learn more about our DE&I initiatives, please visit: https://www.logic2020.com/company/diversity-equity-inclusion\n\nPrivacy Policy\n\nDuring the recruitment and hiring process, we gather, process, and store some of your personal data. We consider data privacy a priority. For further information, please view our company privacy policy.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-19T00:00:00.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["5+ years of experience building and deploying machine learning models to production in a cloud environment", "3+ years of hands-on Python experience", "Strong experience with Terraform, Ansible, CloudFormation, Basel or Puppet", "Ability to build CI/CD pipelines", "Knowledge of professional enterprise software development and practices including software lifecycle, best coding practices, version control, architecture, testing and deployment"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["Compensation range: $130,000 - $200,000, depending on experience", "Career Development - A built-in program from day 1, providing a mentor and individually-directed training opportunities, plus access to leaders across the company", "PTO, Paid Holidays, & Voluntary Leave - Worry-free time off to recharge and pursue your personal goals", "Community & Committees - As part of our \"Culture of We,\" Logic20/20 invests in providing many social, interest, and learning opportunities", "Recognition - From peer recognition, swag, and the chance to win a once-in-a-lifetime type of award, we make your Logic20/20 journey stand out", "Referral Programs & Bonuses - Employee, project, and sales referral programs with paid incentives"], "children": []}]}]}, {"data": "CoreLogic", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Senior Machine Learning Engineer", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://www.ziprecruiter.com/c/CoreLogic/Job/Senior-Machine-Learning-Engineer/-in-San-Diego,CA?jid=dfa42ad7b61dc8a0", "children": []}]}, {"data": "job_description", "children": [{"data": "Job Summary:\n\nJoin our team of over 5,000 employees globally, who provide the insights through data and next generation technology that help millions of people find, buy and protect the homes they love. From the beginning, CoreLogic has been driven by a single purpose - to innovate and create solutions that solve our clients' toughest challenges in the housing market. CoreLogic is the trusted source for property intelligence, with deep knowledge of powerful economic, social, and environmental forces that promote healthy housing markets and thriving communities.\n\nWe apply that same dedication to creating a diverse and inclusive work culture that inspires innovation and bold thinking. A place where individuals can work on small teams, feel valued, and directly impact the real estate industry. We believe our team members are the best in the business, and we will continue to recruit, retain, develop and reward our most important asset - our people!\n\nJob Description:\n\nAs a member of CoreLogic's Science and Machine Learning Engineering team you will participate in building models for the global real estate market. This position will allow you to work with other machine learning engineers to create new models using a variety of machine learning techniques and technologies on Google Cloud Platform.\n\nJob Responsibilities:\n• Work with product managers, machine learning engineers, and data science modelers to bring new models and enhancements to existing models to production\n• Work with product managers and machine learning engineers to understand and document the technical requirements for the systems that will run models\n• Estimate the effort required to implement new models or modify existing models\n• Architect/design the software environments needed to both build and run the models on Google Cloud Platform\n• Design and implement the software used to acquire and transform the data for use in the models\n• Works with other engineering teams to integrate the models into CoreLogic's products\n• Employ agile methodologies and practices leading or participating on teams of machine learning engineers\n• Monitor and report to management on the status of project efforts, anticipate/identify issues that inhibit the attainment of project goals, and implement corrective actions\n• Foster and maintain good relationships with customers and other teams within CoreLogic to meet expected delivery dates and service levels\n\nJob Qualifications:\n• Bachelor's degree in Computer Science, Computer Engineering, Data Science, or Machine Learning\n• 5 or more years of experience with software development\n• Experience designing system architectures and applications in cloud-based environments\n• Experience with distributed parallel computing\n• Fluent in Python\n• Knowledge and experience with SQL\n• Good Linux shell scripting skills\n• Knowledge and experience with Google Cloud Platform, Cloud Dataflow/Beam, Kubernetes, Docker, Pub/Sub, BigQuery, Dataproc/Spark, or similar technologies on AWS or Azure.\n• Knowledge and experience with Terraform and Ansible\n• Knowledge and experience with Jenkins\n• Good source code management disciple with experience using Git\n• Experience writing automated unit tests\n• Working knowledge of statistics\n• Knowledge and experience with machine learning techniques and tools\n• Strong written and verbal communication skills\n• Experience with iterative agile development methodology\n\nPreferred Qualifications:\n• Master's degree in Data Science or Machine Learning\n\nAnnual Pay Range:\n106,900 - 145,000 USD\n\nCoreLogic benefits information can be found here: http://www.yourcorebenefits.com/. Qualifications, locations and experience of the individual ultimately selected for the position may impact the final actual offered compensation, which may vary from any posted range.\n\nCoreLogic's Diversity Commitment:\n\nCoreLogic is fully committed to employing a diverseworkforce and creating an inclusive workenvironment that embraces everyone's uniquecontributions, experiences and values. We offer anempowered work environment that encouragescreativity, initiative and professional growth andprovides a competitive salary and benefits package. We are better together when we support and recognize our differences.\n\nEOE AA M/F/Veteran/Disability:\n\nCoreLogic is an Equal Opportunity/Affirmative Actionemployer committed to attracting and retaining thebest-qualified people available, without regard torace, color, religion, national origin, gender, sexualorientation, gender identity, age, disability or statusas a veteran of the Armed Forces, or any other basisprotected by federal, state or local law. CoreLogicmaintains a Drug-Free Workplace.\n\nPlease apply on our website for consideration.\n\nPrivacy Policy - http://www.corelogic.com/privacy.aspx\n\nBy providing your telephone number, you agree to receive automated (SMS) text messages at that number from CoreLogic regarding all matters related to your application and, if you are hired, your employment and company business. Message & data rates may apply. You can opt out at any time by responding STOP or UNSUBSCRIBING and will automatically be opted out company-wide.\n\nConnect with us on social media! Click on the quicklinks below to find out more about our company and associates.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-24T01:10:47.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["Bachelor's degree in Computer Science, Computer Engineering, Data Science, or Machine Learning", "5 or more years of experience with software development", "Experience designing system architectures and applications in cloud-based environments", "Experience with distributed parallel computing", "Fluent in Python", "Knowledge and experience with SQL", "Good Linux shell scripting skills", "Knowledge and experience with Google Cloud Platform, Cloud Dataflow/Beam, Kubernetes, Docker, Pub/Sub, BigQuery, Dataproc/Spark, or similar technologies on AWS or Azure", "Knowledge and experience with Terraform and Ansible", "Knowledge and experience with Jenkins", "Good source code management disciple with experience using Git", "Experience writing automated unit tests", "Working knowledge of statistics", "Knowledge and experience with machine learning techniques and tools", "Strong written and verbal communication skills", "Experience with iterative agile development methodology"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["106,900 - 145,000 USD"], "children": []}]}]}, {"data": "ResMed", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Senior Machine Learning Engineer", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://us.jora.com/job/Senior-Machine-Learning-Engineer-a217992f121c626175db297c9dbb8e2f", "children": []}]}, {"data": "job_description", "children": [{"data": "Digital Health Technology team powers digital experiences and engagement to enhance the lives of millions of people every day through connected care. We build, deliver and manage a portfolio of data management platforms and mobile offerings in support of our core businesses. We thrive on simple and elegant architecture and agility. You’ll be immersed in a dynamic high-growth environment and empowered to excel, take informed risks, and drive ingenuity across the enterprise.\n\nLet’s talk about the team:\n\nThe Data Science and AI/ML team collaborates across the organization to identify, develop and deliver Artificial Intelligence (AI) and Machine Learning (ML) powered software solutions that improve patient outcomes, delight our partners and customers, and improve the way we do business in an “AI First” fashion. On any given day, the team could be working on building sophisticated models to delivering personalized recommendations to patients to improve their sleep, identify optimal equipment and settings using our unparalleled store of billion+ nights of sleep data, proactively identify other health risk factors, or help optimize complex, global supply chain operations.\n\nAs a Machine Learning Engineer, your key responsibilities include building automation and leading-edge architecture around model development, deployment, and serving to optimize time to market and quality of AI/ML applications. Specifically, you will give architectural guidance to ensure our global AI/ML systems are production-grade, scalable and use the latest state of the art technology and methodology. You will help define and ensure best coding practices within the team of excellent and engaged engineers. You will be given creative freedom and opportunities to work on advanced AI/ML problems, such as reinforcement learning and a self-serve AI/ML platform. You will do hands-on code development, mentor junior team members, and interact with business stakeholders.\n\nThis is a hybrid role based out of our San Diego office (9001 Spectrum Center Blvd, San Diego, CA 92123). We are only considering candidates that reside in the San Diego area at this time.\n\nLet's talk about the role:\n• You will work closely with other stakeholders from Product Management, Engineering, and other business stakeholders to create impactful, intelligent features and products.\n• You will collaborate closely with other team members including Data Scientists and Data Engineers and “own” the end to end process.\n• You will be given wide authority to develop creative model-based solutions but will also be held to high quality and accountability standards.\n• You will thoroughly and diligently document the model design, experiments, tests, validations, and live metrics and outcomes, typically on Confluence. You may be asked to write documents for use in the preparation of intellectual property and technical publications.\n• Build and maintain optimal global AI/ML architectures.\n• Stay informed of industry trends and enable successful AI/ML solutions by leveraging best practices.\n• Participate in and set up Proof of Concepts (POCs) to demonstrate proposed solutions.\n• Identify, design, and implement internal process improvements: Automating manual processes, re-designing infrastructure for greater scalability, etc.\n• Build infrastructure needed for AI/ML systems, such as model inference, automated (re-)training etc.\n• Work with stakeholders including the Executive, Product, Data and Design teams to help with AI/ML-related technical issues and support their AI/ML infrastructure needs.\n• Actively handle escalated incidents to resolution and suggest solutions to limit future exposure.\n• Participate in Code Review and process improvement.\n• You will mentor and train more junior team members.\n\nLet's talk about you:\n• 2+ years’ of industry experience\n• M.S or PhD in Data Science/Machine Learning or closely related areas such as Computer Science, Operations Research, Applied Statistics, and Biomedical Informatics.\n• Deep grounding in machine learning techniques including regression methods (linear, logistic, lasso, support vector, etc.), classification (tree-based models such as XGBoost and Random Forest, Neural Networks, Deep Learning – CNN, RNN, LSTM, etc.), as well as knowledge of clustering and unsupervised learning, time series forecasting and optimization methods.\n• Solid foundation with development of data analytics systems, including data exploration/crawling, feature engineering, model building, performance evaluation, and online deployment of models.\n• Hands-on experience in handling large and distributed datasets on Hadoop, Spark, Hive, etc.\n• Experience with AWS or other cloud-based tools and technologies for data pipelining, model development and deployment.\n• Experience building scalable AI/ML systems for continuous training automation, computer vision, natural language processing, or similarly advanced AI/ML problems.\n• Experience with one or more of the following AWS (Amazon Web Services) cloud services: SageMaker, ECR/EC2 and Docker, AWS Batch processing, Lambda, Glue, EventBridge, etc.\n• Experience with AI/ML operational tools such as Airflow, MLFlow, H2O, etc.\n• Experience with relational SQL and NoSQL databases.\n• Experience with developing production-grade Python code.\n\nWe are shaping the future at ResMed, and we recognize the need to build on and broaden our existing skills and continue to attract and retain the world’s best talent. We work hard to offer holistic benefits packages, provide flexible work arrangements, cultivate a workforce culture that allows employees to grow personally and professionally, and deliver competitive salaries to our team members. Employees scheduled to work 30 or more hours per week are eligible for benefits. This position qualifies for the following benefits package: comprehensive medical, vision, dental, and life, AD&D, short-term and long-term disability insurance, sleep care management, Health Savings Account (HSA), Flexible Spending Account (FSA), commuter benefits, 401(k), Employee Stock Purchase Plan (ESPP), Employee Assistance Program (EAP), and tuition assistance. Employees accrue fifteen days Paid Time Off (PTO) in their first year of employment, receive 11 paid holidays plus 3 floating days and are eligible for 14 weeks of primary caregiver or two weeks of secondary caregiver leave when welcoming new family members. Individual pay decisions are based on a variety of factors, such as the candidate’s geographic work location, relevant qualifications, work experience, and skills. At ResMed, it is not typical for an individual to be hired at or near the top of the range for their role and compensation decisions are dependent on the facts and circumstances of each case. A reasonable estimate of the current range for this position is:\n\n$126,000 -190,000\n\nSubject to the absolute discretion of the company, this role may be eligible to receive stock equity based on company, business unit, and/or individual performance. This role is eligible to receive an annual cash bonus payment based on company, business unit, and/or individual performance.\n\n#LI-BV1\n\n#LI-Hybrid\n\nJoining us is more than saying “yes” to making the world a healthier place. It’s discovering a career that’s challenging, supportive and inspiring. Where a culture driven by excellence helps you not only meet your goals, but also create new ones. We focus on creating a diverse and inclusive culture, encouraging individual expression in the workplace and thrive on the innovative ideas this generates. If this sounds like the workplace for you, apply now!", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-20T08:12:00.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["2+ years’ of industry experience", "M.S or PhD in Data Science/Machine Learning or closely related areas such as Computer Science, Operations Research, Applied Statistics, and Biomedical Informatics", "Deep grounding in machine learning techniques including regression methods (linear, logistic, lasso, support vector, etc.), classification (tree-based models such as XGBoost and Random Forest, Neural Networks, Deep Learning – CNN, RNN, LSTM, etc.), as well as knowledge of clustering and unsupervised learning, time series forecasting and optimization methods", "Solid foundation with development of data analytics systems, including data exploration/crawling, feature engineering, model building, performance evaluation, and online deployment of models", "Hands-on experience in handling large and distributed datasets on Hadoop, Spark, Hive, etc", "Experience with AWS or other cloud-based tools and technologies for data pipelining, model development and deployment", "Experience building scalable AI/ML systems for continuous training automation, computer vision, natural language processing, or similarly advanced AI/ML problems", "Experience with one or more of the following AWS (Amazon Web Services) cloud services: SageMaker, ECR/EC2 and Docker, AWS Batch processing, Lambda, Glue, EventBridge, etc", "Experience with AI/ML operational tools such as Airflow, MLFlow, H2O, etc", "Experience with relational SQL and NoSQL databases", "Experience with developing production-grade Python code"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["We work hard to offer holistic benefits packages, provide flexible work arrangements, cultivate a workforce culture that allows employees to grow personally and professionally, and deliver competitive salaries to our team members", "Employees scheduled to work 30 or more hours per week are eligible for benefits", "This position qualifies for the following benefits package: comprehensive medical, vision, dental, and life, AD&D, short-term and long-term disability insurance, sleep care management, Health Savings Account (HSA), Flexible Spending Account (FSA), commuter benefits, 401(k), Employee Stock Purchase Plan (ESPP), Employee Assistance Program (EAP), and tuition assistance", "Employees accrue fifteen days Paid Time Off (PTO) in their first year of employment, receive 11 paid holidays plus 3 floating days and are eligible for 14 weeks of primary caregiver or two weeks of secondary caregiver leave when welcoming new family members", "This role is eligible to receive an annual cash bonus payment based on company, business unit, and/or individual performance"], "children": []}]}]}, {"data": "Trulioo", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Senior Machine Learning Engineer", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://simplify.jobs/p/3cab5270-245d-4e3e-ba7b-84bd60f1b7a6/Senior-Machine-Learning-Engineer", "children": []}]}, {"data": "job_description", "children": [{"data": "At Trulioo, we build and connect digital identity networks around the globe, and this framework of trust empowers businesses to assess the various risks associated with digital identities. Our mission is to build trust online. Digital services hold the promise of allowing anyone to interact and transact with anyone, anywhere. However, the threat of bad actors gets in the way of our connectedness; the global village only works if we trust each other.\n\nWe are a Silicon Valley-funded tech company solving the problems of trust and safety online. To realize that goal we’ve built the world’s leading identity verification platform, enabling instant verification of 5 billion people and 330 million businesses in more than 195 countries. With offices in Vancouver, San Diego, Austin, Dublin, Copenhagen, and Singapore, we’ve fostered a world class team committed to building trust online. Our competitive advantage is, and always will be, our people. At Trulioo, we truly believe “everyone is someone” and we invite you to join our mission and celebrate the positive change we are making in the world.\n\nPosition Summary\n\nIn your role as Machine Learning Engineer, you are responsible for designing, implementing, and maintaining Machine Learning solutions for automated identity verification such as document verification, biometric authentication, and fraud detection. You play a key role in architecting a pipeline for efficient production and development of novel Machine Learning models and refining these models and processes to bring industry leading performance within a modern production environment. You will be driving continuous improvements of systems that use Deep Learning, Computer Vision, and related technologies within a machine learning development lifecycle.\n\nWhat you’ll be doing:\n• Leading development of cutting-edge Machine Learning solutions for Document Verification using modern deep learning frameworks and tools.\n• Innovating creative and practical solutions to advance the Machine Learning technology identity verification products.\n• Developing tools and scripts to analyze and process data to identify and troubleshoot bottlenecks in model performance.\n• Collaborating with team members for project planning and establishing best practices for ML development lifecycle.\n\nYou have:\n• A strong familiarity with various Machine Learning algorithms and techniques.\n• Experience with application of modern deep convolutional networks and transformer networks for computer vision tasks.\n• Extensive experience using Tensorflow or Pytorch to develop novel deep learning architectures on multi-GPU computing environments.\n• Deep knowledge of probability, statistics, and related algorithms.\n• Familiarity with various computer vision applications such as object detection, semantic segmentation, optical character recognition, and image generation.\n• Strong interest and drive to research, brainstorm, and develop new ideas for existing and future services that will be deployed to production.\n\nEducation and Experience:\n• A BS degree or higher in data science, computer science, engineering or other STEM field, or a comparable combination of education, training, and experience.\n• Experience in Python and/or other programming languages.\n• Minimum 4 years of experience as a Machine Learning Engineer\n\nPay Transparency\n\nTo provide greater transparency to candidates we share the base pay ranges for all US-based job postings. We set standard base pay rates for all roles based on function, level and location, benchmarked against similar stage growth companies. Additionally, Trulioo offers a wide range of benefits to US-based employees including medical, dental, and vision insurance, 401k program with employer match, education & training reimbursement and parental leave.\n\nThe anticipated base salary range for this position is $80,000-$150,000 for California residents. The listed range is meant to reflect an expected salary range for the position in question based upon market data and other factors, all which are subject to change. Final offer amounts are determined by multiple factors including but not limited to location, skills, depth of work experience and/or relevant licensing/credentials.\n\nWorking at Trulioo\n\nYou will be challenged to achieve, develop, and grow as part of a hyper-growth company.\n\nWe offer you the opportunity to make a difference and create a better world by revolutionizing how technology, trust, and identity intersect online. We are on a mission to make sure no one is left behind and everyone has the opportunity to participate fully in the modern digital economy. In order to do this well, diversity and inclusion have always been fundamental to our mission, our culture and our life. Trulioo is proud to be an equal opportunity employer and our commitment to inclusion across race, gender, age, religion, identity and experience connects us with the customers and communities we serve, attracting top talent and passionate changemakers across the globe. Our mission matters – for billions of people everywhere.\n\nThe diverse experiences, ideas, and identities of Trulioo’s team members help us make better decisions and drive great results. We foster an inclusive work environment that welcomes team members of all backgrounds and perspectives.\n\nWe’re committed to providing a meaningful environment for every member of our team. We hire exceptional people and reward them with trust, autonomy, mentorship, and the freedom to grow into their roles.\n\nYou are naturally curious, invest time to better understand complex concepts and have strong attention to detail. You love working in a team where trust is key and want to make an impact everyday. If this sounds like you, please apply and come work with us.\n\nStudies show that minorities and members of underrepresented groups apply for jobs only if they meet 100% of the qualifications. Trulioo encourages everyone interested in a role to apply. We look forward to your application!\n\nPrivacy Notice\n\nTrulioo collects, processes, and discloses personal data solely for the purposes reasonably required to establish, manage, or terminate an employment relationship. This includes:\n• your name and contact details, including email and phone number; and\n• details of your qualifications, skills, and relevant experience.\n\nTrulioo believes the information in this publication is accurate as of its publication date. The information contained in this publication is subject to change without notice.\n\nTHE INFORMATION IN THIS PUBLICATION IS PROVIDED “AS IS.” TRULIOO INFORMATION SERVICES MAKES NO REPRESENTATIONS OR WARRANTIES OF ANY KIND WITH RESPECT TO THE INFORMATION IN THIS PUBLICATION AND SPECIFICALLY DISCLAIMS IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE.\n\nNo part of this document may be reproduced without the express written consent of Trulioo Information Services Inc.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-19T00:00:00.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["A strong familiarity with various Machine Learning algorithms and techniques", "Experience with application of modern deep convolutional networks and transformer networks for computer vision tasks", "Extensive experience using Tensorflow or Pytorch to develop novel deep learning architectures on multi-GPU computing environments", "Deep knowledge of probability, statistics, and related algorithms", "Familiarity with various computer vision applications such as object detection, semantic segmentation, optical character recognition, and image generation", "Strong interest and drive to research, brainstorm, and develop new ideas for existing and future services that will be deployed to production", "A BS degree or higher in data science, computer science, engineering or other STEM field, or a comparable combination of education, training, and experience", "Experience in Python and/or other programming languages", "Minimum 4 years of experience as a Machine Learning Engineer", "You are naturally curious, invest time to better understand complex concepts and have strong attention to detail", "You love working in a team where trust is key and want to make an impact everyday"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["To provide greater transparency to candidates we share the base pay ranges for all US-based job postings", "We set standard base pay rates for all roles based on function, level and location, benchmarked against similar stage growth companies", "Additionally, Trulioo offers a wide range of benefits to US-based employees including medical, dental, and vision insurance, 401k program with employer match, education & training reimbursement and parental leave", "The anticipated base salary range for this position is $80,000-$150,000 for California residents", "The listed range is meant to reflect an expected salary range for the position in question based upon market data and other factors, all which are subject to change"], "children": []}]}]}, {"data": "NanoCellect Biomedical", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Machine Learning Engineer at NanoCellect Biomedical in San Diego, CA", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://sandiego-ca.geebo.com/jobs-online/view/id/1048013538-machine-learning-engineer-at-/", "children": []}]}, {"data": "job_description", "children": [{"data": "Company Overview NanoCellect's mission is to facilitate breakthrough biomedical discoveries by making cell sorting and analysis technology more portable, affordable, and easy-to-use. We use microfluidics to make flow cytometers that enable biomedical scientists to analyze and sort cells required for drug discovery, and basic research. NanoCellect's proprietary software is a key component of its products and is critical to the company's success. Job Summary We are seeking a highly motivated individual to join a team of researchers, engineers, and scientists as a Machine Learning Engineer. This person should thrive in a fast-paced collaborative and interdisciplinary environment and be a self-motivated, results-driven individual ready to expand a revolutionary platform for real-time cell analysis and isolation. Responsibilities and Duties Assist with the development of our model training and evaluation infrastructure. Work closely with data scientists to experiment on model architectures and take them to production. Build, maintain, and improve data processing pipelines that process billions of data points and petabytes of data. Work in an interdisciplinary team composed of electrical engineers, firmware engineers, biologists, and software engineers to help solve hard problems which improve biological research. Qualifications and Skills Bachelor's in Computer Science or Data Science or equivalent professional experience 2\nyears of software development experience Expertise in working with at least one deep learning framework, such as PyTorch, TensorFlow, Caffe Experienced in data visualization and image processing Strong analytical and problem-solving skills Be able and open to pick up new skills, work with 3rd party technologies and devices Maintain a high degree of ethical standard and trustworthiness Strong technical written and communication skills On-site position. Work from home as appropriate Proficient in Python, experienced in GPU acceleration is a plus Familiar with computer vision deep learning models and image processing algorithms Experienced in deep learning model deployment and maintenance workflow Experienced in cloud providers such as GCP or AWS Experienced in working with ETL pipelines A track record for delivering Machine Learning projects for a product Strong proactive communication, natural curiosity. Ambition to apply skills to a wide variety of fields Benefits and Perks Unlimited PTO Competitive Medical, Dental, Vision coverage, FSA, Life Insurance and LTD 401K with company match Professional development Casual dress code, free snacks, free onsite gym access Cohesive team environment Great potential for growth\nSalary Range:\n$80K -- $100K\nMinimum Qualification\nData Science & Machine Learning, Software DevelopmentEstimated Salary: $20 to $28 per hour based on qualifications.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-24T00:00:00.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["Qualifications and Skills Bachelor's in Computer Science or Data Science or equivalent professional experience 2", "years of software development experience Expertise in working with at least one deep learning framework, such as PyTorch, TensorFlow, Caffe Experienced in data visualization and image processing Strong analytical and problem-solving skills Be able and open to pick up new skills, work with 3rd party technologies and devices Maintain a high degree of ethical standard and trustworthiness Strong technical written and communication skills On-site position"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["Ambition to apply skills to a wide variety of fields Benefits and Perks Unlimited PTO Competitive Medical, Dental, Vision coverage, FSA, Life Insurance and LTD 401K with company match Professional development Casual dress code, free snacks, free onsite gym access Cohesive team environment Great potential for growth", "$80K -- $100K"], "children": []}]}]}, {"data": "Booz Allen Hamilton", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Machine Learning Engineer, Lead", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://careers.boozallen.com/jobs/JobDetail/San-Diego-Machine-Learning-Engineer-Lead-R0156695/69561", "children": []}]}, {"data": "job_description", "children": [{"data": "Machine Learning Engineer, Lead\n\nThe Opportunity:\n\nAs an experienced engineer, you know that machine learning is critical to understanding and processing massive datasets. Your ability to conduct statistical analyses on business processes using Machine Learning (ML) techniques makes you an integral part of delivering a customer-focused solution. We need your technical knowledge and desire to problem-solve to support DoD and Federal Agencies. As an ML Engineer on our Global Defense team, you’ll train, test, deploy, and maintain models that learn from data.\n\nIn this role, you’ll lead the direction of mission-critical solutions by applying best-fit ML algorithms and introducing leading-edge technologies. You’ll share your knowledge with a large community of ML Engineers across the firm and collaborate with data engineers, data scientists, solutions architects, and product owners to deliver world class solutions to deliver mentorship, training, and solutions to real world problems. Your advanced consulting skills and extensive technical expertise will guide clients as they navigate the landscape of ML algorithms, tools, and frameworks.\n\nJoin us. The world can’t wait.\n\nYou Have: \n• 4+ years of experience with ML and data science\n• 2+ years of experience implementing, testing, and fielding automation for artificial intelligence and ML solutions\n• 2+ years of experience in a management or advisory role\n• Experience with scripting languages, including Python, R, or Scala\n• Experience with ML frameworks, including Keras, TensorFlow, or PyTorch\n• Experience with Containerization and Kubernetes\n• Experience facing clients and requirements gathering\n• Ability to obtain a security clearance\n• Bachelor's degree\n\nNice If You Have: \n• Experience working in Kanban and Agile development processes\n• Experience with Apache Spark and big data technologies\n• Experience with cloud services, including AWS, Azure, or GCP\n• Experience with Git and collaboration tools, including Jenkins, JIRA, Confluence, Nexus, or Bitbucket\n• Master's degree\n\nClearance: \n\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information.\n\nCreate Your Career:\n\nGrow With Us\n\nYour growth matters to us—that’s why we offer a variety of ways for you to develop your career. With professional and leadership development opportunities like upskilling programs, tuition reimbursement, mentoring, and firm-sponsored networking, you can chart a unique and fulfilling career path on your own terms.\n\nA Place Where You Belong\n\nDiverse perspectives cultivate collective ingenuity. Booz Allen’s culture of respect, equity, and opportunity means that, here, you are free to bring your whole self to work. With an array of business resource groups and other opportunities for connection, you’ll build your community in no time.\n\nSupport Your Well-Being\n\nOur comprehensive benefits package includes wellness programs with HSA contributions, paid holidays, paid parental leave, a generous 401(k) match, and more. With these benefits, plus the option for flexible schedules and remote and hybrid locations, we’ll support you as you pursue a balanced, fulfilling life—at work and at home.\n\nYour Candidate Journey\n\nAt Booz Allen, we know our people are what propel us forward, and we value relationships most of all. Here, we’ve compiled a list of resources so you’ll know what to expect as we forge a connection with you during your journey as a candidate with us.\n\nCompensation\n\nAt Booz Allen, we celebrate your contributions, provide you with opportunities and choices, and support your total well-being. Our offerings include health, life, disability, financial, and retirement benefits, as well as paid leave, professional development, tuition assistance, work-life programs, and dependent care. Our recognition awards program acknowledges employees for exceptional performance and superior demonstration of our values. Full-time and part-time employees working at least 20 hours a week on a regular basis are eligible to participate in Booz Allen’s benefit programs. Individuals that do not meet the threshold are only eligible for select offerings, not inclusive of health benefits. We encourage you to learn more about our total benefits by visiting the Resource page on our Careers site and reviewing Our Employee Benefits page.\n\nSalary at Booz Allen is determined by various factors, including but not limited to location, the individual’s particular combination of education, knowledge, skills, competencies, and experience, as well as contract-specific affordability and organizational requirements. The projected compensation range for this position is $121,200.00 to $275,000.00 (annualized USD). The estimate displayed represents the typical salary range for this position and is just one component of Booz Allen’s total compensation package for employees.\n\nWork Model\nOur people-first culture prioritizes the benefits of flexibility and collaboration, whether that happens in person or remotely.\n• If this position is listed as remote or hybrid, you’ll periodically work from a Booz Allen or client site facility.\n• If this position is listed as onsite, you’ll work with colleagues and clients in person, as needed for the specific role.\n\nEEO Commitment\n\nWe’re an equal employment opportunity/affirmative action employer that empowers our people to fearlessly drive change – no matter their race, color, ethnicity, religion, sex (including pregnancy, childbirth, lactation, or related medical conditions), national origin, ancestry, age, marital status, sexual orientation, gender identity and expression, disability, veteran status, military or uniformed service member status, genetic information, or any other status protected by applicable federal, state, local, or international law.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2022-11-02T00:00:00.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["We need your technical knowledge and desire to problem-solve to support DoD and Federal Agencies", "4+ years of experience with ML and data science", "2+ years of experience implementing, testing, and fielding automation for artificial intelligence and ML solutions", "2+ years of experience in a management or advisory role", "Experience with scripting languages, including Python, R, or Scala", "Experience with ML frameworks, including Keras, TensorFlow, or PyTorch", "Experience with Containerization and Kubernetes", "Experience facing clients and requirements gathering", "Ability to obtain a security clearance", "Bachelor's degree", "Experience working in Kanban and Agile development processes", "Experience with Apache Spark and big data technologies", "Experience with cloud services, including AWS, Azure, or GCP", "Experience with Git and collaboration tools, including Jenkins, JIRA, Confluence, Nexus, or Bitbucket", "Master's degree"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["With professional and leadership development opportunities like upskilling programs, tuition reimbursement, mentoring, and firm-sponsored networking, you can chart a unique and fulfilling career path on your own terms", "Our comprehensive benefits package includes wellness programs with HSA contributions, paid holidays, paid parental leave, a generous 401(k) match, and more", "With these benefits, plus the option for flexible schedules and remote and hybrid locations, we’ll support you as you pursue a balanced, fulfilling life—at work and at home", "At Booz Allen, we celebrate your contributions, provide you with opportunities and choices, and support your total well-being", "Our offerings include health, life, disability, financial, and retirement benefits, as well as paid leave, professional development, tuition assistance, work-life programs, and dependent care", "The projected compensation range for this position is $121,200.00 to $275,000.00 (annualized USD)"], "children": []}]}]}, {"data": "LEIDOS", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Machine Learning Signal Processing Engineer", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://jobs.fox5sandiego.com/jobs/machine-learning-signal-processing-engineer-la-jolla-california/985673153-2/", "children": []}]}, {"data": "job_description", "children": [{"data": "Description\n\nJob Description:\n\nToday, Electronic Warfare (EW) is a growing enterprise - protecting the warfighter and our national security against ever-adapting threats. The Leidos Innovations Center (LInC) at Leidos currently has an opening for a Signal Processing Engineer to support EW programs in Arlington, VA or San Diego, CA.\n\nAs part of our team, you will work on programs that improve the robustness and efficacy of sensors and signals in complex environments. More broadly, you will help advance the state-of-the-art in research and advanced applications to support ongoing and future EW programs. Simultaneously, you will work alongside scientists and experts in these fields to grow your own knowledge and career while mentoring junior level engineers and leading tasks.\n\nRegular tasks will include:\n\n- Develop, model, and test algorithms in Matlab, Simulink, or C++\n\n- Analyze results from simulation or real data to identify root causes and trends\n\n- Develop novel and advanced signal processing/machine learning algorithms, performance simulation, and analysis - using simulated and real data in both time series and spectral domains\n\n- Leverage state-of-the-art AI/ML tools and methodologies to improve algorithms performance\n\n- Participate in lab-based and field testing\n\n- Support marketing and business development initiatives\n\n- Engage in multiple projects, interacting with Customers as well\n\nRequired Qualifications:\n\n- Must be U.S. Citizen\n\n- Active Secret clearance\n\n- Bachelors of Science in Electrical Engineering, Physics, Computer Science, Mathematics or related field\n\n- 4+ years' experience in radar signal processing\n\n- Fluent with tools such as MATLAB, Linux, Mathematica, Python, Simulink - and languages such as C/C++, Java etc.\n\n- Working knowledge areas such as digital filtering, spectral estimation, detection and estimation theory, linear algebra and stochastic processes\n\n- Experience with Machine Learning and/or Artificial Intelligence algorithms and libraries, such as TensorFlow\n\n- Demonstrated strong oral and written communication\n\n- Ability to work in a team environment, as well as independently\n\n- Adaptability to new challenges with a strong motivation to grow and learn in new areas\n\nPreferred Qualifications:\n\n- Active TS/SCI clearance preferred\n\n- Master's Degree in Electrical Engineering, Physics, Computer Science, Mathematics or related field\n\n- Strong understanding of machine learning frameworks, RF front end design, and signal processing algorithm development\n\n- Task lead or team leadership experience\n\n- Experience translating functional requirements into tasks\n\n- Experience working in areas of modeling and simulation (M&S), radar, adaptive radar, signals processing, algorithm development synthetic aperture radar (SAR) or similar fields\n\nLInC\n\nElectronic Warfare\n\nPay Range:\nPay Range $78,000.00 - $120,000.00 - $162,000.00\n\nThe Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-23T11:45:03.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["Must be U.S. Citizen", "Active Secret clearance", "Bachelors of Science in Electrical Engineering, Physics, Computer Science, Mathematics or related field", "4+ years' experience in radar signal processing", "Fluent with tools such as MATLAB, Linux, Mathematica, Python, Simulink - and languages such as C/C++, Java etc", "Working knowledge areas such as digital filtering, spectral estimation, detection and estimation theory, linear algebra and stochastic processes", "Experience with Machine Learning and/or Artificial Intelligence algorithms and libraries, such as TensorFlow", "Demonstrated strong oral and written communication", "Ability to work in a team environment, as well as independently", "Adaptability to new challenges with a strong motivation to grow and learn in new areas"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["Pay Range $78,000.00 - $120,000.00 - $162,000.00", "The Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary"], "children": []}]}]}, {"data": "alwaysAI", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Machine Learning Engineer", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://www.theladders.com/job/machine-learning-engineer-alwaysai-san-diego-ca_58727535", "children": []}]}, {"data": "job_description", "children": [{"data": "About Us\n\nalwaysAI is a software company located in San Diego bringing deep learning computer vision (CV) to the edge – where work and life happen. We make building and deploying CV applications on IoT (“edge”) devices easy and affordable for the enterprise developer.\n\nAs a fast-growing Series B startup, we are heavily focused on product innovation as well as growing our developer and partner communities. Our ground-breaking deep learning CV platform is gaining traction in the marketplace, so now is the time to join this exciting adventure!\nRole\n\nAs a computer vision developer with alwaysAI, you will work on exposing new machine learning-based computer vision functionality to our edge computing SDK, and have the opportunity to work on our cloud-based machine learning and analytics systems to provide an end-to-end platform that is accessible to a broad audience of enterprise customers.\n\nMost likely, you’ve done this before – i.e., you’ve been part of a team that brought a software product to market in a fast-moving environment. You can speak to the tradeoffs between “perfect” and “good-enough” and have an appreciation for rapid prototyping.\n\nPerhaps most importantly, you are excited about the potential of artificial intelligence, and computer vision in particular, and want to work with a dedicated group of technologists to make this new world come alive.\nResponsibilities\n• Design and deliver commercial-grade machine learning and dataset management code that meets product requirements and maps to alwaysAI's roadmap.\n• Collaborate with the broader development team on end-to-end product and development objectives.\n• Research and propose “what’s next” in advanced machine learning, and dataset management for inclusion in alwaysAI product roadmap.\n\nKey Qualifications\n• PyTorch experience across multiple model architectures.\n• Experience with training deep neural networks on large-scale datasets.\n• 2-5 years of Machine Learning Experience\n• Strong coding skills in Python using scientific libraries like NumPy, SciPy, and Scikit-learn.\n\nNice-to-Haves\n• Experience with OpenCV\n• AWS Knowledge\n• Working Knowledge of CVAT.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2022-09-22T04:50:03.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["Most likely, you’ve done this before – i.e., you’ve been part of a team that brought a software product to market in a fast-moving environment", "PyTorch experience across multiple model architectures", "Experience with training deep neural networks on large-scale datasets", "2-5 years of Machine Learning Experience", "Strong coding skills in Python using scientific libraries like NumPy, SciPy, and Scikit-learn", "Experience with OpenCV", "AWS Knowledge", "Working Knowledge of CVAT"], "children": []}]}, {"data": "Benefits", "children": [{"data": "No benefits data available", "children": []}]}]}, {"data": "102 ResMed Digital Health Inc.", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Senior Machine Learning Engineer", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://resmed.wd3.myworkdayjobs.com/en-US/ResMed_External_Careers/job/San-Diego-CA-United-States/Senior-Machine-Learning-Engineer_JR_024518-1", "children": []}]}, {"data": "job_description", "children": [{"data": "Digital Health Technology team powers digital experiences and engagement to enhance the lives of millions of people every day through connected care. We build, deliver and manage a portfolio of data management platforms and mobile offerings in support of our core businesses. We thrive on simple and elegant architecture and agility. You’ll be immersed in a dynamic high-growth environment and empowered to excel, take informed risks, and drive ingenuity across the enterprise. Let’s talk about the team: The Data Science and AI/ML team collaborates across the organization to identify, develop and deliver Artificial Intelligence (AI) and Machine Learning (ML) powered software solutions that improve patient outcomes, delight our partners and customers, and improve the way we do business in an “AI First” fashion. On any given day, the team could be working on building sophisticated models to delivering personalized recommendations to patients to improve their sleep, identify optimal equipment and settings using our unparalleled store of billion+ nights of sleep data, proactively identify other health risk factors, or help optimize complex, global supply chain operations. As a Machine Learning Engineer, your key responsibilities include building automation and leading-edge architecture around model development, deployment, and serving to optimize time to market and quality of AI/ML applications. Specifically, you will give architectural guidance to ensure our global AI/ML systems are production-grade, scalable and use the latest state of the art technology and methodology. You will help define and ensure best coding practices within the team of excellent and engaged engineers. You will be given creative freedom and opportunities to work on advanced AI/ML problems, such as reinforcement learning and a self-serve AI/ML platform. You will do hands-on code development, mentor junior team members, and interact with business stakeholders. This is a hybrid role based out of our San Diego office (9001 Spectrum Center Blvd, San Diego, CA 92123). We are only considering candidates that reside in the San Diego area at this time. Let's talk about the role: You will work closely with other stakeholders from Product Management, Engineering, and other business stakeholders to create impactful, intelligent features and products. You will collaborate closely with other team members including Data Scientists and Data Engineers and “own” the end to end process. You will be given wide authority to develop creative model-based solutions but will also be held to high quality and accountability standards. You will thoroughly and diligently document the model design, experiments, tests, validations, and live metrics and outcomes, typically on Confluence. You may be asked to write documents for use in the preparation of intellectual property and technical publications. Build and maintain optimal global AI/ML architectures. Stay informed of industry trends and enable successful AI/ML solutions by leveraging best practices. Participate in and set up Proof of Concepts (POCs) to demonstrate proposed solutions. Identify, design, and implement internal process improvements: Automating manual processes, re-designing infrastructure for greater scalability, etc. Build infrastructure needed for AI/ML systems, such as model inference, automated (re-)training etc. Work with stakeholders including the Executive, Product, Data and Design teams to help with AI/ML-related technical issues and support their AI/ML infrastructure needs. Actively handle escalated incidents to resolution and suggest solutions to limit future exposure. Participate in Code Review and process improvement. You will mentor and train more junior team members. Let's talk about you: 2+ years’ of industry experience M.S or PhD in Data Science/Machine Learning or closely related areas such as Computer Science, Operations Research, Applied Statistics, and Biomedical Informatics. Deep grounding in machine learning techniques including regression methods (linear, logistic, lasso, support vector, etc.), classification (tree-based models such as XGBoost and Random Forest, Neural Networks, Deep Learning – CNN, RNN, LSTM, etc.), as well as knowledge of clustering and unsupervised learning, time series forecasting and optimization methods. Solid foundation with development of data analytics systems, including data exploration/crawling, feature engineering, model building, performance evaluation, and online deployment of models. Hands-on experience in handling large and distributed datasets on Hadoop, Spark, Hive, etc. Experience with AWS or other cloud-based tools and technologies for data pipelining, model development and deployment. Experience building scalable AI/ML systems for continuous training automation, computer vision, natural language processing, or similarly advanced AI/ML problems. Experience with one or more of the following AWS (Amazon Web Services) cloud services: SageMaker, ECR/EC2 and Docker, AWS Batch processing, Lambda, Glue, EventBridge, etc. Experience with AI/ML operational tools such as Airflow, MLFlow, H2O, etc. Experience with relational SQL and NoSQL databases. Experience with developing production-grade Python code. We are shaping the future at ResMed, and we recognize the need to build on and broaden our existing skills and continue to attract and retain the world’s best talent. We work hard to offer holistic benefits packages, provide flexible work arrangements, cultivate a workforce culture that allows employees to grow personally and professionally, and deliver competitive salaries to our team members. Employees scheduled to work 30 or more hours per week are eligible for benefits. This position qualifies for the following benefits package: comprehensive medical, vision, dental, and life, AD&D, short-term and long-term disability insurance, sleep care management, Health Savings Account (HSA), Flexible Spending Account (FSA), commuter benefits, 401(k), Employee Stock Purchase Plan (ESPP), Employee Assistance Program (EAP), and tuition assistance. Employees accrue fifteen days Paid Time Off (PTO) in their first year of employment, receive 11 paid holidays plus 3 floating days and are eligible for 14 weeks of primary caregiver or two weeks of secondary caregiver leave when welcoming new family members. Individual pay decisions are based on a variety of factors, such as the candidate’s geographic work location, relevant qualifications, work experience, and skills. At ResMed, it is not typical for an individual to be hired at or near the top of the range for their role and compensation decisions are dependent on the facts and circumstances of each case. A reasonable estimate of the current range for this position is: $126,000 -190,000 Subject to the absolute discretion of the company, this role may be eligible to receive stock equity based on company, business unit, and/or individual performance. This role is eligible to receive an annual cash bonus payment based on company, business unit, and/or individual performance. #LI-BV1 #LI-Hybrid Joining us is more than saying “yes” to making the world a healthier place. It’s discovering a career that’s challenging, supportive and inspiring. Where a culture driven by excellence helps you not only meet your goals, but also create new ones. We focus on creating a diverse and inclusive culture, encouraging individual expression in the workplace and thrive on the innovative ideas this generates. If this sounds like the workplace for you, apply now! At ResMed (NYSE: RMD, ASX: RMD) we pioneer innovative solutions that treat and keep people out of the hospital, empowering them to live healthier, higher-quality lives. Our digital health technologies and cloud-connected medical devices transform care for people with sleep apnea, COPD and other chronic diseases. Our comprehensive out-of-hospital software platforms support the professionals and caregivers who help people stay healthy in the home or care setting of their choice. By enabling better care, we improve quality of life, reduce the impact of chronic disease and lower costs for consumers and healthcare systems in more than 140 countries. To learn more, visit ResMed.com and follow @ResMed. ResMed Corporation is an equal opportunity employer and provides equal opportunity in employment for all qualified persons, without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law. (US/Canada only) ResMed is an equal opportunity/affirmative action employer. ResMed is an E-Verify Employer. ResMed is a smoke-free workplace. We are a 2023 Circle Back Initiative Employer – we commit to respond to every applicant!", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-24T00:00:00.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["Let's talk about you: 2+ years’ of industry experience M.S or PhD in Data Science/Machine Learning or closely related areas such as Computer Science, Operations Research, Applied Statistics, and Biomedical Informatics", "Deep grounding in machine learning techniques including regression methods (linear, logistic, lasso, support vector, etc.), classification (tree-based models such as XGBoost and Random Forest, Neural Networks, Deep Learning – CNN, RNN, LSTM, etc.), as well as knowledge of clustering and unsupervised learning, time series forecasting and optimization methods", "Solid foundation with development of data analytics systems, including data exploration/crawling, feature engineering, model building, performance evaluation, and online deployment of models", "Hands-on experience in handling large and distributed datasets on Hadoop, Spark, Hive, etc", "Experience with AWS or other cloud-based tools and technologies for data pipelining, model development and deployment", "Experience building scalable AI/ML systems for continuous training automation, computer vision, natural language processing, or similarly advanced AI/ML problems", "Experience with one or more of the following AWS (Amazon Web Services) cloud services: SageMaker, ECR/EC2 and Docker, AWS Batch processing, Lambda, Glue, EventBridge, etc", "Experience with AI/ML operational tools such as Airflow, MLFlow, H2O, etc", "Experience with relational SQL and NoSQL databases", "Experience with developing production-grade Python code"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["We work hard to offer holistic benefits packages, provide flexible work arrangements, cultivate a workforce culture that allows employees to grow personally and professionally, and deliver competitive salaries to our team members", "Employees scheduled to work 30 or more hours per week are eligible for benefits", "This position qualifies for the following benefits package: comprehensive medical, vision, dental, and life, AD&D, short-term and long-term disability insurance, sleep care management, Health Savings Account (HSA), Flexible Spending Account (FSA), commuter benefits, 401(k), Employee Stock Purchase Plan (ESPP), Employee Assistance Program (EAP), and tuition assistance", "Employees accrue fifteen days Paid Time Off (PTO) in their first year of employment, receive 11 paid holidays plus 3 floating days and are eligible for 14 weeks of primary caregiver or two weeks of secondary caregiver leave when welcoming new family members", "Individual pay decisions are based on a variety of factors, such as the candidate’s geographic work location, relevant qualifications, work experience, and skills", "A reasonable estimate of the current range for this position is: $126,000 -190,000 Subject to the absolute discretion of the company, this role may be eligible to receive stock equity based on company, business unit, and/or individual performance", "This role is eligible to receive an annual cash bonus payment based on company, business unit, and/or individual performance"], "children": []}]}]}, {"data": "question", "children": [{"data": ["Suppose you have a matrix of numbers. How can you easily compute the sum of any rectangle (i.e. a range [row_start, row_end, col_start, col_end]) of those numbers? How would you code this?", "Why does one use MSE as a measure of quality. What is the scientific/mathematical reason for the same?", "How would you design a recommendation system (like amazon)?", "Have you ever had your code formally verified?", "Did you implement text analytics?", "What are some of the projects that you have done?", "Give an image, when we take 2 sub images from it, calculate the ratio similar to AnB/AuB.", "how to sort in O(Logn) time", "Design round: Design an api rate limiter\r\nCoding round: simple manipulation of arrays and maps\r\nCraft round: Design an ML Labelling system", "1 question I had was next greatest element in an array - searching only to the right. I had a solution with O(n^2), but they said don't even bother, that's rejected"], "children": []}]}, {"data": "min_sal", "children": [{"data": 75000, "children": []}]}, {"data": "max_sal", "children": [{"data": 240000, "children": []}]}, {"data": "med_sal", "children": [{"data": 148764.97, "children": []}]}]}, {"data": "Data Science Engineer_san diego", "children": [{"data": "Booz Allen Hamilton", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Tech Excellence Data Engineer, Mid", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://careers.boozallen.com/talent/JobDetail/San-Diego-Tech-Excellence-Data-Engineer-Mid-R0170122/78484", "children": []}]}, {"data": "job_description", "children": [{"data": "Tech Excellence Data Engineer, Mid\n\nThe Opportunity:\n\nEver-expanding technology like IoT, machine learning, and artificial intelligence means that there’s more structured and unstructured data available today than ever before. As a data engineer, you know that organizing big data can yield pivotal insights when it’s gathered from disparate sources. We need a data professional like you to help our clients find answers in their big data to impact important missions—from fraud detection to cancer research to national intelligence.\n\nAs a big data engineer at Booz Allen, you’ll use your skills and experience to implement data engineering activities on some of the most mission-driven projects in the industry. You’ll develop and deploy the pipelines and platforms that organize and make disparate data meaningful.\n\nHere, you’ll work with a multi-disciplinary team of analysts, data engineers, developers, and data consumers in a fast-paced, agile environment. You’ll sharpen your skills in analytical exploration and data examination while you support the assessment, design, developing, and maintenance of scalable platforms for your clients.\n\nWork with us to use big data for good.\n\nJoin us. The world can’t wait.\n\nYou Have: \n• 2+ years of experience in a professional work environment\n• Experience with querying or analyzing data to answer questions and solve problems\n• Experience with Amazon Web Services\n• Knowledge of basic concepts in mathematics and statistics\n• Knowledge of basic principles of ETL pipelines\n• Knowledge of data storage and retrieval approaches\n• Knowledge of Cloud environments\n• Ability to learn a programming language\n• Secret clearance\n• Bachelor's degree\n\nNice If You Have: \n• Experience with systems engineering or systems administration\n• Experience with visualizing data to identify or communicate key insights\n• Experience with Azure\n• Experience using Lambda in AWS\n• Experience with Docker, Kubernetes, and Ansible\n• Experience with Python, GitHub in data science, or related\n• TS/SCI clearance\n\nClearance:\n\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information; Secret clearance is required.\n\nCreate Your Career:\n\nGrow With Us\n\nYour growth matters to us—that’s why we offer a variety of ways for you to develop your career. With professional and leadership development opportunities like upskilling programs, tuition reimbursement, mentoring, and firm-sponsored networking, you can chart a unique and fulfilling career path on your own terms.\n\nA Place Where You Belong\n\nDiverse perspectives cultivate collective ingenuity. Booz Allen’s culture of respect, equity, and opportunity means that, here, you are free to bring your whole self to work. With an array of business resource groups and other opportunities for connection, you’ll develop your community in no time.\n\nSupport Your Well-Being\n\nOur comprehensive benefits package includes wellness programs with HSA contributions, paid holidays, paid parental leave, a generous 401(k) match, and more. With these benefits, plus the option for flexible schedules and remote and hybrid locations, we’ll support you as you pursue a balanced, fulfilling life—at work and at home.\n\nYour Candidate Journey\n\nAt Booz Allen, we know our people are what propel us forward, and we value relationships most of all. Here, we’ve compiled a list of resources so you’ll know what to expect as we forge a connection with you during your journey as a candidate with us.\n\nCompensation\n\nAt Booz Allen, we celebrate your contributions, provide you with opportunities and choices, and support your total well-being. Our offerings include health, life, disability, financial, and retirement benefits, as well as paid leave, professional development, tuition assistance, work-life programs, and dependent care. Our recognition awards program acknowledges employees for exceptional performance and superior demonstration of our values. Full-time and part-time employees working at least 20 hours a week on a regular basis are eligible to participate in Booz Allen’s benefit programs. Individuals that do not meet the threshold are only eligible for select offerings, not inclusive of health benefits. We encourage you to learn more about our total benefits by visiting the Resource page on our Careers site and reviewing Our Employee Benefits page.\n\nSalary at Booz Allen is determined by various factors, including but not limited to location, the individual’s particular combination of education, knowledge, skills, competencies, and experience, as well as contract-specific affordability and organizational requirements. The projected compensation range for this position is $58,300.00 to $133,000.00 (annualized USD). The estimate displayed represents the typical salary range for this position and is just one component of Booz Allen’s total compensation package for employees.\n\nWork Model\nOur people-first culture prioritizes the benefits of flexibility and collaboration, whether that happens in person or remotely.\n• If this position is listed as remote or hybrid, you’ll periodically work from a Booz Allen or client site facility.\n• If this position is listed as onsite, you’ll work with colleagues and clients in person, as needed for the specific role.\n\nEEO Commitment\n\nWe’re an equal employment opportunity/affirmative action employer that empowers our people to fearlessly drive change – no matter their race, color, ethnicity, religion, sex (including pregnancy, childbirth, lactation, or related medical conditions), national origin, ancestry, age, marital status, sexual orientation, gender identity and expression, disability, veteran status, military or uniformed service member status, genetic information, or any other status protected by applicable federal, state, local, or international law.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-25T00:00:00.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["2+ years of experience in a professional work environment", "Experience with querying or analyzing data to answer questions and solve problems", "Experience with Amazon Web Services", "Knowledge of basic concepts in mathematics and statistics", "Knowledge of basic principles of ETL pipelines", "Knowledge of data storage and retrieval approaches", "Knowledge of Cloud environments", "Ability to learn a programming language", "Bachelor's degree", "Experience with systems engineering or systems administration", "Experience with visualizing data to identify or communicate key insights", "Experience with Azure", "Experience using Lambda in AWS", "Experience with Docker, Kubernetes, and Ansible", "Experience with Python, GitHub in data science, or related", "TS/SCI clearance"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["With professional and leadership development opportunities like upskilling programs, tuition reimbursement, mentoring, and firm-sponsored networking, you can chart a unique and fulfilling career path on your own terms", "Our comprehensive benefits package includes wellness programs with HSA contributions, paid holidays, paid parental leave, a generous 401(k) match, and more", "With these benefits, plus the option for flexible schedules and remote and hybrid locations, we’ll support you as you pursue a balanced, fulfilling life—at work and at home", "At Booz Allen, we celebrate your contributions, provide you with opportunities and choices, and support your total well-being", "Our offerings include health, life, disability, financial, and retirement benefits, as well as paid leave, professional development, tuition assistance, work-life programs, and dependent care", "The projected compensation range for this position is $58,300.00 to $133,000.00 (annualized USD)"], "children": []}]}]}, {"data": "General Atomics Aeronautical Systems, Inc", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Data Scientist Engineer at General Atomics Aeronautical Systems, Inc in San Diego, CA", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://sandiego-ca.geebo.com/jobs-online/view/id/1074684424-data-scientist-engineer-at-/", "children": []}]}, {"data": "job_description", "children": [{"data": "General Atomics Aeronautical Systems, Inc. (GA-ASI), an affiliate of General Atomics, is a world leader in proven, reliable remotely piloted aircraft and tactical reconnaissance radars, as well as advanced high-resolution surveillance systems. We have an exciting opportunity for a Data Scientist with the Field Operations team located in San Diego, CA (Poway). We are currently creating an application that will automate data streams for our team and are looking for this position to help us develop this process and make proper business decisions from the subsequent analysis. Duties and Responsibilities Under general supervision, this position is responsible for supporting research, product development, and sales efforts with insights gained from analyzing potentially large, unstructured complex datasets. Develop and code software programs, algorithms and automated processes to cleanse, integrate and evaluate large datasets from multiple disparate sources. Assignments are normally accompanied by general instructions and suggestions, outlining possible approaches, sources or information, and potential problems to be encountered with work reviewed regularly for soundness of technical judgment, overall adequacy and accuracy. Tasks involve the exercise of independent judgment and discretion about matters of significance. Essential Functions Design, develop and program methods, processes and systems to consolidate and analyze unstructured, diverse 'big data' sources to generate actionable insights and solutions for client services and product enhancement. Develop, refine, deploy, and support statistical and machine learning models utilizing state of the art approaches. Communicate insights and findings from analysis and experiments to product, service, and business managers. Recommend solutions to moderately complex technical and procedure issues. Create and utilize moderately complex algorithms and approaches, clean and synthesize training/test data, create/run simulations, and perform analysis of alternatives to best meet stakeholder requirements. Support the development and processes for creation of data pipelines May identify opportunities for product and customer process improvement using statistical and machine learning models to improve the effectiveness of different courses of action. Develop and deploy data visualization in order to communicate moderately complex concepts and data in a simple, actionable manner. Interact with product and service teams to identify questions and issues for data analysis and experiments. Document findings and may make technical presentations to business stakeholders as required. May create proposals, cost estimates, and whitepapers suitable for publication. Represents the organization as a contact with internal and external representatives. Maintain the strict confidentiality of sensitive information. Perform other duties as assigned or required. Responsible for observing all laws, regulations, and other applicable obligations wherever and whenever business is conducted on behalf of the Company. Expected to work in a safe manner in accordance with established operating procedures and practices. Job\nQualifications:\nTypically requires a bachelor's or master's degree in data science, applied mathematics, statistics, computer science, or related technical/quantitative discipline from an accredited institution and two or more years of data science experience with a bachelor's degree. May substitute equivalent experience in lieu of education. Must have a general understanding of data science concepts, principles, and theory with technical experience, demonstrating the application of those concepts. Must possess:\nThe ability to understand new concepts quickly and apply them accurately throughout an evolving environment and organize work assignments to meet established timetables The ability to exercise independent judgment in solving issues of moderate scope and complexity Good organizational, verbal and written communication skills to accurately document, report and present findings Good interpersonal skills to effectively interface with all levels of employees including management and outside representatives Good computer skills. Requires proficiency in Python The ability to work independently or in a team environment is essential, as is the ability to work extended hours and travel as required. Ability to obtain and maintain a DoD security clearance is required U.S. citizenship required Travel:\n0-25% Typically requires a bachelor's or master's degree in data science, applied mathematics, statistics, computer science, or related technical/quantitative discipline from an accredited institution and two or more years of data science experience with a bachelor's degree. May substitute equivalent experience in lieu of education. Must have a general understanding of data science concepts, principles, and theory with technical experience, demonstrating the application of those concepts. Must possess:\nThe ability to understand new concepts quickly and apply them accurately throughout an evolving environment and organize work assignments to meet established timetables The ability to exercise independent judgment in solving issues of moderate scope and complexity Good organizational, verbal and written communication skills to accurately document, report and present findings Good interpersonal skills to effectively interface with all levels of employees including management and outside representatives Good computer skills. Requires proficiency in Python The ability to work independently or in a team environment is essential, as is the ability to work extended hours and travel as required. Ability to obtain and maintain a DoD security clearance is required U.S. citizenship required Travel:\n0-25%\nSalary Range:\n$80K -- $100K\nMinimum Qualification\nData Science & Machine LearningEstimated Salary: $20 to $28 per hour based on qualifications.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-24T00:00:00.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["May substitute equivalent experience in lieu of education", "Must have a general understanding of data science concepts, principles, and theory with technical experience, demonstrating the application of those concepts", "The ability to understand new concepts quickly and apply them accurately throughout an evolving environment and organize work assignments to meet established timetables The ability to exercise independent judgment in solving issues of moderate scope and complexity Good organizational, verbal and written communication skills to accurately document, report and present findings Good interpersonal skills to effectively interface with all levels of employees including management and outside representatives Good computer skills", "Requires proficiency in Python The ability to work independently or in a team environment is essential, as is the ability to work extended hours and travel as required", "Ability to obtain and maintain a DoD security clearance is required U.S. citizenship required Travel:", "0-25% Typically requires a bachelor's or master's degree in data science, applied mathematics, statistics, computer science, or related technical/quantitative discipline from an accredited institution and two or more years of data science experience with a bachelor's degree", "Data Science & Machine LearningEstimated Salary: $20 to $28 per hour based on qualifications"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["$80K -- $100K"], "children": []}]}]}, {"data": "Upstart", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Director of Data Engineering(Remote)", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://jobs.yourbasin.com/jobs/director-of-data-engineeringremote-san-diego-california/987966724-2/", "children": []}]}, {"data": "job_description", "children": [{"data": "Upstart is a leading AI lending marketplace partnering with banks and credit unions to expand access to affordable credit. By leveraging Upstarts AI marketplace, Upstart-powered banks and credit unions can have higher approval rates and lower loss rates across races, ages, and genders, while simultaneously delivering the exceptional digital-first lending experience their customers demand. Our offerings include personal, auto, and small business loans, and we plan to expand into more verticals as our business grows.\n\nUpstart is a digital-first company, which means that most Upstarters can live and work anywhere in the U.S. We also have offices in San Mateo, CA; Columbus, OH; and Austin, TX.\n\nMost Upstarters join us because they connect with our mission of enabling access to effortless credit based on true risk. If you are energized by the impact you can make at Upstart, we'd love to hear from you!\n\nThe Team\n\nUpstart is the first company to leverage Machine Learning to price credit, Data is a core part of the company's DNA. As our product portfolio has grown and matured, our data needs have greatly increased.\n\nAs the Director of Data Engineering, you will be responsible for building a modern platform that supports the company's analytic needs over the next 3-5 years.\n\nPosition Location - This role is available in the following locations: US Remote, San Mateo, Columbus\n\nTime Zone Requirements - This team operates on the East/West Coast time zones.\n\nTravel Requirements - This team has regular on-site collaboration sessions. These occur 5 days per Month/Quarter at one of our office locations. If you need to travel to make these meetups, Upstart will cover all travel related expenses.\n\nHow you'll make an impact:\n• Partner across Product Management, Engineering, Analytics, ML to define and execute on a data strategy for our reporting, analytical, and ML capabilities\n• Work with internal engineering and external vendor teams to build the company's data platform\n• Partner with our recruiting team to build a diverse team of world-class engineers\n• Coach engineers and managers through career and skill development\n\nWhat we're looking for:\n\nMinimum requirements:\n• BS in Computer Science or equivalent experience\n• 10+ years of engineering management experience and 15+ years overall software engineering experience\n• 5+ years experience with cloud technologies\n• 5+ years experience with building data/analytic platforms\n\nPreferred qualifications:\n• PhD in Computer Science/Data Science/Machine Learning\n• Expertise in cloud native big data and analytics platform technologies\n• A track record of attracting and developing world-class engineering talent\n• Excellent communication skills: verbal and written\n• Well versed in agile development methodologies\n• Comfortable working with remote teams across all US timezones\n• Interest in being part of a dynamic and fast paced environment\n\nWhat youll love:\n• Competitive Compensation (base + bonus & equity)\n• Comprehensive medical, dental, and vision coverage\n• Personal Development and Technology & Ergonomic Budgets\n• Life insurance and disability benefits\n• Clubs and Activities (Game Nights, Fitstarters, Superwomen, Book Club, Investing Club, Money Discussions, Photography Club and Basketball teams)\n• Generous vacation policy\n• 401(k) and Employee Stock Purchase Plan (ESPP)\n• Catered lunches + snacks & drinks\n\nAt Upstart, your base pay is one part of your total compensation package. The anticipated base salary for this position is expected to be within this range: $190,400 - $280,000. Your actual base pay will depend on your geographic location-with our digital first philosophy, Upstart uses compensation regions that vary depending on location. Individual pay is also determined by job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.\n\nIn addition, Upstart provides employees with target bonuses, equity compensation, and generous benefits packages (including medical, dental, vision, and 401k). Sales positions generally offer a competitive On Target Earnings (OTE) incentive compensation structure. The salary listed above for sales roles is OTE, which includes both salary and commission, assuming 100% target achievement.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-25T20:17:12.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["BS in Computer Science or equivalent experience", "10+ years of engineering management experience and 15+ years overall software engineering experience", "5+ years experience with cloud technologies", "5+ years experience with building data/analytic platforms"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["Competitive Compensation (base + bonus & equity)", "Comprehensive medical, dental, and vision coverage", "Personal Development and Technology & Ergonomic Budgets", "Life insurance and disability benefits", "Clubs and Activities (Game Nights, Fitstarters, Superwomen, Book Club, Investing Club, Money Discussions, Photography Club and Basketball teams)", "Generous vacation policy", "401(k) and Employee Stock Purchase Plan (ESPP)", "Catered lunches + snacks & drinks", "At Upstart, your base pay is one part of your total compensation package", "The anticipated base salary for this position is expected to be within this range: $190,400 - $280,000", "Your actual base pay will depend on your geographic location-with our digital first philosophy, Upstart uses compensation regions that vary depending on location", "Individual pay is also determined by job-related skills, experience, and relevant education or training", "Your recruiter can share more about the specific salary range for your preferred location during the hiring process", "In addition, Upstart provides employees with target bonuses, equity compensation, and generous benefits packages (including medical, dental, vision, and 401k)", "Sales positions generally offer a competitive On Target Earnings (OTE) incentive compensation structure", "The salary listed above for sales roles is OTE, which includes both salary and commission, assuming 100% target achievement"], "children": []}]}]}, {"data": "The Henry M. Jackson Foundation", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Data Science Engineer (Hybrid) - Pathology", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://www.gettinghired.com/job/computer-and-mathematical/all/11517114/data-science-engineer-hybrid-pathology", "children": []}]}, {"data": "job_description", "children": [{"data": "Join the HJF Team!\n\nHJF is seeking a Data Science Engineer to support the Department of Pathology located at either Naval Hospital Camp Pendleton or Naval Medical Center San Diego, CA. HJF provides scientific, technical, and programmatic support services to the Department of Pathology. U.S. Citizenship is Required.\n\nThe incumbent will identify and evaluate data science methods for using natural language processing on medical records data and AI methods for digital pathology. Develops methods to extract, store, and prepare medical records data for de-identification and data abstraction from disparate data sources. Analyses, designs and develops pipelines to train, test, and use machine learning and natural language processing inference models on biomedical data; manages development projects from initial design through testing while providing strategic direction.\n\nNOTE: All HJF employees are required to be fully vaccinated against COVID-19. Proof of vaccination or an approved religious or medical accommodation will be required.\n\nResponsibilities:\n• Work with technical staff and scientists to identify appropriate software modules and algorithms to solve biomedical research problems including medical records data de-identification and abstraction. Incorporate those modules into pipelines for training and testing inference models.\n• Develop pipelines to extract, format, merge, and store medical data from both current EHR and archival data sources in a suitable format for de-identification and data abstraction.\n• Develop training and test sets, train models, and collect and interpret data to evaluate and improve inference model performance.\n• Develop reproducible build processes, unit tests, smoke tests, and SIT tests, and lead code reviews. Ensure that code is maintained in a repository and meets industry standards for documentation, readability, and maintainability.\n• Collaborate with scientific staff write up and publish machine learning and AI results and models, develop open-source repositories when appropriate, and document code and pipelines in a way that they can be shared with other researchers.\n• Maintain HIPAA compliance for all patient data, complying with DHA rules and data sharing agreements. Manually confirm de-identification of subsets of data in accordance with HIPAA regulations.\n• May perform other duties and responsibilities as assigned or directed by the supervisor. This may include attendance of and participation in required training for role.\n\nRequired Knowledge, Skills and Abilities:\n• Expert at programming in Python and JavaScript, knowledge of SQL and understanding of relational databases.\n• Detailed knowledge of how to select, train, test, and evaluate the performance of AI, and natural language processing models.\n• Knowledge of how to develop and test a full pipeline for data processing through a machine learning model on both local machines and in cloud environments.\n\nMinimum Education: Bachelor's degree in Data science or computer science required. Master's degree preferred.\n\nMinimum Experience/ Training Requirements: Minimum 3-5 years of experience required.\n\nPhysical Capabilities: Requires lifting materials up to 20 lbs.\n\nWork Environment: Set in an office work environment.\n\nWork Arrangement: This is a hybrid work environment with flexibility to telework a few days per week.\n\nBackground/Security: U.S. citizenship required; eligible to obtain and maintain a Tier I investigation/ Public Trust and a Common Access Card (CAC).\n\nEmployment with HJF is contingent upon successful completion of a background check, which may include, but is not limited to, contacting your professional references, verification of previous employment, addresses, education, and credentials, a criminal background check, drug screening, and a department of motor vehicle (DMV) check.\n\nAny qualifications to be considered as equivalents, in lieu of stated minimums, require the prior approval of the Chief Human Resources Officer.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-14T14:17:42.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["Expert at programming in Python and JavaScript, knowledge of SQL and understanding of relational databases", "Detailed knowledge of how to select, train, test, and evaluate the performance of AI, and natural language processing models", "Knowledge of how to develop and test a full pipeline for data processing through a machine learning model on both local machines and in cloud environments", "Minimum Education: Bachelor's degree in Data science or computer science required", "Minimum Experience/ Training Requirements: Minimum 3-5 years of experience required", "Physical Capabilities: Requires lifting materials up to 20 lbs", "Background/Security: U.S. citizenship required; eligible to obtain and maintain a Tier I investigation/ Public Trust and a Common Access Card (CAC)", "Employment with HJF is contingent upon successful completion of a background check, which may include, but is not limited to, contacting your professional references, verification of previous employment, addresses, education, and credentials, a criminal background check, drug screening, and a department of motor vehicle (DMV) check", "Any qualifications to be considered as equivalents, in lieu of stated minimums, require the prior approval of the Chief Human Resources Officer"], "children": []}]}, {"data": "Benefits", "children": [{"data": "No benefits data available", "children": []}]}]}, {"data": "SynergisticIT", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Data Scientist (Remote)", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://www.linkedin.com/jobs/view/data-scientist-remote-at-synergisticit-3569777382", "children": []}]}, {"data": "job_description", "children": [{"data": "About Us: Synergistic IT is a full-service staffing and placement firm servicing client in America for the past 12+ years. We are dedicated towards fulfilling the IT needs of our clients. From staffing to full implementation of projects we provide the highest quality IT Services. We Intend to deliver exceptional student outcome. We don't just help you secure a tech job but build a solid career in technology.\n\nJob Description\n• Identify valuable data sources and automate collection processes\n• Undertake preprocessing of structured and unstructured data\n• Analyze large amounts of information to Client trends and patterns\n• Present information using data visualization techniques\n• Propose solutions and strategies to business challenges\n• Required Knowledge of How to implement multiple plots\n• Creating graph-Bar/Pie/Line chart\n• Label encoding with merging\n\nEducation Requirement: -\n• Bachelors in Computer Science, Engineering or relevant field; graduate degree in Data Science or another quantitative field is preferred.\n\nSkill Required-\n• Ability to work with stakeholders to assess potential risks.\n• Strong math skills (e.g., statistics, algebra).\n• Experience in data mining\n• Knowledge of R, SQL and Python; familiarity with Scala, Java or C++ is an asset\n\nBenefits\n• On Job Technical support\n• E- verified\n• Filing of H1b and Green card\n• Full time position\n\nCandidate who are missing the required skills, might be provided an option to enhance their skills, so that they can also apply for the role and can make a career in IT industry.\n\nIf you do respond via e-mail, please include a daytime phone number so that we can reach you. In considering candidates, time is of the essence, so please respond ASAP. Thank you", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-19T09:38:32.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["Ability to work with stakeholders to assess potential risks", "Strong math skills (e.g., statistics, algebra)", "Experience in data mining", "Knowledge of R, SQL and Python; familiarity with Scala, Java or C++ is an asset", "Filing of H1b and Green card"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["On Job Technical support", "Full time position"], "children": []}]}]}, {"data": "Northrop Grumman", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Principal Data Engineer (San Diego)   ", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://devitjobs.us/jobs/Northrop-Grumman-Principal-Data-Engineer-San-Diego", "children": []}]}, {"data": "job_description", "children": [{"data": "Principal Data Engineer (San Diego)    Salary: 104600 - 157000 USD per year\n\nAt Northrop Grumman we are looking for a Data engineer!\n\n  ️ Our tech stack:\nAPI, AWS, Cloud, DevOps, Django, Docker, EC2, ETL, Flask, HTTP, JavaScript, Linux, Machine Learning, PyTorch, Python, REST, SQL, Security, Tableau, TensorFlow, Web, pandas, Data\n\n   Rquirements:\n- Bachelor's degree in a Science, Technology, Engineering or Mathematics (STEM) field and 5 years of experience in Data Engineering; OR a Masters degree in Science, Technology, Engineering or Mathematics with 3 years’ experience.\n- Proficiency in MS SQL Server, SQL queries, scripting, and automation.\n- Experience building and maintaining Extraction Transfer Load (ETL) and data migration pipelines.\n- Proficiency in programming languages such as Python and C++.\n- Working knowledge of Python ETL libraries (Pandas, SQL Alchemy).\n- Candidate must be able to obtain and maintain a Top-Secret Security Clearance.\n- Degree in Software Engineering, Computer Science or Data Science (Preferred).\n- Active Secret/ Top Secret Security Clearance (Preferred).\n\n  ‍    ‍   Your responsibilities are:\n- Design, develop, and maintain a scalable ETL pipeline- to support Machine Learning developments.\n- Develop and troubleshoot SQL code, stored procedures, functions, tables, and views.\n- Experience in extracting and analyzing data from multiple data sources.\n- Research, evaluate, and determine best fit of tools and techniques for data storage, data mining, data transformation, and data integration.\n- Design, develop, test, and deploy scalable data solutions.\n- Collaborate with external functional organizations for data and system understanding.\n- Consult with customers and stakeholder to clearly define needs and objectives.\n- Communicate project status and results to various levels of leadership.\n\nView this job and over 500 other transparent jobs with salaries (      ) & tech stacks (  ️) on DevITjobs.us\n\nCategory: Data Developer / Engineer\nLocation address: Lightwave Avenue 9393, San-Diego, United States\n\nSalary: 104600 - 157000 USD per year\n\nBenefits & perks that we offer:\n\nNorthrop Grumman - More about us and the role:\n- Requisition ID: R10094748.\n- Category: Research and Sciences.\n- Location: San Diego, CA, USA.\n- Citizenship Required: United States Citizenship.\n- Clearance Type: Top Secret.\n- Telecommute: No- Teleworking not available for this position.\n- Shift: 1st Shift (United States of America).\n- Travel Required: Yes, 10% of the Time.\n- Relocation Assistance: Relocation assistance may be available.\n- Positions Available: 1.\n- Salary Range: $104,600 USD - $157,000 USD.\n- Employees may be eligible for a discretionary bonus in addition to base pay.\n- Annual bonuses are designed to reward individual contributions as well as allow employees to share in company results.\n- Employees in Vice President or Director positions may be eligible for Long Term Incentives.\n- In addition, Northrop Grumman provides a variety of benefits including health insurance coverage, life and disability insurance, savings plan, Company paid holidays and paid time off (PTO) for vacation and/or personal business.\n- The health and safety of our employees and their families is a top priority.\n- The company encourages employees to remain up-to-date on their COVID-19 vaccinations.\n- U.S. Northrop Grumman employees may be required, in the future, to be vaccinated or have an approved disability/medical or religious accommodation, pursuant to future court decisions and/or government action on the currently stayed federal contractor vaccine mandate under Executive Order 14042 https://www.saferfederalworkforce.gov/contractors/.\n- Northrop Grumman is committed to hiring and retaining a diverse workforce.\n- The company is an Equal Opportunity/Affirmative Action Employer, making decisions without regard to race, color, religion, creed, sex, sexual orientation, gender identity, marital status, national origin, age, veteran status, disability, or any other protected class.\n- For our complete EEO/AA and Pay Transparency statement, please visit http://www.northropgrumman.com/EEO.\n- U.S. Citizenship is required for most positions.\n\nAre you looking for Data jobs in San-Diego?", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-05-11T22:00:00.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["Bachelor's degree in a Science, Technology, Engineering or Mathematics (STEM) field and 5 years of experience in Data Engineering; OR a Masters degree in Science, Technology, Engineering or Mathematics with 3 years’ experience", "Proficiency in MS SQL Server, SQL queries, scripting, and automation", "Experience building and maintaining Extraction Transfer Load (ETL) and data migration pipelines", "Proficiency in programming languages such as Python and C++", "Working knowledge of Python ETL libraries (Pandas, SQL Alchemy)", "Candidate must be able to obtain and maintain a Top-Secret Security Clearance", "Citizenship Required: United States Citizenship", "U.S. Citizenship is required for most positions"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["Salary: 104600 - 157000 USD per year", "Telecommute: No- Teleworking not available for this position", "Relocation Assistance: Relocation assistance may be available", "Salary Range: $104,600 USD - $157,000 USD", "Employees may be eligible for a discretionary bonus in addition to base pay", "Annual bonuses are designed to reward individual contributions as well as allow employees to share in company results", "Employees in Vice President or Director positions may be eligible for Long Term Incentives", "In addition, Northrop Grumman provides a variety of benefits including health insurance coverage, life and disability insurance, savings plan, Company paid holidays and paid time off (PTO) for vacation and/or personal business", "The health and safety of our employees and their families is a top priority"], "children": []}]}]}, {"data": "Bristol Myers Squibb", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "RDC Data Engineer", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://jobs.alpfa.org/job/rdc-data-engineer/68898656/", "children": []}]}, {"data": "job_description", "children": [{"data": "Working with Us\nChallenging. Meaningful. Life-changing. Those aren't words that are usually associated with a job. But working at Bristol Myers Squibb is anything but usual. Here, uniquely interesting work happens every day, in every department. From optimizing a production line to the latest breakthroughs in cell therapy, this is work that transforms the lives of patients, and the careers of those who do it. You'll get the chance to grow and thrive through opportunities uncommon in scale and scope, alongside high-achieving teams rich in diversity. Take your career farther than you thought possible.\n\nBristol Myers Squibb recognizes the importance of balance and flexibility in our work environment. We offer a wide variety of competitive benefits, services and programs that provide our employees with the resources to pursue their goals, both at work and in their personal lives. Read more: careers.bms.com/working-with-us\n\nWorkat the interface of pharma, genomics, and data engineering. The candidate will significantly contribute to the development of modern data services for BMS's research scientists.\n\nJob Description\n\nBristol Myers Squibb seeks a highly motivated Data Engineer to enable data integration efforts in support of data science and computational research efforts. The Data Engineer will be responsible for executing an ambitious digital strategy to support BMS's predictive science capabilities in Research. The successful candidate will partner closely with computational researcher teams,ITleadership, and various technical functions to design and deliver data solutions that streamline access to computing & data, and help scientists derive insight and value from their research.\n\nJob Functions\n\nThe role requires someone who can seamlessly mesh technical knowledge to help navigate R&D cloud, CoLo, andon-premisecomputing needs, including planning, infrastructure design, maintenance, and support.\n\nThe role will lead the development of infrastructure that enables interoperability and comparability of data sets derived from different technologies and biological systems in the context of integrative data analysis. The candidate will create and maintain optimal data pipeline architectures that enable scientific workflow and collaborate with interdisciplinary teams of data curators, software engineers, data scientists and computational biologists as we test new hypotheses through the novel integration of emerging research data types.\n\nThe work will combine careful resource planning and project management with hands-on data manipulation and implementation of data integration workflows.\n\nResponsibilities include, but are not limited to, the following:\n• Designing and developing an ETL infrastructure to load research data from multiple source systems using languages and frameworks such as Python, R, Docker, Airflow, Glue, etc.\n• Leading the design and implementation of data services solutions that may include relational, NoSQL and graph database components.\n• Collaborating with project managers, solution architects, infrastructure teams, and external vendors as needed to support successful delivery of technical solutions.\n\nJob Requirements\n• Bachelor's Degree with 8+ years of academic / industry experience or master's degree with 6+ years of academic / industry experience or PhD with 3+ years of academic / industry experience in an engineering or biology field or equivalent experience.\n• Demonstrated high proficiency with current software engineering methodologies, such as Agile SDLC approaches, distributed source code control, project management, issue tracking, and CI/CD tools and processes.\n• Excellent skills in an object-oriented programming language such as Python or R, and proficiency in SQL\n• High degree of proficiency in cloud computing\n• Solid understanding of container strategies such as Docker, Fargate, ECS and ECR.\n• Excellent skills and deep knowledge of databases such as Postgres, Elasticsearch, Redshift, and Aurora, including distributed database design, SQL vs. NoSQL, and database optimizations\n• Demonstrated high proficiency with current software engineering methodologies, such as Agile SDLC (Software Development Life Cycle) approaches, distributed source code control, project management, issue tracking, and CI/CD tools and processes.\n• Strong technical communication skills.\n\nThe starting compensation for this jobis a range from $114,000 - $159,000, plus incentive cash and stock opportunities (based on eligibility).\n\nThe starting pay rate takes into account characteristics of the job, such as required skills and the where the job is performed. Final individual compensation will be decided based on demonstrated experience.\n\nFor more on benefits, please visit Working With Us (bms.com).Eligibility for specific benefits listed on our BMS Careers site may vary based on the job and location.\n\n#LI-Hybrid\n\nIf you come across a role that intrigues you but doesn't perfectly line up with your resume, we encourage you to apply anyway. You could be one step away from work that will transform your life and career.\n\nUniquely Interesting Work, Life-changing Careers\nWith a single vision as inspiring as \"Transforming patients' lives through science™ \", every BMS employee plays an integral role in work that goes far beyond ordinary. Each of us is empowered to apply our individual talents and unique perspectives in an inclusive culture, promoting diversity in clinical trials, while our shared values of passion, innovation, urgency, accountability, inclusion and integrity bring out the highest potential of each of our colleagues.\n\nOn-site Protocol\nPhysical presence at the BMS worksite or physical presence in the field is a necessary job function of this role, which the Company deems critical to collaboration, innovation, productivity, employee well-being and engagement, and it enhances the Company culture.\n\nCOVID-19 Information\nTo protect the safety of our workforce, customers, patients and communities, the policy of the Company requires all employees and workers in the U.S. and Puerto Rico to be fully vaccinated against COVID-19, unless they have received an exception based on an approved request for a medical or religious reasonable accommodation.Therefore, all BMS applicants seeking a role located in the U.S. and Puerto Rico must confirm that they have already received or are willing to receive the full COVID-19 vaccination by their start date as a qualification of the role and condition of employment.This requirement is subject to state and local law restrictions and may not be applicable to employees working in certain jurisdictions such as Montana. This requirement is also subject to discussions with collective bargaining representatives in the U.S.\n\nBMS is dedicated to ensuring that people with disabilities can excel through a transparent recruitment process, reasonable workplace accommodations/adjustments and ongoing support in their roles. Applicants can request a reasonable workplace accommodation/adjustment prior to accepting a job offer. If you require reasonable accommodations/adjustments in completing this application, or in any part of the recruitment process, direct your inquiries to adastaffingsupport@bms.com. Visit careers.bms.com/eeo-accessibility to access our complete Equal Employment Opportunity statement.\n\nBMS will consider for employment qualified applicants with arrest and conviction records, pursuant to applicable laws in your area.\n\nAny data processed in connection with role applications will be treated in accordance with applicable data privacy policies and regulations.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-21T00:00:00.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["Bachelor's Degree with 8+ years of academic / industry experience or master's degree with 6+ years of academic / industry experience or PhD with 3+ years of academic / industry experience in an engineering or biology field or equivalent experience", "Excellent skills in an object-oriented programming language such as Python or R, and proficiency in SQL", "High degree of proficiency in cloud computing", "Solid understanding of container strategies such as Docker, Fargate, ECS and ECR", "Excellent skills and deep knowledge of databases such as Postgres, Elasticsearch, Redshift, and Aurora, including distributed database design, SQL vs", "NoSQL, and database optimizations", "Demonstrated high proficiency with current software engineering methodologies, such as Agile SDLC (Software Development Life Cycle) approaches, distributed source code control, project management, issue tracking, and CI/CD tools and processes", "Strong technical communication skills"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["The starting compensation for this jobis a range from $114,000 - $159,000, plus incentive cash and stock opportunities (based on eligibility)", "The starting pay rate takes into account characteristics of the job, such as required skills and the where the job is performed", "For more on benefits, please visit Working With Us (bms.com).Eligibility for specific benefits listed on our BMS Careers site may vary based on the job and location"], "children": []}]}]}, {"data": "Booz Allen Hamilton", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Data Engineer, Mid", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://careers.boozallen.com/talent/JobDetail/San-Diego-Data-Engineer-Mid-R0167655/76992", "children": []}]}, {"data": "job_description", "children": [{"data": "Data Engineer, Mid\n\nThe Challenge:\n\nDo you want to work at the forefront of advanced technology and solve complex data challenges? You know that data yields pivotal insights when it’s gathered from disparate sources and organized. As a data engineer, you have the chance to develop and deploy the pipelines and platforms that make this data meaningful. What’s more, you’ll have the chance to help grow Booz Allen’s DataOps capabilities while working with a multi-disciplinary team of analysts, data scientists, developers, and data consumers in a fast-paced, Agile environment. We’re looking for someone like you to work with our clients and meet their mission by developing the next generation of IT Infrastructure.\n\nThis is an opportunity to implement data engineering activities on some of the most mission-driven projects in the industry. Supporting tactical and strategic data infrastructure, you’ll have the chance to architect data systems, stand up data platforms, build out extract, transform, and load pipelines, write custom code, interface with data stores, perform ingestion, and deploy models. From sharing your skills in analytical exploration and examination of data to supporting the assessment, design, building, and maintenance of scalable platforms, you’ll work with our clients to solve their most pressing challenges.\n\nReady to help drive innovation using cutting-edge data tools and techniques?\n\nJoin us. The world can’t wait.\n\nYou Have:\n• 1+ years of experience with writing software in programming languages, including Python\n• 1+ years of experience with source control and collaboration software, including Git or Atlassian tools\n• 1+ years of experience with ETL operations, including on-premises or Cloud infrastructure\n• Knowledge of relational and non-relational database technologies, including SQL or GraphQL\n• Knowledge of automation and scripting on Linux or Windows operating systems\n• Ability to obtain a security clearance\n• Bachelor's degree\n\nNice If You Have:\n• Experience with deploying analytics workloads on platform as a service (PaaS) and software as a service (SaaS), including AWS EMR, Redshift, SageMaker, Azure Databricks, SQL Data Warehouse, or Machine Learning service\n• Experience with distributed or parallel programming frameworks, including Apache Spark or NVIDIA CUDA\n• Experience with infrastructure as code frameworks and services, including Terraform or CloudFormation\n• Experience with developing and presenting complex technical information for technical and non-technical audiences and senior leaders\n• Experience with developing and deploying large-scale batch and stream analytics pipelines\n• Experience working with integrated groups comprised of customer success managers, infrastructure engineers, data scientists, and software engineers\n• Experience with DoD information systems\n• Master’s degree in Mathematics\n• Cloud Development Certification, including AWS Solutions Architect or Azure certification\n• Information Security Certification, including Security+ or CISSP certification\n\nClearance:\n\nApplicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information.\n\nBuild Your Career:\n\nAt Booz Allen, we know the power of analytics and we’re dedicated to helping you grow as a data analysis professional. When you join Booz Allen, you’ll have the chance to:\n• access online and onsite training in data analysis and presentation methodologies, and tools like Hortonworks, Docker, Tableau, and Splunk\n• change the world with the Data Science Bowl—the world’s premier data science for social good competition\n• participate in partnerships with data science leaders, like our partnership with NVIDIA to deliver Deep Learning Institute (DLI) training to the federal government\n\nYou’ll have access to a wealth of training resources through our Analytics University, an online learning portal specifically geared towards data science and analytics skills, where you can access more than 5000 functional and technical courses, certifications, and books. Build your technical skills through hands-on training on the latest tools and state-of-the-art tech from our in-house experts. Pursuing certifications that directly impact your role? You may be able to take advantage of our tuition assistance, on-site bootcamps, certification training, academic programs, vendor relationships, and a network of professionals who can give you helpful tips. We’ll help you develop the career you want as you chart your own course for success.\n\nCompensation\n\nAt Booz Allen, we celebrate your contributions, provide you with opportunities and choices, and support your total well-being. Our offerings include health, life, disability, financial, and retirement benefits, as well as paid leave, professional development, tuition assistance, work-life programs, and dependent care. Our recognition awards program acknowledges employees for exceptional performance and superior demonstration of our values. Full-time and part-time employees working at least 20 hours a week on a regular basis are eligible to participate in Booz Allen’s benefit programs. Individuals that do not meet the threshold are only eligible for select offerings, not inclusive of health benefits. We encourage you to learn more about our total benefits by visiting the Resource page on our Careers site and reviewing Our Employee Benefits page.\n\nSalary at Booz Allen is determined by various factors, including but not limited to location, the individual’s particular combination of education, knowledge, skills, competencies, and experience, as well as contract-specific affordability and organizational requirements. The projected compensation range for this position is $58,300.00 to $133,000.00 (annualized USD). The estimate displayed represents the typical salary range for this position and is just one component of Booz Allen’s total compensation package for employees.\n\nWork Model\nOur people-first culture prioritizes the benefits of flexibility and collaboration, whether that happens in person or remotely.\n• If this position is listed as remote or hybrid, you’ll periodically work from a Booz Allen or client site facility.\n• If this position is listed as onsite, you’ll work with colleagues and clients in person, as needed for the specific role.\n\nEEO Commitment\n\nWe’re an equal employment opportunity/affirmative action employer that empowers our people to fearlessly drive change – no matter their race, color, ethnicity, religion, sex (including pregnancy, childbirth, lactation, or related medical conditions), national origin, ancestry, age, marital status, sexual orientation, gender identity and expression, disability, veteran status, military or uniformed service member status, genetic information, or any other status protected by applicable federal, state, local, or international law.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-03-24T00:00:00.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["1+ years of experience with writing software in programming languages, including Python", "1+ years of experience with source control and collaboration software, including Git or Atlassian tools", "1+ years of experience with ETL operations, including on-premises or Cloud infrastructure", "Knowledge of relational and non-relational database technologies, including SQL or GraphQL", "Knowledge of automation and scripting on Linux or Windows operating systems", "Ability to obtain a security clearance", "Bachelor's degree", "Experience with deploying analytics workloads on platform as a service (PaaS) and software as a service (SaaS), including AWS EMR, Redshift, SageMaker, Azure Databricks, SQL Data Warehouse, or Machine Learning service", "Experience with distributed or parallel programming frameworks, including Apache Spark or NVIDIA CUDA", "Experience with infrastructure as code frameworks and services, including Terraform or CloudFormation", "Experience with developing and presenting complex technical information for technical and non-technical audiences and senior leaders", "Experience with developing and deploying large-scale batch and stream analytics pipelines", "Experience working with integrated groups comprised of customer success managers, infrastructure engineers, data scientists, and software engineers", "Experience with DoD information systems", "Master’s degree in Mathematics", "Cloud Development Certification, including AWS Solutions Architect or Azure certification", "Information Security Certification, including Security+ or CISSP certification"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["You may be able to take advantage of our tuition assistance, on-site bootcamps, certification training, academic programs, vendor relationships, and a network of professionals who can give you helpful tips", "At Booz Allen, we celebrate your contributions, provide you with opportunities and choices, and support your total well-being", "Our offerings include health, life, disability, financial, and retirement benefits, as well as paid leave, professional development, tuition assistance, work-life programs, and dependent care", "The projected compensation range for this position is $58,300.00 to $133,000.00 (annualized USD)"], "children": []}]}]}, {"data": "SynergisticIT", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Entry Level Data Scientist", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://www.ziprecruiter.com/c/SynergisticIT/Job/Entry-Level-Data-Scientist/-in-San-Diego,CA?jid=bf68c986456f5cd8", "children": []}]}, {"data": "job_description", "children": [{"data": "Job Description\n\nSYNERGISTICIT wants every candidate to know that the Job Market is Challenging and to stand out you need to have exceptional skills and technologies and that's where we come in to make sure you get the attention which you need\n\nWe at Synergisticit understand the problem of the mismatch between employer's requirements and Employee skills and that's why since 2010 we have helped thousands of candidates get jobs at technology clients like apple, google, Paypal, western union, Client, visa, walmart labs etc to name a few.\n\nWe have an excellent reputation with the clients. Currently, We are looking for entry-level software programmers, IT enthusiasts, Python/Java developers, Data analysts/ Data Scientists.\n\nWho Should Apply Recent IT Graduates looking to make their careers in IT Industry Candidates having basic knowledge or with one or two years of experience in JAVA, C++, Core JAVA.\n\nWe welcome candidates with all visas and citizens to apply.\n\nWe assist in filing for STEM extension and also for H1b and Green card filing to Candidates looking to upskill/enhance their IT skills.\n\nCandidates who are serious about their future in the IT Industry and have set big goals for themselves.\n\nCandidates having difficulty in finding jobs or cracking interviews or who wants to improve their skill portfolio. We also offer Skill enhancement programs if the candidates are missing skills or experience which our clients need with great outcomes\n\nCandidates can benefit from skill enhancement if they fall into the below categories. If they are qualified with enough skills then no need for skill enhancement\n\nCandidates who Lack Experience\nHave had a break in careers\nLack Technical Competency\nDifferent visa candidates who want to get employed and settle down in the USA\n\nplease also check the below links\n\nhttps://www.synergisticit.com/candidate-outcomes/\n\nhttps://www.synergisticit.com/java-track/\n\nhttps://www.synergisticit.com/data-science-track/\n\nhttps://www.synergisticit.com/blog/\nREQUIRED SKILLS\n• Bachelors degree or Masters degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, IT\n• Highly motivated, self-learner, and technically inquisitive\n• Experience in programming language Java and understanding of the software development life cycle\n• Knowledge of Core Java , javascript , C++ or software programming\n• Excellent written and verbal communication skills\nPreferred skills: knowledge of Spring Boot, microservices\n\nPlease understand skills are required by clients for selection even if its Junior or entry level position the additional skills are the only way a candidate can be picked by clients.\nNo third party candidates or c2c candidates\nTo apply for this position, please apply to the posting\n\nNo phone calls please . Shortlisted candidates would be reached out\n\nSYNERGISTICIT wants every candidate to know that the Job Market is Challenging and to stand out you need to have exceptional skills and technologies and that's where we come in to make sure you get the attention which you need\n\nPosition open for all visas and US citizens\n\nWe at Synergisticit understand the problem of the mismatch between employer's requirements and Employee skills and that's why since 2010 we have helped thousands of candidates get jobs at technology clients like apple, google, Paypal, western union, Client, visa, walmart labs etc to name a few.\n\nWe have an excellent reputation with the clients. Currently, We are looking for entry-level software programmers, IT enthusiasts, Python/Java developers, Data analysts/ Data Scientists.\n\nWho Should Apply Recent Computer science/Engineering /Mathematics/Statistics or Science Graduates looking to make their careers in IT Industry\n\nWe welcome candidates with all visas and citizens to apply.\n\nWe assist in filing for STEM extension and also for H1b and Green card filing to Candidates\n\nCandidates who are serious about their future in the IT Industry and have set big goals for themselves.\n\nCandidates having difficulty in finding jobs or cracking interviews or who wants to improve their skill portfolio. We also offer Skill enhancement programs if the candidates are missing skills or experience which our clients need with great outcomes\n\nCandidates can benefit from skill enhancement if they fall into the below categories. If they are qualified with enough skills then no need for skill enhancement\n\nCandidates who Lack Experience\nHave had a break in careers\nLack Technical Competency\nDifferent visa candidates who want to get employed and settle down in the USA\n\nplease also check the below links\n\nhttps://www.synergisticit.com/candidate-outcomes/\n\nhttps://www.synergisticit.com/java-track/\n\nhttps://www.synergisticit.com/data-science-track/\n\nhttps://www.synergisticit.com/which-is-the-best-option-for-tech-job-seekers-staffing-companies-consulting-companies-bootcamps-or-synergisticit/\n\nhttps://www.synergisticit.com/contact-us/\n\nIf not a match candidates can opt for Skill enhancement\nREQUIRED SKILLS For java / Software Programmers\n• Bachelors degree or Masters degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, IT\n• Highly motivated, self-learner, and technically inquisitive\n• Experience in programming language Java and understanding of the software development life cycle\n• Knowledge of Core Java , javascript , C++ or software programming\n• Spring boot, Microservices and REST API's experience\n• Excellent written and verbal communication skills\nFor data Science/Machine learning\nREQUIRED SKILLS\n• Bachelors degree or Masters degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, IT\n• Highly motivated, self-learner, and technically inquisitive\n• Experience in programming language Java and understanding of the software development life cycle\n• Knowledge of Statistics, Python, data visualization tools\n• Excellent written and verbal communication skills\nPreferred skills: NLP, Text mining, Tableau, Time series analysis\nPlease understand skills are required by clients for selection even if its Junior or entry level position the additional skills are the only way a candidate can be picked by clients.\n\nNo third party candidates or c2c candidates\n\nPlease understand skills are required by clients for selection even if its Junior or entry level position the additional skills are the only way a candidate can be picked by clients.\n\nNo third party candidates or c2c candidates\nplease apply to the posting\n\nNo phone calls please. Shortlisted candidates would be reached out", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-02-07T08:00:00.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["Who Should Apply Recent IT Graduates looking to make their careers in IT Industry Candidates having basic knowledge or with one or two years of experience in JAVA, C++, Core JAVA", "Different visa candidates who want to get employed and settle down in the USA", "Bachelors degree or Masters degree in Computer Science, Computer Engineering, Electrical Engineering, Information Systems, IT", "Highly motivated, self-learner, and technically inquisitive", "Experience in programming language Java and understanding of the software development life cycle", "Knowledge of Core Java , javascript , C++ or software programming", "Excellent written and verbal communication skills", "Please understand skills are required by clients for selection even if its Junior or entry level position the additional skills are the only way a candidate can be picked by clients", "Who Should Apply Recent Computer science/Engineering /Mathematics/Statistics or Science Graduates looking to make their careers in IT Industry", "Spring boot, Microservices and REST API's experience", "For data Science/Machine learning", "Knowledge of Statistics, Python, data visualization tools"], "children": []}]}, {"data": "Benefits", "children": [{"data": "No benefits data available", "children": []}]}]}, {"data": "Strateos", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Scientific Data Automation Engineer", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://www.linkedin.com/jobs/view/scientific-data-automation-engineer-at-strateos-3498959737", "children": []}]}, {"data": "job_description", "children": [{"data": "We Are\n\nStrateos has reimagined laboratories as smart data generation centers with the industry’s first Cloud Lab Automation-as-a-Service Platform. Strateos enables scientists to design, run, and analyze experiments achieving new and faster scientific discoveries. Our mission is to create new knowledge driven by data, computation, artificial intelligence, automation software, and high-throughput robotics with the goal of fundamentally advancing the life sciences.\n• Our remote control and automated cloud labs are accessible from a web browser enabling\n• scientists around the world to easily access and control small and large molecule, cell and gene\n• therapy and synthetic biology workflows.\n• Our smart lab facility design-build services and lab automation software enables organizations\n• to control their own scientific instruments and laboratories locally and worldwide, schedule\n• workflows and manage their scientific data.\n\nWe Want\n\nWe are looking for a highly motivated Scientific Data Automation Engineer to join our team. In this role, you will facilitate handling of scientific data flows between different data platforms and develop novel tools in cheminformatics and bioinformatics space. The tasks will include writing scripts connecting different platforms via APIs, developing novel algorithms for data processing and decision making, establishing infrastructure for novel data workflows, train various stakeholders at Strateos in these emerging technologies, facilitate integration of developed algorithms into Strateos full-stack software. Excellent understanding of programming logic and various programming languages is essential in this role. Track record of developing experimental algorithms is necessary. Application of mathematical models and data processing scripts in orthogonal fields is important. A large variety of example scripts uploaded on GitHub is a plus. Preference will be given to candidates with experience in both algorithm development and effective communications.\n\nTechnical Skills\n• Understanding of relational and graph databases (Neo4j is a plus)\n• Experience in development of multi-actor data processing systems\n• Knowledge of building distributed systems, AI or machine learning\n• Demonstrated experience with at least one script language (Python preferred)\n• Experience in services scale up\n\nPeople Skills\n• Strong organizational skills\n• Ability to provide technical training\n• Ability to track multiple parallel projects\n• Ability to thrive in a team and goal driven environment\n• Excellent verbal and written communicator\n\nYou Have\n• A Bachelor’s or Master’s degree in Mathematics, Physics or Computer Sciences with 2-10 years of algorithm development experience OR PhD in Mathematics, Physics or\n• Computer Sciences with algorithm development experience\n• Demonstrated commitment to individual productivity in a fast-paced environment\n• Experience working as part of a diverse team\n• A passion for new automation and decision-making technologies\n\nYou May Have\n• Deep interest in learning drug development, robotic automation, chemistry, and biology\n• A collection of developed scripts in your personal GitHub account\n• Experience working with scientists and/or scientific algorithms\n• Knowledge of web backend and frontend programming\n\nYou Want\n• A challenging environment that will push you to grow and improve professionally, every\n• day\n• The ability to learn unique skills on the job\n• Freedom to work on state-of-the-art technology and real science\n• Ability to develop on one of the most advanced automated chemistry platforms on the\n• planet\n• Competitive salary and meaningful equity\n• Flexible vacation policy\n• Medical, dental, vision and life insurance\n• 401k matching\n\nStrateos is an equal opportunity employer", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-03T15:25:24.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["Excellent understanding of programming logic and various programming languages is essential in this role", "Track record of developing experimental algorithms is necessary", "Application of mathematical models and data processing scripts in orthogonal fields is important", "Preference will be given to candidates with experience in both algorithm development and effective communications", "Experience in development of multi-actor data processing systems", "Knowledge of building distributed systems, AI or machine learning", "Experience in services scale up", "Strong organizational skills", "Ability to provide technical training", "Ability to track multiple parallel projects", "Ability to thrive in a team and goal driven environment", "Excellent verbal and written communicator", "A Bachelor’s or Master’s degree in Mathematics, Physics or Computer Sciences with 2-10 years of algorithm development experience OR PhD in Mathematics, Physics or", "Demonstrated commitment to individual productivity in a fast-paced environment", "Experience working as part of a diverse team", "A passion for new automation and decision-making technologies", "Deep interest in learning drug development, robotic automation, chemistry, and biology", "A collection of developed scripts in your personal GitHub account", "Experience working with scientists and/or scientific algorithms", "Knowledge of web backend and frontend programming", "The ability to learn unique skills on the job", "Freedom to work on state-of-the-art technology and real science", "Ability to develop on one of the most advanced automated chemistry platforms on the"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["A challenging environment that will push you to grow and improve professionally, every", "Competitive salary and meaningful equity", "Flexible vacation policy", "Medical, dental, vision and life insurance", "401k matching"], "children": []}]}]}, {"data": "question", "children": [{"data": ["No questions available"], "children": []}]}, {"data": "min_sal", "children": [{"data": 87000, "children": []}]}, {"data": "max_sal", "children": [{"data": 135000, "children": []}]}, {"data": "med_sal", "children": [{"data": 120000, "children": []}]}]}, {"data": "software developer_san diego", "children": [{"data": "Jack in the Box", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Software Engineer I", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://www.ziprecruiter.com/c/Jack-in-the-Box/Job/Software-Engineer-I/-in-San-Diego,CA?jid=cfef1f35aa8e6da5", "children": []}]}, {"data": "job_description", "children": [{"data": "POSITION SUMMARY: Responsible for writing high quality performant software across the technologies that drive the brand's guest facing experiences. This position is also responsible for implementing Ci/CD, Infrastructure as Code, as well as Unit and Integration tests. This position is focused on growth and development of skills while determining career growth trajectory. Will also participate in production response activities helping to resolve bugs and outages.\n\nKEY DUTIES/RESPONSIBILITIES:\n\nUnderstands implementation tasks and assignments provided by tech lead and scrum master\n\nDevelops software to meet basic requirements provided by technical leadership\n\nProvides feedback and recommends changes to developer experience\n\nDevelops separate elements of software that work well in the program as a whole\n\nReads and understands diagrams and flowcharts for how applications are expected to work\n\nEnsures continued functionality of programs during maintenance and testing of software\n\nDocuments each aspect of a system or application as a reference for future upgrades and maintenance\n\nRevisits the development process to fix bugs or address client or consumer concerns\n\nParticipates in design sessions with architecture to create alignment on solution design\n\nParticipates in daily standup and other agile ceremony activities\n\nParticipates in incident response work, helping to resolve production issues in real time\n\nLearns and helps document best practices in the team's shared knowledge base\n\nImplements features within codebase in alignment with agreed upon designs\n\nParticipates in code reviews, both receiving and providing feedback\n\nPerforms other related duties, tasks, and responsibilities as required, assigned, and directed\n\nQUALIFICATIONS:\n\nEducation: Bachelors Degree or equivalent Intensive Coding Bootcamps in Software Development.\n\nExperience: 0-2 year of experience working with AWS Cloud based solutions. Experience with technical writing and configuration management preferred. 0-2 years of web software development experience, including systems design. 0-2 years of experience with service oriented architecture (SOA) or RESTful web services. 0-2 years of experience with web client-side application frameworks.\n\nSkills/Knowledge/Abilities:\n\nUnderstanding of Basic Database principles\n\nAbility to effectively test and document your own work\n\nObject Oriented Programming Skills\n\nAbility to prioritize and self manage work tasks\n\nAnticipate business needs and communicate/pitch new ideas\n\nBasic understanding of DevOps or CI/CD\n\nComfortable working in an agile environment\n\nExposure to infrastructure as code is a plus\n\nBasic understanding of Unit Testing\n\nExposure to basic software development tools such as an IDE/Debugger/etc.\n\nWillingness to participate in and learn from design and feedback sessions", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-26T03:29:00.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["Education: Bachelors Degree or equivalent Intensive Coding Bootcamps in Software Development", "Experience: 0-2 year of experience working with AWS Cloud based solutions", "0-2 years of web software development experience, including systems design", "0-2 years of experience with service oriented architecture (SOA) or RESTful web services", "0-2 years of experience with web client-side application frameworks", "Understanding of Basic Database principles", "Ability to effectively test and document your own work", "Object Oriented Programming Skills", "Ability to prioritize and self manage work tasks", "Anticipate business needs and communicate/pitch new ideas", "Basic understanding of DevOps or CI/CD", "Comfortable working in an agile environment", "Basic understanding of Unit Testing", "Exposure to basic software development tools such as an IDE/Debugger/etc", "Willingness to participate in and learn from design and feedback sessions"], "children": []}]}, {"data": "Benefits", "children": [{"data": "No benefits data available", "children": []}]}]}, {"data": "Alexandria Insights", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Software Engineer", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://www.indeed.com/viewjob?jk=dbca0d554eb01f13", "children": []}]}, {"data": "job_description", "children": [{"data": "Software Engineer\n\nThis position will provide System Engineering support to Unmanned Mission Control Station (UMCS) Team in support of Mission Control Station installation planning and work package developed for Unmanned Carrier Aviation (MQ-25) embarkable UMCS installations aboard U.S. Navy Aircraft Carriers (CVN) and shore based sites.\n\nThe UMCS is currently being designed and developed in an incremental approach, utilizing agile development practices. UMCS development will require the integration of multiple hardware and software products, as well as the application of systems engineering principles and practices.\n\nLead a small team supporting the MQ-25 ground station using Agile methods.\n\nDevelop, review, and trace program requirements documentation.\n\nAnalyze program requirements and work within a team of other software developers/engineers contributing to aspects of software design.\n\nComplete system design, develop requirements, assist with software integration efforts, aid in troubleshooting defects, and plan design enhancements.\n\nKnowledge of systems engineering techniques, project scheduling, risk management, configuration management, and SETR and Agile methods.\n\nDesired qualifications:\n\nSeven (7) or more years with NAVAIR/NAVWAR software development processes\n\nSeven (7) or more years with Naval Modernization process in particular Ship Change Document (SCD) and Ship Installation Drawing (SIDS).\n\nSeven (7) or more years with requirements documentation, including model based system engineering.\n\nFamiliarity with Mobile/Embarkable Systems\n\nFamiliarity with Naval Facilities Command (NAVFAC) Shore installation process.\n\nEducation: Bachelor's Degree in Computer Science or Engineering and advanced technical degree from an accredited College or University\n\nSecret Clearance Required\n\nSalary Range - $125,000 to $150,000\n\nAlexandria Insights is a Service-Disabled Veteran-Owned Small Business, dedicated to helping customers effectively and efficiently use technology to solve significant problems. If you are self-motivated, entrepreneurial, hard-working, and want to get in on the ground floor of a growing small company, please submit your resume. Alexandria Insights is an EEO/AA/Disability/Vets Employer. We consider applicants for all positions without regard to race, color, religion, creed, gender, marital status, veteran status, national origin, age, sexual orientation, disability, or any other legally protected status. Alexandria Insights will provide reasonable accommodations for individuals who are unable to use the online system to apply due to a disability.\n\nIEpwFNs4ok", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-25T23:32:28.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["Knowledge of systems engineering techniques, project scheduling, risk management, configuration management, and SETR and Agile methods", "Seven (7) or more years with NAVAIR/NAVWAR software development processes", "Seven (7) or more years with requirements documentation, including model based system engineering", "Familiarity with Mobile/Embarkable Systems", "Familiarity with Naval Facilities Command (NAVFAC) Shore installation process", "Education: Bachelor's Degree in Computer Science or Engineering and advanced technical degree from an accredited College or University"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["Salary Range - $125,000 to $150,000"], "children": []}]}]}, {"data": "San Diego County Credit Union", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Senior Software Developer", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://www.linkedin.com/jobs/view/senior-software-developer-at-san-diego-county-credit-union-3529990346", "children": []}]}, {"data": "job_description", "children": [{"data": "Requisition #: 3367\n\nThis is a non-remote position and will require that the employee report to work onsite at the designated work location.\n\nRequired Schedule:\n\nMonday-8:00am - 5:00pm\n\nTuesday-8:00am - 5:00pm\n\nWednesday-8:00am - 5:00pm\n\nThursday-8:00am - 5:00pm\n\nFriday-8:00am - 5:00pm\n\nSaturday-Off\n\nSunday-Closed\n\nPosition Summary\n\nThe Senior Software Developer role is responsible for designing, programming, testing, and launching software for the Core Systems of the Credit Union. This role is also responsible for integration and configuration of new products and enhancements. This includes enhancements, as well as having responsibility in the evaluation, configuration, and implementation of new applications and systems to optimize efficiencies within the core banking solutions. This position is also accountable for providing development and operational support to other development resources. Maintain high quality service and production standards as set by the organization.\n\nEssential Duties And Responsibilities\n• Determine technical feasibility and design solutions that meet software and security requirements.\n• Actively participates in planning, design, programming, testing, documentation, and support of the integrations for core banking platform.\n• Conducts a full range of programming tasks, including design, development, debugging and documentation.\n• Develops reports and automation through use of Symitar’s PowerOn, batch scripts, shell scripts, Python, SQL and other appropriate programming languages.\n• Maintains coding best practices and conducts peer code reviews.\n• Review project requests describing system user needs to estimate time and cost requirements; work with team to coordinate system development and determine project scope and limitations\n• Participates in programming support rotation.\n• Performs UNIX scripting as requested.\n• Develops and provides programming support for various API’s\n• Provide after-hours on-call support for programming related issues.\n• Participates in AML/BSA/MISP/Ethics for CU/Sexual Harassment compliance training as assigned. Adhere to credit union AML/BSA policy and procedures including CTR rules and form preparation, identify and refer suspicious activity to the Compliance Department, perform OFAC comparisons, and properly identify individuals in accordance with Branch Operations procedures.\n\nOther Duties And Responsibilities\n• Perform other duties as assigned.\n\nPhysical Demands and Work Environment\n\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n\nWhile performing the duties of this job, the employee is regularly required to sit. The employee is required to talk or hear. The employee is occasionally required to stand; walk; use hands to finger, handle, or feel objects, tools, or controls; reach with hands and arms; and stoop, kneel, crouch, or crawl.\n\nThe employee must occasionally lift and/or move up to 25 pounds. Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and the ability to adjust focus.\n\nThe noise level in the work environment is usually moderate.\n\nMinimum Qualifications (Education, Experience, Skills)\n• Certificate or AA Degree or BA/BS in Computer Science or 8 years equivalent work experience.\n• Minimum 6 years of technical experience in software development.\n• Working knowledge of multiple programming languages.\n• Effective organizational, analytical, written, and verbal communication skills.\n• Working knowledge of UNIX/AIX and T-SQL coding.\n• Ability to multi-task and meet project milestones/deadlines.\n• Experience working in a team-oriented, collaborative environment\n• Working knowledge in .NET, JavaScript, MySQL/SQL frameworks, HTML/XML, and Python.\n• Experienced in Agile Development and SDLC is required.\n• Effective documentation skills.\n• Ability to assist and train others.\n• Ability to learn new skills and assume new responsibilities.\n• Jack Henry/Symitar Episys experience is a plus.\n• Code promotion using source control tools like Visual Studio, GitHub, Team Foundation Server and Azure DevOps Server is a plus.\n\nIn addition to being the best credit union in San Diego and Southern California, we also offer awesome benefits and lots of growth opportunities, here are some of the amazing benefits we offer:\n• Medical: SDCCU pays a large portion of the full time employee premium\n• Dental and Vision: Full-time employee premiums 100% company paid\n• Company paid Long Term Disability and Life Insurance\n• Supplemental Life Insurance and other Voluntary Benefit Plans\n• Company paid Employee Assistance Program (EAP)\n• 401(k) Salary Savings Plan with generous SDCCU contribution\n• Up to 11 paid holidays per year\n• Career advancement/internal promotion opportunities – 228 employees promoted in 2021\n• Tuition Reimbursement Program\n• Degree Completion Bonus\n• Employee Referral Program\n• Discounts on events and entertainment\n• Paid Time Off\n• 5 mandatory consecutive days off every year (To help you re-charge)\n• Casual dress at the Operations and Call Centers; business casual for branch staff\n• No nights or Sundays for most positions\n• Annual wellness reimbursement\n• On-site gym for Operations Center employees\n\nPay Scale: $96,950.00-$131,150.00 (Annual)", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-17T21:58:47.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["The employee must occasionally lift and/or move up to 25 pounds", "Specific vision abilities required by this job include close vision, distance vision, color vision, peripheral vision, depth perception, and the ability to adjust focus", "Certificate or AA Degree or BA/BS in Computer Science or 8 years equivalent work experience", "Minimum 6 years of technical experience in software development", "Working knowledge of multiple programming languages", "Effective organizational, analytical, written, and verbal communication skills", "Working knowledge of UNIX/AIX and T-SQL coding", "Ability to multi-task and meet project milestones/deadlines", "Experience working in a team-oriented, collaborative environment", "Working knowledge in .NET, JavaScript, MySQL/SQL frameworks, HTML/XML, and Python", "Experienced in Agile Development and SDLC is required", "Effective documentation skills", "Ability to assist and train others", "Ability to learn new skills and assume new responsibilities"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["Medical: SDCCU pays a large portion of the full time employee premium", "Dental and Vision: Full-time employee premiums 100% company paid", "Company paid Long Term Disability and Life Insurance", "Supplemental Life Insurance and other Voluntary Benefit Plans", "Company paid Employee Assistance Program (EAP)", "401(k) Salary Savings Plan with generous SDCCU contribution", "Up to 11 paid holidays per year", "Career advancement/internal promotion opportunities – 228 employees promoted in 2021", "Tuition Reimbursement Program", "Degree Completion Bonus", "Employee Referral Program", "Discounts on events and entertainment", "Paid Time Off", "5 mandatory consecutive days off every year (To help you re-charge)", "Casual dress at the Operations and Call Centers; business casual for branch staff", "No nights or Sundays for most positions", "Annual wellness reimbursement", "On-site gym for Operations Center employees", "Pay Scale: $96,950.00-$131,150.00 (Annual)"], "children": []}]}]}, {"data": "Apple", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Media Experience Software Engineer", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://www.ziprecruiter.com/c/Apple/Job/Media-Experience-Software-Engineer/-in-San-Diego,CA?jid=7b42b587bb9b0dba", "children": []}]}, {"data": "job_description", "children": [{"data": "Summary Posted: Apr 21, 2023\nWeekly Hours: 40\nRole Number:200473902\n\nAt Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. To help Apple get there, the Connected Media software team is seeking a self-motivated Software Engineer to ensure a stellar Media Experience across the entire Apple Ecosystem. Do you bring passion and dedication to your job? If yes, we are looking for individuals like you. This team is a part of the Audio and Media Technologies group (AMT) that provides the media and audio foundation across all of Apple's innovative products including iPhone, iPad, Apple Watch, AppleTV, HomePod, Mac and the AirPod/Beats line of Products. The team has played a major role in delivering some of the recent exciting features such as automatic AirPods switching devices, Picture-In-Picture, HomePod as permanent speaker for Apple TV, AirPlay2, SharePlay, Microphone usage reporting and customized haptics and audio feedback for apps. As a member of this team, you will have an outstanding opportunity to work across all Apple products and play a central role in the audio software stack. As part of middleware, we interpret an application's desired audio behavior and configure the underlying audio stack accordingly. Working in conjunction with design and other engineering teams, we are in charge of all the audio routing and system policies that impact user behavior as defined here: https://developer.apple.com/design/human-interface-guidelines/ios/user-interaction/audio/ (https://developer.apple.com/design/human-interface-guidelines/ios/user-interaction/audio/).\nKey Qualifications\n• Excellent programming skills with knowledge of C/C++ or Objective-C\n• Knowledge of computer architecture, multi-threading and high-level operating systems\n• Proficient in debugging problems in a large code base\n• Produce good quality work under tight schedules and rapid development cycles\n\nDescription\nThe Connected Media team is looking for a software engineer with strong technical, programming, debugging and analytical skills. You will be involved in all stages of developing ground breaking features as well as supporting our existing ecosystem.\n\nEducation & Experience\nBS/MS in Computer Science or equivalent\n\nAdditional Requirements\n• ADDITIONAL REQUIREMENTS (NICE TO HAVE, BUT NOT REQUIRED):\n• 3+ years industry experience\n• Experience working in audio or media software stacks\n• Debugging sophisticated problems in a highly concurrent environments\n• Ability to work with designers and recommend behavioral policies based on hardware and software capabilities and limitations\n• Ability to work with quality engineers to develop test plans for new features\n• A track record of designing and building architectural platforms that hold up over time to the addition of new features and hardware platforms\n\nPay & Benefits\n• At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $95,000 and $177,000 annualized, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-24T16:15:32.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["Excellent programming skills with knowledge of C/C++ or Objective-C", "Knowledge of computer architecture, multi-threading and high-level operating systems", "Proficient in debugging problems in a large code base", "BS/MS in Computer Science or equivalent", "ADDITIONAL REQUIREMENTS (NICE TO HAVE, BUT NOT REQUIRED):", "3+ years industry experience", "Experience working in audio or media software stacks", "Debugging sophisticated problems in a highly concurrent environments", "Ability to work with designers and recommend behavioral policies based on hardware and software capabilities and limitations", "Ability to work with quality engineers to develop test plans for new features", "A track record of designing and building architectural platforms that hold up over time to the addition of new features and hardware platforms"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["Pay & Benefits", "At Apple, base pay is one part of our total compensation package and is determined within a range", "The base pay range for this role is between $95,000 and $177,000 annualized, and your base pay will depend on your skills, qualifications, experience, and location", "You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition", "Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation"], "children": []}]}]}, {"data": "Brain Corp", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Senior Software Engineer", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://braincorp.com/company/careers/job/?id=6618642002", "children": []}]}, {"data": "job_description", "children": [{"data": "We are Brain Corp and we enable smarter operations. We set out to create the most intelligent tools ever, and now we power the world’s largest fleet of robots operating in commercial public spaces. By injecting intelligence into our customers' operations, we transform manual operations into automated workflows, making the lives of people safer, easier and more productive. Our robots are running around thousands of stores, schools, warehouses, hospitals, offices, airports and more, solving practical challenges with revolutionary solutions. For more information on how we are turning robots into tools that serve a purpose and to learn how you can become a brainiac, please visit: https://www.braincorp.com/.\n\nPosition Summary:\n\nHave you ever had an online order canceled because something was out of stock or wasted time going to a store to look at something the website said was available only to find out that it was not? This is the problem we are trying to help our retail customers solve to maximize shopper experience and on shelf availability.\n\nAs a Senior Software Engineer on the Software Engineering Applications team, you will be part of a fast-paced team that is pioneering products built on our BrainOS platform to revolutionize the Retail Inventory Analytics Space. You naturally take ownership over feature and project outcomes that span multiple components or individual tasks. You often participate in technical decision making and provide guidance to junior team members in design and implementation details. You thrive in solving complex software systems and challenging technical problems that are not straightforward.\n\nOur robotic solutions integrate multiple hardware and software disciplines in order to provide scalable solutions for our customers. For example, we get to think about how to apply autonomous navigation, camera configurations, and data pipeline workflows to ensure that the highest quality images are captured so that inventory insights through computer vision can be realized by our customers. While this job is highly technical, and being a top code-contributor is expected, this role is expected to be involved in discussions across teams, ensuring scalable system designs and implementations, and having deep understanding of product and customer use cases.\n\nDuties and Responsibilities:\n• Designing, developing and implementing complex software systems in application level code.\n• Mentoring junior engineers, providing technical guidance and driving best practices for code development, review, testing, and deployment that will ensure high quality software releases.\n• Participating in technical decision making, project planning, and technical roadmapping in coordination with Product, Program, and engineering Management.\n• Identifying and fixing software bugs to improve system performance and production quality.\n• Ensuring software is reliable, scalable and maintainable.\n\nWhat you need:\n• BS or MS in Computer Science or applicable engineering discipline.\n• 5 years (suggested) of demonstrated experience in software development for complex function-based software that interacts with sensor inputs, control loops and redundancy.\n• Demonstrated proficiency with OOO implementation in C++ and/or Python production level coding.\n• Demonstrated experience leading, mentoring and developing mid-size software engineering teams in a fast-paced environment.\n• Delivered complete software products that meet rigorous functional safety-critical requirements.\n• Demonstrated experience being part of agile (scrum) development teams and tailoring processes to maximize team’s productivity and efficiency.\n• Excellent technical and analytical skills across different types of data sets.\n• Excellent communication skills across verbal, visual and written forms.\n\nThings that make a difference:\n• Experience in autonomous vehicles, robotics, or related industry.\n• Experience with robotic motion planning, perception, or SLAM\n• Experience in IOT, Data Analytics and Machine Learning.\n• Disciplined to stay up to date on new technologies and development trends.\n\nPhysical Demands:\n\nThe physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Essential functions may require maintaining the physical condition necessary for sitting, walking or standing for periods of time; operating a computer and keyboard; talk and hear at normal room levels; using hands to finger, and grasp; repetitive motion; close visual acuity to prepare and analyze data and figures; transcribing; viewing a computer terminal; extensive reading; visual inspection involving small defects, small parts, and/or operation of machines; use of measurement devices; and/or assembly or fabrication parts at distances close to the eyes; push or pull up to 10 pounds.\n\nWork Environment:\n\nThe work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. The noise level in the work environment is usually quiet to moderate. Employees are exposed to the typical office environment with computers, printers and telephones.\n\nSalary Range:\n\nThe anticipated salary range for candidates who will work in San Diego, California is $136,500 to $143,325. The final salary offered to a successful candidate will be dependent on several factors that may include but are not limited to the type and length of experience within the job, type and length of experience within the industry, education, etc. Brain Corp is a multi-state employer and this salary range may not reflect positions that work in other states.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-02-14T00:00:00.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["BS or MS in Computer Science or applicable engineering discipline", "5 years (suggested) of demonstrated experience in software development for complex function-based software that interacts with sensor inputs, control loops and redundancy", "Demonstrated proficiency with OOO implementation in C++ and/or Python production level coding", "Demonstrated experience leading, mentoring and developing mid-size software engineering teams in a fast-paced environment", "Delivered complete software products that meet rigorous functional safety-critical requirements", "Demonstrated experience being part of agile (scrum) development teams and tailoring processes to maximize team’s productivity and efficiency", "Excellent technical and analytical skills across different types of data sets", "Excellent communication skills across verbal, visual and written forms", "Experience in autonomous vehicles, robotics, or related industry", "Experience with robotic motion planning, perception, or SLAM", "Experience in IOT, Data Analytics and Machine Learning", "Disciplined to stay up to date on new technologies and development trends", "Essential functions may require maintaining the physical condition necessary for sitting, walking or standing for periods of time; operating a computer and keyboard; talk and hear at normal room levels; using hands to finger, and grasp; repetitive motion; close visual acuity to prepare and analyze data and figures; transcribing; viewing a computer terminal; extensive reading; visual inspection involving small defects, small parts, and/or operation of machines; use of measurement devices; and/or assembly or fabrication parts at distances close to the eyes; push or pull up to 10 pounds"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["The anticipated salary range for candidates who will work in San Diego, California is $136,500 to $143,325", "The final salary offered to a successful candidate will be dependent on several factors that may include but are not limited to the type and length of experience within the job, type and length of experience within the industry, education, etc"], "children": []}]}]}, {"data": "Fitbit", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Senior Software Engineer, Mobile (Android), Fitbit", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://careers.google.com/jobs/results/80589754254402246-senior-software-engineer-mobile-android-fitbit/?company=Fitbit", "children": []}]}, {"data": "job_description", "children": [{"data": "Google's software engineers develop the next-generation technologies that change how billions of users connect, explore, and interact with information and one another. Our products need to handle information at massive scale, and extend well beyond web search. We're looking for engineers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a software engineer, you will work on a specific project critical to Google’s needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our engineers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.\n\nWith your technical expertise you will manage project priorities, deadlines, and deliverables. You will design, develop, test, deploy, maintain, and enhance software solutions.\n\nFitbit’s wide range of innovative products, including smartwatches, trackers, and a smart scale, help people lead healthier, more active lives by empowering them with data, inspiration, and guidance to reach their health and fitness goals. Coupled with our leading software and Fitbit Premium, our immersive platform experience delivers personalized experiences, insights, and guidance to support our users’ health and wellness. Fitbit’s mission has always been to help make everyone in the world healthier and now, as part of Google we’ll be able to make health even more accessible to everyone.\n\nThe US base salary range for this full-time position is $157,000-$235,000 + bonus + equity + benefits. Our salary ranges are determined by role, level, and location. The range displayed on each job posting reflects the minimum and maximum target for new hire salaries for the position across all US locations. Within the range, individual pay is determined by work location and additional factors, including job-related skills, experience, and relevant education or training. Your recruiter can share more about the specific salary range for your preferred location during the hiring process.\n\nPlease note that the compensation details listed in US role postings reflect the base salary only, and do not include bonus, equity, or benefits. Learn more about benefits at Google.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-21T18:01:05.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": "No Qualifications data available", "children": []}]}, {"data": "Benefits", "children": [{"data": ["The US base salary range for this full-time position is $157,000-$235,000 + bonus + equity + benefits", "Our salary ranges are determined by role, level, and location"], "children": []}]}]}, {"data": "L3Harris Technologies", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Sr. Specialist, Software Engineer", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://www.monster.com/job-openings/sr-specialist-software-engineer-san-diego-ca--dfdcd265-f83a-42a1-858f-47af799b5bf0", "children": []}]}, {"data": "job_description", "children": [{"data": "Description:\n\nSr. Specialist, Software Engineering Embedded C/C++ Java\nJob Code: SAS20220811-93158\nJob Location: San Diego, CA\n\nJob Description:\n\nAt L3Harris, software engineers have incredible opportunities to grow in their career and work on exciting projects that impacts people’s lives around the world. We cultivate innovation and welcome people from different backgrounds and experiences who can bring new ideas to the table. The software engineers get to experience and see the full life cycle of system development from concept to execution and finished product. We are very excited for new opportunities in the industry and we are growing our team to meet the demand. We are looking for talented engineers who are passionate about their work and thrive on intellectual curiosity and working in a diverse team of engineers.\n\nEnjoy success as a member of a dynamic engineering team developing cutting edge systems for the space and airborne industry. As part of this fast growing team of engineers, you will develop applications in support of space superiority, command and control, geospatial and other exciting domains.\n\nAs an engineer, you will participate in a development team that uses agile methodologies combined with mature software practices and a technology-supported development infrastructure. You will develop software and use enabling technologies to implement new capabilities and extend existing capabilities. You will help develop and maintain the deployed system, diagnose and resolve issues, and provide support to end-users as needed. Efforts can include working on a program into the maintenance or sustainment phase. As a member of the software development organization, you will execute all development processes and help mature those processes over time.\n\nEssential Functions:\n• * Member of the embedded software development team.\n• * Support software requirements analysis and use case development.\n• * Work effectively with minimal supervision.\n• * Perform software design and rapid prototyping.\n• * Implement software per requirements and design guidelines.\n• * Participate and present in design and code reviews.\n• * Perform unit, integration and system test activities.\n• * Investigate and address reported software issues.\n• * Support product documentation activities.\n• * Direct customer contact at customer site, on premises or remote.\n• * Interface with customers to support existing operations, and manage reported issues.\n• * Interface with customers to identify unmet needs and potential solutions.\n• * Understand software engineering principles, processes, and industry best practices with the ability to apply them in daily work.\n• Qualifications:\n• * Bachelor’s Degree and minimum 6 years of prior relevant experience or Graduate Degree and a minimum of 4 years of prior related experience.\n• * Experience with embedded systems, including multiple processors\n• * Experience with C/C++ and Java\n• * Experience working with low level data (bit manipulation) and memory management\n• * Experience with multi-threading and locks in C/C++ and Java\n• * Experience with object-oriented design concepts and techniques\n• * Secret Security Clearance\n• Preferred Additional Skills:\n• * Experience with unit testing, stress testing and integration/end-user testing.\n• * Familiarity with Linux, Windows, and Real Time Operating Systems\n• * Familiarity with the space domain is a plus.\n• * Experience with cryptographic functions.\n• * Active TS/SCI security clearance\n• In compliance with pay transparency requirements, the salary range for this role is $105,500 - $195,500. This is not a guarantee of compensation or salary, as final offer amount may vary based on factors including but not limited to experience and geographic location. L3Harris also offers a variety of benefits, including health and disability insurance, 401(k) match, flexible spending accounts, EAP, education assistance, parental leave, paid time off, and company-paid holidays. The specific programs and options available to an employee may vary depending on date of hire, schedule type, and the applicability of collective bargaining agreements.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-24T03:37:14.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["Bachelor’s Degree and minimum 6 years of prior relevant experience or Graduate Degree and a minimum of 4 years of prior related experience", "Experience with embedded systems, including multiple processors", "Experience working with low level data (bit manipulation) and memory management", "Experience with multi-threading and locks in C/C++ and Java", "Experience with object-oriented design concepts and techniques", "Secret Security Clearance", "Experience with unit testing, stress testing and integration/end-user testing", "Familiarity with Linux, Windows, and Real Time Operating Systems", "Experience with cryptographic functions"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["In compliance with pay transparency requirements, the salary range for this role is $105,500 - $195,500", "This is not a guarantee of compensation or salary, as final offer amount may vary based on factors including but not limited to experience and geographic location", "L3Harris also offers a variety of benefits, including health and disability insurance, 401(k) match, flexible spending accounts, EAP, education assistance, parental leave, paid time off, and company-paid holidays", "The specific programs and options available to an employee may vary depending on date of hire, schedule type, and the applicability of collective bargaining agreements"], "children": []}]}]}, {"data": "FTP of California", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Software Developer", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://www.linkedin.com/jobs/view/software-developer-at-ftp-of-california-3578290357", "children": []}]}, {"data": "job_description", "children": [{"data": "About the Company:\n\nFTP of California is part of FTP Inc, an independently owned and operated insurance MGU. FTP represents non-admitted insurance companies and offers insurance programs nationwide, including commercial property, casualty, and excess.\n\nIn addition to competitive compensation and benefits, we offer a flexible/hybrid work environment, and the opportunity to join a team of experts. We all work hard, play hard, and see the growth of this company as an exciting challenge and an opportunity to create a strong, healthy organization where listening and feedback are encouraged.\n\nJob Description\n\nWe are looking for a motivated, energetic, and experienced mid-level software developer who is self-motivated, loves to learn, build, and work collaboratively.\n\nIn this role, you will work closely with the Director of Development to maintain a Proof-of-Concept existing web application, while designing and building the next major version from the ground up using the latest technologies.\n\nIf you’re looking for the opportunity to build innovative technologies, to drive and impact the platform’s technical direction, and contribute across the stack, this is a perfect fit.\n\nRoles and Responsibilities\n• Play a key role in developing web applications using C#/.NET/.NET Core.\n• Take part in all stages of the SDLC, from design and development to testing and deployments.\n• Support new and existing web applications.\n• Suggest best practices, and implementation strategies using .Net technology.\n• Implement code changes and documenting software system changes.\n• Identify and propose software development process improvement initiatives.\n• Use Integrated Development Environment (IDE) tools to include Visual Studio, VSCode and Git command line.\n\nSkills\n• 5+ years of experience working with C# and .Net core.\n• 3+ years of experience with RDBMS and SQL (MSSQL).\n• Demonstrated real world experience in multi-tier application development.\n• Working knowledge of Cloud (Preferably Azure).\n• Understanding of object relational mapping preferably including the persistence API and the use of corresponding frameworks.\n• Experience with Web API and RESTful APIs.\n• Well versed in the use of version control systems such as Git.\n• Knowledge of NUnit or other unit testing framework.\n• Initiative to continuously upgrade technical skills, to understand and influence architecture and supporting infrastructure.\n• Computer Science, MIS or related degree preferred.\n• Excellent communication skills.\n• Bonus if professional experience using JavaScript frameworks/libraries (Vue.js, React, etc.).\n• Bonus if professional experience using NoSql.\n\nYou’ll fit here if…\n• You’re eager to discuss architecture of code and systems you’re working on but also are mindful of finding the most efficient way to solve the company’s challenges.\n• You have been known to dive into problems and solve them when others couldn’t or didn’t want to.\n• You have a drive to create bug free code and when things go wrong you ask yourself how to prevent those things in the future.\n• You love to talk about technology with other co-workers and friends.\n• You focus on solutions, not on blame or shame.\n• You create software that you yourself would use.\n\nSalary: $100,000-$140,000 depending on experience\n\nJob Type: Full-time\n\nLocation: San Diego, CA (Hybrid, in office 2-3 days/week)\n\nBenefits:\n• 401k match\n• Dental Insurance\n• Health Insurance\n• Vision Insurance\n• Parental leave\n• Life and Disability Insurance\n• Flexible schedule\n\nEqual Opportunity Employer: As an Equal Opportunity Employer, employment decisions at FTP of California are made without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other legally protected characteristic.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-20T22:41:03.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["5+ years of experience working with C# and .Net core", "3+ years of experience with RDBMS and SQL (MSSQL)", "Demonstrated real world experience in multi-tier application development", "Working knowledge of Cloud (Preferably Azure)", "Understanding of object relational mapping preferably including the persistence API and the use of corresponding frameworks", "Experience with Web API and RESTful APIs", "Well versed in the use of version control systems such as Git", "Knowledge of NUnit or other unit testing framework", "Initiative to continuously upgrade technical skills, to understand and influence architecture and supporting infrastructure", "Excellent communication skills", "Bonus if professional experience using JavaScript frameworks/libraries (Vue.js, React, etc.)", "You’re eager to discuss architecture of code and systems you’re working on but also are mindful of finding the most efficient way to solve the company’s challenges", "You have been known to dive into problems and solve them when others couldn’t or didn’t want to", "You have a drive to create bug free code and when things go wrong you ask yourself how to prevent those things in the future", "You love to talk about technology with other co-workers and friends", "You focus on solutions, not on blame or shame"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["Salary: $100,000-$140,000 depending on experience", "401k match", "Dental Insurance", "Health Insurance", "Vision Insurance", "Parental leave", "Life and Disability Insurance", "Flexible schedule"], "children": []}]}]}, {"data": "Epsilon", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Senior Software Engineer", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://www.salary.com/job/epsilon/senior-software-engineer/j202304230138300107092", "children": []}]}, {"data": "job_description", "children": [{"data": "Job Description:\nJob Description\nJob Description\n\nThe Senior Software Developer will be a key technical contributor in developing new digital platform features and applications. They will work closely with technical leadership and product owners as part of the agile scrum development team to design and implement technical solutions critical to Epsilon's digital roadmap objectives. This is an active code development and implementation contributor role.\n\nYou'll be part of a talented, passionate development team working in an agile development environment. The team is driving technology development of digital products for Epsilon, which includes but is not limited to search and social product and technology initiatives.\n\nRole Requirements\n• 6 years of software development experience\n• Java/Spring/Spring Boot development experience\n• Python and Flask development experience\n• Multithreading implementation experience\n• Experience creating and consuming API REST service endpoints\n• Experience in relational database schema design and executing complex SQL queries\n• Oracle experience desired, though significant experience utilizing other platforms will be considered (e.g. MySQL)\n• Good understanding and utilization of software design patterns\n• Excellent communicator to senior engineering leadership as well as within the software development team in driving product/feature design and implementation\n• Positive team player and works well within an Agile development environment\n\nDesired Experience but not necessary\n• NoSQL understanding and design experience (MongoDB, Oracle NoSQL, and/or other NoSQL variants)\n• Cloud development and deployment scheme experience (AWS, Azure, and/or Google Cloud)\n\nSalary Range: $110,000 - $130,000\n\nAdditional Information\n\nWhen you're one of us, you get to run with the best. For decades, we've been helping marketers from the world's top brands personalize experiences for millions of people with our cutting-edge technology, solutions and services. Epsilon's best-in-class identity gives brands a clear, privacy-safe view of their customers, which they can use across our suite of digital media, messaging and loyalty solutions. We process 400 billion consumer actions each day and hold many patents of proprietary technology, including real-time modeling languages and consumer privacy advancements. Thanks to the work of every employee, Epsilon has been consistently recognized as industry-leading by Forrester, Adweek and the MRC. Positioned at the core of Publicis Groupe, Epsilon is a global company with more than 8,000 employees around the world. Check out a few of these resources to learn more about what makes Epsilon so EPIC:\n• Culture: https://www.epsilon.com/us/about-us/our-culture-epsilon\n• DE&I: https://www.epsilon.com/us/about-us/diversity-equity-inclusion\n• CSR: https://www.epsilon.com/us/about-us/corporate-social-responsibility\n• Life at Epsilon: https://www.epsilon.com/us/about-us/epic-blog\n\nGreat People Deserve Great Benefits\n\nWe know that we have some of the brightest and most talented associates in the world, and we believe in rewarding them accordingly. If you work here, expect competitive pay, comprehensive health coverage, and endless opportunities to advance your career.\n\nEpsilon is an Equal Opportunity Employer. Epsilon's policy is not to discriminate against any applicant or employee based on actual or perceived race, age, sex or gender (including pregnancy), marital status, national origin, ancestry, citizenship status, mental or physical disability, religion, creed, color, sexual orientation, gender identity or expression (including transgender status), veteran status, genetic information, or any other characteristic protected by applicable federal, state or local law. Epsilon also prohibits harassment of applicants and employees based on any of these protected categories.\n\nEpsilon will provide accommodations to applicants needing accommodations to complete the application process.\n\n#LI-TL1\n\nREF194675W\nReport this job\n• Dice Id: appblok\n• Position Id: 21027_27f953d3-88f9-4694-8391-6b04c2b8038a\n• Are you interested in this job? Please apply from Salary.com\n\nJob ID: j202304230138300107092\n\nRecommended Job Skills: Bug/Defect Analysis, Debugging\n\nAverage Estimate Salary for a Senior Software Engineer: $122,002 to $148,796\n\nThis data is calculated using netizen feedback data. To get the most accurate number for your company jobs in your locations, use our subscription products: https://www.salary.com/companalyst/.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-24T00:00:00.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["6 years of software development experience", "Java/Spring/Spring Boot development experience", "Python and Flask development experience", "Multithreading implementation experience", "Experience creating and consuming API REST service endpoints", "Experience in relational database schema design and executing complex SQL queries", "Good understanding and utilization of software design patterns", "Excellent communicator to senior engineering leadership as well as within the software development team in driving product/feature design and implementation", "Positive team player and works well within an Agile development environment"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["Salary Range: $110,000 - $130,000", "If you work here, expect competitive pay, comprehensive health coverage, and endless opportunities to advance your career", "Average Estimate Salary for a Senior Software Engineer: $122,002 to $148,796"], "children": []}]}]}, {"data": "UC San Diego", "children": [{"data": "job_employment_type", "children": [{"data": "FULLTIME", "children": []}]}, {"data": "job_title", "children": [{"data": "Senior .NET Software Engineer (Remote) - 119553", "children": []}]}, {"data": "job_apply_link", "children": [{"data": "https://employment.ucsd.edu/senior-net-software-engineer-remote-119553/job/21460808", "children": []}]}, {"data": "job_description", "children": [{"data": "Payroll Title:\nAPPLICATIONS PROGR 4 Department:\nINFORMATION TECHNOLOGY SVCS Hiring Pay Scale\n$95,000 - $115,500 / Year Worksite:\nHybrid Remote Appointment Type:\nContract Appointment Percent:\n100% Union:\nUncovered Total Openings:\n1 Work Schedule:\nDays, 8 hrs/day, Mon-Fri\n\n#119553 Senior .NET Software Engineer (Remote)\nInitial Review Date: Mon 12/5/2022\nApply Now\n\nUC San Diego values equity, diversity, and inclusion. If you are interested in being part of our team, possess the needed licensure and certifications, and feel that you have most of the qualifications and/or transferable skills for a job opening, we strongly encourage you to apply.\n\nFor the safety and well-being of the entire university community, the University of California requires, with few exceptions, that all students, faculty and staff be vaccinated against the COVID-19 virus and influenza before they will be allowed on campus or in a facility or office. For more information visit: Flu Vaccine Mandate / COVID Vaccine Policy\n\nThis is a Contract/Limited position. This appointment may be extended or converted to career status based on the needs of the department.\n\nUC San Diego Policy will not allow this position to receive work visa sponsorship.\n\nFully remote or Hybrid work will be considered.\n\nDESCRIPTION\n\nUC San Diego is ranked the 9th best public university in the nation by U.S. News and World Report and is the largest employer based in San Diego County. Reporting to the VC-CFO, Information Technology Services (ITS) delivers Enterprise information technology services to the University of California, San Diego (UCSD) under the leadership of the campus Chief Information Officer (CIO). Information Technology Services (IT Services) uses world-class services and technologies to empower UC San Diego's mission to transform California and the world as a student-centered, research-focused, service-oriented public university. As a strategic member of the UC San Diego community, IT Services embraces innovation in their delivery of IT services, infrastructure, applications, and support. IT Services is customer-focused and committed to collaboration, continuous improvement, and accountability.\n\nEquity, Diversity, and Inclusion are core values at UC San Diego and within Information Technology Services. Crafting a culture around these values allows us to more deeply connect with and appreciate our employees, students, and campus partners. Information Technology Services is continuously working to build a community where we all feel safe, empowered, and encouraged to bring our authentic selves to work. We do this not only because it is what’s right, but because we know that diversity drives insight and innovation. We are proud to partner closely UC San Diego’s Office for Equity, Diversity, and Inclusion, as their dedication to this mission helps us all to drive change.\n\nBusiness Technology Services, a division of IT Services, provides enterprise solutions and application development for the UC San Diego community. We deliver quality and reliable systems and services that help our campus continuously improve business processes. Our combined technical resources allow us to build, integrate, host, and deliver campus-wide enterprise systems for both our campus and collaboratively with other campuses within the UC system. Additionally, the team offers custom integration and application development services, business analysis services and data management services for a variety of departments on the campus.\n\nThe Application Development & Integration Services (ADIS) team provides enterprise solutions for the UC San Diego community. We strive to consistently deliver quality and reliable services that help our campus achieve its administrative goals. Our combined technical resources allow us to build, integrate, host, and deliver enterprise services for both our campus and collaboratively with other campuses within the UC system. Additionally, the team offers custom integration and application development services, business analysis services and data management services for a variety of departments on the campus.\n\nTechnical leader and integral team member, responsibilities include advanced software concepts and objectives to large scale projects of broad scope and complexity; including researching, designing, developing, modifying, testing, debugging, troubleshooting and maintaining source code. Also having direct or related involvement in designing related databases, user interfaces, integration to other systems/applications, content or multimedia processes. Collaborates with stakeholders, process owners and ITS colleagues to define and execute strategically-aligned project plans. Establishes software development, SDLC and IT standards.\n\nUnder the direction of the Director of Application Development, provides leadership and guidance to the team. Serves as a senior member of the unit leadership team consisting of technical experts and functional leaders, supervising professional technical staff and taking responsibility for development and support of campus-wide, mission critical services.\nRESPONSIBILITIES\n\nApplies advanced software concepts and objectives to medium to large projects of broad scope and complexity. Regularly resolves highly complex issues where analysis of situations or data requires an in-depth evaluation of variable factors. Selects tools, methods, techniques, and evaluation criteria to obtain results.\nQUALIFICATIONS\n• Bachelor's degree in related area and / or equivalent experience / training\n• Highly advanced skills associated with software specification, design, modification, implementation and deployment of large-scale scope. Ability to create technical designs and estimates for implementing complex data integrations and software applications that span multiple environments and platforms, such as Cloud, Linux.\n• The knowledge and ability to implement authentication and authorization methods, object/entities and relationships.\n• Advanced knowledge of frameworks, platforms and tools including: .NET Core, .NET Framework, NHibernate, IIS, SSIS, and MS SQL Server.\n• Advanced database knowledge and design concepts, including tables and data types, stored procedures, views and security.\n• Ability to write highly complex queries, define relationships, create objects: tables, views, stored procedures and design indexes.\n• Capable of configuring and monitoring connection pools; SQL optimization, manage database changes and deployments with respect to application lifecycle.\n• Proven complex problem- solving skills. Ability to investigate and diagnose all aspects of application issues, including security, business logic, database connection, entities, queries, performance, memory management and load issues. Make recommendations to the department on tools and problem solving techniques.\n• Advanced knowledge of code repositories, build and deployment process and tool sets, especially as related to Cloud platforms, SaaS and iPaaS. Tools such as git, jenkins, static code analyzers, and binary repos.\n\nSPECIAL CONDITIONS\n• Employee must be available to work evenings and weekends.\n• Employee must be available to travel as required.\n• Job offer is contingent on clear background check.\n\nOur employees enjoy competitive compensation packages and educational opportunities in a diverse, stimulating workforce.\n\nThis position is eligible for full:\n- Health/Dental/Vision Insurance\n- Vacation/Holidays\n- Life Insurance\n- UC Retirement Plan.\n\nFor more information about UCSD Benefits visit and UCSD Work/Life visit\n\nTo calculate an approximate value of the UC Total Compensation package, please click here.\n\nPay Transparency Act\n\nAnnual Full Pay Range: $71,000 - $160,000 (will be prorated if the appointment percentage is less than 100%)\n\nHourly Equivalent: $34.00 - $76.63\n\nFactors in determining the appropriate compensation for a role include experience, skills, knowledge, abilities, education, licensure and certifications, and other business and organizational needs. The Hiring Pay Scale referenced in the job posting is the budgeted salary or hourly range that the University reasonably expects to pay for this position. The Annual Full Pay Range may be broader than what the University anticipates to pay for this position, based on internal equity, budget, and collective bargaining agreements (when applicable).\n\nApply Now\n\nJob offer is contingent on successful engagement in the UC COVID-19 Vaccination program (fully vaccinated with documented proof or approved exception/deferral).\n\nTo foster the best possible working and learning environment, UC San Diego strives to cultivate a rich and diverse environment, inclusive and supportive of all students, faculty, staff and visitors. For more information, please visit UC San Diego Principles of Community.\n\nThe University of California is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, age, protected veteran status, gender identity or sexual orientation. For the complete University of California nondiscrimination and affirmative action policy see: http://www-hr.ucsd.edu/saa/nondiscr.html\n\nUC San Diego is a smoke and tobacco free environment. Please visit smokefree.ucsd.edu for more information.", "children": []}]}, {"data": "job_posted_at_datetime_utc", "children": [{"data": "2023-04-10T00:00:00.000Z", "children": []}]}, {"data": "Qualifications", "children": [{"data": ["Bachelor's degree in related area and / or equivalent experience / training", "Highly advanced skills associated with software specification, design, modification, implementation and deployment of large-scale scope", "Ability to create technical designs and estimates for implementing complex data integrations and software applications that span multiple environments and platforms, such as Cloud, Linux", "The knowledge and ability to implement authentication and authorization methods, object/entities and relationships", "Advanced knowledge of frameworks, platforms and tools including: .NET Core, .NET Framework, NHibernate, IIS, SSIS, and MS SQL Server", "Advanced database knowledge and design concepts, including tables and data types, stored procedures, views and security", "Ability to write highly complex queries, define relationships, create objects: tables, views, stored procedures and design indexes", "Capable of configuring and monitoring connection pools; SQL optimization, manage database changes and deployments with respect to application lifecycle", "Proven complex problem- solving skills", "Ability to investigate and diagnose all aspects of application issues, including security, business logic, database connection, entities, queries, performance, memory management and load issues", "Tools such as git, jenkins, static code analyzers, and binary repos", "Employee must be available to work evenings and weekends", "Employee must be available to travel as required"], "children": []}]}, {"data": "Benefits", "children": [{"data": ["Our employees enjoy competitive compensation packages and educational opportunities in a diverse, stimulating workforce", "Health/Dental/Vision Insurance", "Life Insurance", "UC Retirement Plan", "For more information about UCSD Benefits visit and UCSD Work/Life visit", "Annual Full Pay Range: $71,000 - $160,000 (will be prorated if the appointment percentage is less than 100%)", "Hourly Equivalent: $34.00 - $76.63"], "children": []}]}]}, {"data": "question", "children": [{"data": ["No questions available"], "children": []}]}, {"data": "min_sal", "children": [{"data": 30000, "children": []}]}, {"data": "max_sal", "children": [{"data": 221000, "children": []}]}, {"data": "med_sal", "children": [{"data": 104205.29, "children": []}]}]}]}