{
    "data": [
        [
            "Koam Engineering Systems",
            "FULLTIME",
            "Sr. Electrical Engineer",
            "https://www.ziprecruiter.com/c/Koam-Engineering-Systems/Job/Sr.-Electrical-Engineer/-in-San-Diego,CA?jid=105125bc6cf0bee6",
            "Koam Engineering Systems, Inc. (KES Inc.) is an employee owned small business specializing in technology innovation and systems integration by combining innovative products and reliable engineering services. Headquartered in San Diego, California and with offices in Gig Harbor, WA KES provides services globally in systems engineering & technical assistance, requirements analysis, software design & development, systems integration & testing, independent verification & validation, and operational & logistic support.\n\nPosition Summary:\n\nWe currently have an immediate need for a Senior Electrical Engineer to provide support involving design, development, prototyping, modification, integration, installation, test and evaluation of military and C4ISR electronic systems. Individual shall ensure compliance to customer specifications and requirements with a variety of electrical engineering concepts, practices, and procedures.\n\nResponsibilities:\n• Determine technical objectives for solution(s) to advanced technical engineering problems.\n• Participate in the review and finalization of detailed system and subsystem performance requirements, interface control documents, test requirements, integration planning, etc.\n• Responsible for working on improvements and enhancements to existing designs, troubleshooting hardware, failure analysis, test procedure creation, and electronics testing.\n• Develop and design solutions for complex systems or subsystems as part of a multidisciplinary engineering team\n• Document test and verification activities at the electrical system and/or subsystem level.\n• Conduct reviews and/or provide significant technical analysis and commentary on the system and engineering specification, schematic, and/or verification phases of development.\n• Consult with other engineers and program teams charged with sustaining engineering activities in order to ensure continuity of assembly/testing activities\n• May function in an advisory or leadership role for a project/program and provide direction and guidance to less experienced professional staff or team.\n• Relies on extensive experience and judgment to plan and accomplish goals.\n• Analyze requirements and work with other engineering team members to evaluate interfaces between hardware/software and create high level design, detailed design and documentation.\n• Notify supervisor of corrective action, if and when, defects are found for parts/processes that do not conform to specifications.\n• Must have excellent writing skills.\n• Ability to work effectively in a dynamic team environment.\n\nExperience:\n• Understand specifications standards for use in designing hardware schematics\n• Check/Construct electrical schematic packages\n• Identify system performance measures and the actions needed to make improvements.\n• Conduct tests on new designs and equipment.\n• Ensure equipment performs to validated quality protocols.\n• Design, test, install, and maintain large-scale electronic equipment or machinery for use in manufacturing or power generation or transmission.\n• Use computer-assisted engineering and design software and equipment to perform assignments\n• Apply principles and techniques of electrical engineering to accomplish goals\n• Familiar with a variety of the field's concepts, practices, and procedures including ISO 9001:2008/2015.\n\nQualifications and Education Requirements:\n• Bachelor's degree in Electrical Engineering and 8 or more years’ experience working as an Electrical Engineer in a military or DoD C4I facility.\n• 8+ years working as an Electrical Engineer with emphasis on CANES, ADNS or related C4ISR technologies.\n• 8+ years working with CAD tools such as AutoCAD, SolidWorks, Visio, PADS.\n• Must be able to travel 10% or as required\n• This position requires an existing U.S. Government granted personnel security clearance at the Secret level or former clearance must have been within the last 24 months. U.S. Citizenship is required.\n\nPreferred Skills:\n• Master’s degree preferred\n• 8+ years’ experience working as an Electrical Engineer within the SPAWAR/NIWC community ideal\nAt KES, we offer a comprehensive and valuable benefits program to our employees and their families some of these benefits include but are not limited to:\n• Customizable Medical/Dental/Vision Coverage\n• Life and AD&D Insurance\n• 401(k) Plan\n• Employee Stock Ownership Plan (ESOP) - (Discretionary Plan)\n• Education Assistance\n• Paid Time Off\n\nSince 1995, KES continues to foster the entrepreneurial spirit of a growing small business that focuses on the needs of its customers and employees and serves to provide a rewarding and challenging career. KES offers a competitive salary and full range of benefits. KES, Inc. is an EEO/AA Employer committed to hiring and retaining a diverse workforce.",
            "2023-04-26T00:52:07.000Z",
            [
                "Ability to work effectively in a dynamic team environment",
                "Understand specifications standards for use in designing hardware schematics",
                "Apply principles and techniques of electrical engineering to accomplish goals",
                "Familiar with a variety of the field's concepts, practices, and procedures including ISO 9001:2008/2015",
                "Bachelor's degree in Electrical Engineering and 8 or more years’ experience working as an Electrical Engineer in a military or DoD C4I facility",
                "8+ years working as an Electrical Engineer with emphasis on CANES, ADNS or related C4ISR technologies",
                "8+ years working with CAD tools such as AutoCAD, SolidWorks, Visio, PADS",
                "Must be able to travel 10% or as required",
                "This position requires an existing U.S. Government granted personnel security clearance at the Secret level or former clearance must have been within the last 24 months. U.S. Citizenship is required"
            ],
            [
                "Customizable Medical/Dental/Vision Coverage",
                "Life and AD&D Insurance",
                "401(k) Plan",
                "Employee Stock Ownership Plan (ESOP) - (Discretionary Plan)",
                "Education Assistance",
                "Paid Time Off"
            ]
        ],
        [
            "Randstad Engineering",
            "FULLTIME",
            "Electrical Hardware Engineer",
            "https://www.indeed.com/viewjob?jk=1ab2fd61d22d92af",
            "Salary: $90k - 110k per year\n\nReference: 1007303\n\njob summary:\n\nA global leader within their respective analog sensor design and development industry, is looking for an Electrical Hardware Engineer to join their San Diego team. The Electrical Hardware Engineer will be responsible for upgrading the electrical hardware and the associated test and validation equipment for the company's products. An ideal candidate would have a mix of education and work experience within analog and mixed signals, but also be very hands on! This is a direct hire position with a very generous bonus opportunity.\n\nlocation: SAN DIEGO, California\n\njob type: Permanent\n\nsalary: $90,000 - 110,000 per year\n\nwork hours: 8am to 4pm\n\neducation: Bachelors\n\nresponsibilities:\n• Design circuits to meet client and company requirements\n• Design, develop, and improve infrastructure for sensor processing, testing, and calibration\n• Collaborate with internal team to develop and release the latest product and updates\n• Design and release updates to current products\n• Analyze and document laboratory testing results\n• Travel to client sites when needed for installation and testing purposes when needed\n• Manually assemble and modify electrical hardware and perform tests on nonconformance parts\n\nQualifications\n• Electrical Engineer degree\n• 2+ years of experience with analog and mixed signals\n\n#LI-AL1\n\nqualifications:\n• Experience level: Experienced\n• Minimum 2 years of experience\n• Education: Bachelors (required)\n\nskills:\n• PCB\n• Electrical Engineering\n\nEqual Opportunity Employer: Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.\n\nAt Randstad, we welcome people of all abilities and want to ensure that our hiring and interview process meets the needs of all applicants. If you require a reasonable accommodation to make your application or interview experience a great one, please contact HRsupport@randstadusa.com.\n\nPay offered to a successful candidate will be based on several factors including the candidate's education, work experience, work location, specific job duties, certifications, etc. In addition, Randstad offers a comprehensive benefits package, including health, an incentive and recognition program, and 401K contribution (all benefits are based on eligibility).\n\nQualified applicants in San Francisco with criminal histories will be considered for employment in accordance with the San Francisco Fair Chance Ordinance.\n\nWe will consider for employment all qualified Applicants, including those with criminal histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles' Fair Chance Initiative for Hiring Ordinance.\n\nFor certain assignments, Covid-19 vaccination and/or testing may be required by Randstad's client or applicable federal mandate, subject to approved medical or religious accommodations. Carefully review the job posting for details on vaccine/testing requirements or ask your Randstad representative for more information.",
            "2023-04-25T12:06:44.000Z",
            [
                "An ideal candidate would have a mix of education and work experience within analog and mixed signals, but also be very hands on!",
                "Electrical Engineer degree",
                "2+ years of experience with analog and mixed signals",
                "Experience level: Experienced",
                "Minimum 2 years of experience",
                "Education: Bachelors (required)",
                "PCB",
                "We will consider for employment all qualified Applicants, including those with criminal histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles' Fair Chance Initiative for Hiring Ordinance"
            ],
            [
                "Salary: $90k - 110k per year",
                "salary: $90,000 - 110,000 per year",
                "In addition, Randstad offers a comprehensive benefits package, including health, an incentive and recognition program, and 401K contribution (all benefits are based on eligibility)"
            ]
        ],
        [
            "WSP USA",
            "FULLTIME",
            "Principal (Electrical Engineer)",
            "https://www.linkedin.com/jobs/view/principal-electrical-engineer-at-wsp-usa-3584810454",
            "Who We Are\n\nAt WSP, we are driven by inspiring future-ready pioneers to innovate. We’re looking to grow our teams with people who are ready to collaborate in building communities and expanding our skylines. To do this, we hire candidates of all experiences, skillsets, backgrounds and walks of life. We actively foster a work environment and culture where inclusion and diversity is part of our fundamental structure. This is delivered behaviorally, through our policies, trainings, local partnerships with professional diverse organizations, internal networks and most importantly with the support and sponsorship of our leaders who help drive our commitment to an inclusive, diverse, welcoming and equitable work environment. Anything is within our reach and yours as a WSP employee. Come join us and help shape the future!\n\nSince 1979, tk1sc has been part of shaping the building landscape along the West Coast. From industrial development to warehouses, office, retail, higher education, community colleges, K-12, and healthcare, our experience spans over 40 years. Our 250+ staff is spread strategically across six locations, including Seattle, Irvine, San Jose, Los Angeles, Riverside, and San Diego, and is committed to sustainably enhancing the built environment.\n\nThis Opportunity\n\ntk1sc, a WSP USA company, is seeking a Principal, Electrical Engineer for our Irvine, CA office; Los Angeles, San Diego and Riverside, CA will also be considered.\n\nThe tk1sc Principal is a leadership position, responsible for building and nurturing client relationships as well as acquire new client relationships. They will work closely with the other leaders to implement and execute our strategic plan. The Principal is expected to inspire our team, represent design, continue our growth and success in our current market sectors and in diversifying our client and project base.\n\nYour Impact\n• Advanced knowledge of own discipline/department Large Scale or High-Level complexity projects and fees\n• Serve as a local leader to champion and inspire our team, represent design, and reinforce tk1sc core values and brand.\n• Serve as the local leader for the Electrical Engineering Department.\n• Serve as a seller-doer generating work, creating long-term relationships and delivering long-term value to clients for tk1sc\n• Developing, reviewing, and approving proposals, reports, and contract documents\n• Developing and maintaining industry relationships and visibility with current and prospective clients, sub-consultants, competitor/teaming partners, and potential recruits\n• Engages staff on design, ensures design process is followed and influences usage of technological tools.\n• Takes ultimate responsibility for the quality and profitability of his/her projects\n• Take personal responsibility for coaching, developing and growing our staff\n• Demonstrate local leadership by participating as the electrical engineering thought leader in professional organizations, activities and services that further the firm’s vision, value and relationships.\n\nWho You Are\n\nRequired Qualifications\n• Bachelor’s Degree in Engineering.\n• Minimum 12+ years’ experience in the Electrical Engineering Design discipline, inclusive of five (5) or more years’ experience in Marketing, Client Development, and/or management of a studio, practice group, or regional office.\n• Experience on healthcare projects and knowledge of OSHPD preferred\n• Experience with AutoCAD and Revit documentation and management as it applies to Electrical Engineering.\n• Experience and understanding in EnergyPro\n• Baseline experience and understanding of AGI32 or Visual (or similar).\n• Proven ability to understand and recognize complex design problems.\n• Versatile, self-motivated and articulate.\n• Knowledge of Electrical and related California Building Codes\n• Knowledge of Green Building practices and LEED Rating Systems\n• Must possess a valid driver’s license.\n\nPreferred Qualifications\n• Professional registration in Electrical Engineering is preferred (PE)\n\nCompensation and Benefits:\n\nWSP provides a comprehensive suite of benefits including medical, dental, vision, disability, life, and retirement savings focused on a providing health and financial stability throughout the employee’s career.\n\nExpected Salary: $119,800 - $200,600\n\nWSP USA is providing the compensation range and general description of other compensation and benefits that the company in good faith believes it might pay and/or offer for this position based on the successful applicant’s education, experience, knowledge, skills, and abilities in addition to internal equity and geographic location. WSP USA reserves the right to ultimately pay more or less than the posted range and offer additional benefits and other compensation, depending on circumstances not related to an applicant’s sex or other status protected by local, state, or federal law.\n\nAdditional Requirements\n• To perform this job successfully, an individual must be able to perform each essential job duty satisfactorily. Reasonable accommodations may be made to enable qualified individuals with disabilities to perform essential job functions.\n\nAdditional Details\n• Travel Required: 40%\n• Job Status: Regular\n• Employee Type: Full\n• Primary Location: IRVINE - LAGUNA CANYON RD\n• All locations: US-CA-Irvine, US-CA-Los Angeles, US-CA-Riverside, US-CA-San Diego\n\nAbout WSP\n\nWSP USA is the U.S. operating company of WSP, one of the world's leading engineering and professional services firms. Dedicated to serving local communities, we are engineers, planners, technical experts, strategic advisors and construction management professionals. WSP USA designs lasting solutions in the buildings, transportation, energy, water and environment markets. With more than 15,000 employees in over 300 offices across the U.S., we partner with our clients to help communities prosper. www.wsp.com\n\nWSP provides a flexible and agile workplace model while meeting client needs. Employees are also afforded a comprehensive suite of benefits including medical, dental, vision, disability, life, and retirement savings focused on providing health and financial stability throughout the employee’s career.\n\nAt WSP, we want to give our employees the challenges they seek to grow their careers and knowledge base. Your daily contributions to your team will be essential in meeting client objectives, goals and challenges. Are you ready to get started?\n\nWSP USA (and all of its U.S. companies) is an Equal Opportunity Employer Race/Age/Color/Religion/Sex/Sexual Orientation/Gender Identity/National Origin/Disability or Protected Veteran Status.\n\nThe selected candidate must be authorized to work in the United States.",
            "2023-04-25T01:27:33.000Z",
            [
                "Bachelor’s Degree in Engineering",
                "Minimum 12+ years’ experience in the Electrical Engineering Design discipline, inclusive of five (5) or more years’ experience in Marketing, Client Development, and/or management of a studio, practice group, or regional office",
                "Experience with AutoCAD and Revit documentation and management as it applies to Electrical Engineering",
                "Experience and understanding in EnergyPro",
                "Baseline experience and understanding of AGI32 or Visual (or similar)",
                "Proven ability to understand and recognize complex design problems",
                "Versatile, self-motivated and articulate",
                "Knowledge of Electrical and related California Building Codes",
                "Knowledge of Green Building practices and LEED Rating Systems",
                "Must possess a valid driver’s license",
                "To perform this job successfully, an individual must be able to perform each essential job duty satisfactorily",
                "The selected candidate must be authorized to work in the United States"
            ],
            [
                "Expected Salary: $119,800 - $200,600",
                "WSP USA is providing the compensation range and general description of other compensation and benefits that the company in good faith believes it might pay and/or offer for this position based on the successful applicant’s education, experience, knowledge, skills, and abilities in addition to internal equity and geographic location",
                "Employees are also afforded a comprehensive suite of benefits including medical, dental, vision, disability, life, and retirement savings focused on providing health and financial stability throughout the employee’s career"
            ]
        ],
        [
            "L3Harris Technologies",
            "FULLTIME",
            "Electrical Engineer (New Grad - San Diego, CA)",
            "https://careers.l3harris.com/job/san-diego/electrical-engineer-new-grad-san-diego-ca/4832/47330414880",
            "Description:\n\nJob Title: Electrical Engineer (New Grad - San Diego, CA)\n\nJob Code: CS20231204-99534\n\nJob Location: San Diego, CA\n\nJob Description:\n\nWe are seeking a highly motivated individual to perform electrical engineering in an organization that designs, developments, and tests cutting-edge hardware and software solutions. This individual must be familiar with schematic design tools, preferably OrCAD, and layout design tools, preferably PADS. This individual must be interested in designing and debugging complex electro-mechanical systems for demanding military environments and generating detailed engineering and production drawings.\n\nThis position is in a fast paced and dynamic environment requiring tasking flexibility to meet ever changing customer objectives. It will require the ability to work within a team structure as well as work independently with supervision. Excellent communication skills, both verbal and written, are crucial.\n\nThis office is responsible for the VideoScout product line. You can see some of the products we are responsible for here: https://www.l3harris.com/all-capabilities/videoscout\n\nThis position reports to the Lead Electrical Engineer and is located in our San Diego office.\n\nQualifications:\n• Bachelor’s degree in Electrical Engineering, Computer Engineering, Electrical & Computer Engineering or related field\n• GPA of 3.0 or greater\n• Familiarity with Schematic tools (OrCAD preferred, Altium, PADS logic, and/or Eagle)\n• Familiarity with PCB Layout tools (PADS preferred, Altium, Allegro, and/or Xpedition)\n• Familiarity with Simulation tools (Pspice and/or LTspice)\n• Desire to learn how to design complex, rugged electronics from start to finish (i.e. design -> simulation -> layout -> prototype -> debug & test -> production)\n• Proficient with Microsoft Office (Word, Outlook, Excel, PowerPoint)\n• Excellent written and verbal communication\n• Comfortable presenting designs and accepting constructive critique\n• Proficient at self-learning and “googling”\n• Must be eligible to obtain a Secret clearance\n\nPreferred Skills:\n• Proficient with OrCAD and PADS\n• Familiarity with antennas, radios, modems, and system-level RF design\n• Familiarity with Xilinx FPGA’s, Xilinx design suites (ISE, Vivado), HDL Simulation Tools (Questa or Modelsim), VHDL, and Verilog\n• Familiarity with MATLAB\n• Experience designing, documenting, and testing rugged electrical boards and assemblies\n\nWhat You Gain:\n\nWe want this internship to benefit you. You will have the opportunity to design and test your own parts, create documentation for those parts, and receive mentorship from a team of cross discipline engineers. We are working on cutting edge communication devices, you will gain all the tools you need to advance your career. We also offer excellent work / life balance with flexible hours and a 4/10 work schedule (10 hours/day with every Friday off).",
            "2023-04-12T00:00:00.000Z",
            [
                "We are seeking a highly motivated individual to perform electrical engineering in an organization that designs, developments, and tests cutting-edge hardware and software solutions",
                "This individual must be familiar with schematic design tools, preferably OrCAD, and layout design tools, preferably PADS",
                "This individual must be interested in designing and debugging complex electro-mechanical systems for demanding military environments and generating detailed engineering and production drawings",
                "It will require the ability to work within a team structure as well as work independently with supervision",
                "Excellent communication skills, both verbal and written, are crucial",
                "Bachelor’s degree in Electrical Engineering, Computer Engineering, Electrical & Computer Engineering or related field",
                "GPA of 3.0 or greater",
                "Familiarity with Simulation tools (Pspice and/or LTspice)",
                "Desire to learn how to design complex, rugged electronics from start to finish (i.e. design -> simulation -> layout -> prototype -> debug & test -> production)",
                "Proficient with Microsoft Office (Word, Outlook, Excel, PowerPoint)",
                "Comfortable presenting designs and accepting constructive critique",
                "Proficient at self-learning and “googling”",
                "Must be eligible to obtain a Secret clearance"
            ],
            [
                "We also offer excellent work / life balance with flexible hours and a 4/10 work schedule (10 hours/day with every Friday off)"
            ]
        ],
        [
            "YER USA",
            "FULLTIME",
            "Electrical Engineer",
            "https://www.monster.com/job-openings/electrical-engineer-san-diego-ca--a957f104-8cc8-4f35-96ce-ad7fd2eb64bd",
            "We are looking for a Sr. Electrical Engineer for one of clients in San Diego. This is an international semiconductor company and the position is a temp to perm. Will go perm after 12 months.\n\nRole and responsibilities\n• Applies Electrical/Electronic Engineering skills to design solutions for sustaining and new product development.\n• Under limited supervision, exercises appropriate design and analysis as required to meet design objectives.\n• Completes design projects using appropriate embedded controls requirements & specification development, design, design verification and quality process controls.\n• Assists in creating development and resource plans for focused engineering projects. Coordinates with Functional Management or Senior Engineers to prioritize and complete work assignments. Creates engineering change orders, commissions and approves engineering drawings, develops documentation, and evaluates prototype modules.\n• Interacts with Suppliers, Procurement, Manufacturing, and other Cymer employees to develop designs, acquire prototypes and produce special-build/experimental modules.\n• Completes module and sub-module lifecycle evaluation with minimal oversight.\n• Facilitates smooth transition of new designs to Manufacturing, including assessment of technical risk and feedback on qualification testing plan.\n• Facilitates product sustaining engineering for released designs through continuous quality monitoring & improvement, obsolescence mitigation, and field and factory support.\n\nEducation and experience\n• Requires a Bachelor’s Degree in Electrical or Computer Engineering or equivalent experience\n• Very strong electrical design experience\n• OrCAD, and PADS experience are required\n• Designing Electrical Boards\n• Hands-on with developing documentation\n• Help Desk testing and product experience\n• Troubleshooting design board exp",
            "2023-04-02T22:01:08.000Z",
            [
                "Requires a Bachelor’s Degree in Electrical or Computer Engineering or equivalent experience",
                "Very strong electrical design experience",
                "OrCAD, and PADS experience are required",
                "Designing Electrical Boards",
                "Hands-on with developing documentation",
                "Help Desk testing and product experience",
                "Troubleshooting design board exp"
            ],
            "No benefits data available"
        ],
        [
            "3D Systems, Inc",
            "FULLTIME",
            "Senior Electrical Engineer",
            "https://www.ziprecruiter.com/c/3D-Systems,-Inc/Job/Senior-Electrical-Engineer/-in-San-Diego,CA?jid=b1c1ff0e2d313fa4",
            "Role Profile\n\nsenior electrical engineer\n\nWho We Are\n\nMore than 30 years ago, 3D Systems brought the innovation of 3D printing to the manufacturing industry. Today, as the leading additive manufacturing solutions partner, we bring innovation, performance, and reliability to every interaction - empowering our customers to create products and business models never before possible. 3D Systems' solutions address a variety of advanced applications in healthcare and industrial markets such as medical and dental, aerospace & defense, automotive, and durable goods.\n\nWhat You Will Do\n• Participate as a team member with other Electrical Engineers and work with both internal and external resources to develop robust and reliable electronics of moderate complexity.\n• Design electronic circuits for production intent 3D printers and peripherals meeting ESD, EMI, and regulatory requirements.\n• Define electrical requirements for new designs and develop detailed performance specifications.\n• Perform preliminary design activities-including block diagrams, trade off studies and design reviews.\n• Perform detailed design activities - including schematic capture, design analysis, prototype tests, and design reviews.\n• Perform functional tests and design verification tests.\n• Support electrical qualification tests.\n• Develop equipment to support integration and test.\n• Provide troubleshooting support to New Product Introduction manufacturing.\n• Define production test requirements.\n\nAdditional growth opportunities:\n• Be responsible for tasks related to a given development program and will provide engineering support, including schedule tracking and execution, performance against cost and milestones, reporting of status on assigned tasks and interaction with team members from other disciplines.\n• Develop electronic board designs utilizing established engineering principles which may include microprocessor hardware, high-speed memory systems and I/O, or high-speed serial buses.\n• Gain experience with analysis, design, test, integration and troubleshooting of complex electronic hardware systems, beginning with requirements definition through the introduction of the design into manufacturing.\n• Work with partners in Procurement, Manufacturing and Field Service to ensure design meets all New Product Introduction (NPI) requirements.\n• Assist in the development of architecture, implementation strategies, algorithms, and hardware interface programming.\n• Support testing and sustained maintenance of the current and new electrical and firmware systems based on feedback from the field and manufacturing.\n\nWhat You Will Need\n• 5 years' experience developing printed circuit board assemblies using electrical design tools including block diagrams, circuit design, schematic entry, component placement, and test planning.\n• Experience in hardware design validation through empirical analysis, modeling, or experimental test methods\n• Basic PCB design experience (schematic and layout constraints, layout experience itself is not required)\n• BS or MS in Electrical Engineering or equivalent experience in related field\n\nAreas of added interest (desired, but not required):\n• * Electronic circuit design/development for microcontroller-based systems.\n• Embedded controller architecture knowledge that includes real-time systems, sizing for compute tasks, controller selection.\n• Knowledge of high-speed memory design, high-speed buses and associated constraints and debug methods.\n• Experience gathering requirements for embedded computer system designs.\n\nWhy 3D Systems?\n\nMake a meaningful difference\n\nFounded in 1986, we are the original pioneers of 3D printing. And today, we have a global team that is at the forefront of shaping the entire additive space that spans everything from aerospace to healthcare. What we're doing in digital manufacturing is changing lives and transforming how the world makes things. It's a big responsibility to have this type of impact. And it's where we thrive.\n\nBe you, at your best\n\nWe care about treating people right and we know that life is more than work. This is why we approach rewards and benefits at a personal level so that you have the resources you need to take care of yourself and be you, at your best.\n\nBelow are a few of the rewards and benefits we offer:\n• Salary Range: $100,710 - $123,090 (Salary to be determined by the education, experience, knowledge, skills, and abilities of the candidate, and alignment with market data)\n• Comprehensive health plans\n• Generous paid parental and bereavement leave\n• Hybrid work practices for better work/life balance\n• Industry leading vacation practices\n• Paid volunteer time\n• Retirement savings plan with employer matching\n• Engaging employee recognition program\n• Opportunities to grow and develop",
            "2023-04-23T17:23:00.000Z",
            [
                "5 years' experience developing printed circuit board assemblies using electrical design tools including block diagrams, circuit design, schematic entry, component placement, and test planning",
                "Experience in hardware design validation through empirical analysis, modeling, or experimental test methods",
                "Basic PCB design experience (schematic and layout constraints, layout experience itself is not required)",
                "BS or MS in Electrical Engineering or equivalent experience in related field"
            ],
            [
                "Salary Range: $100,710 - $123,090 (Salary to be determined by the education, experience, knowledge, skills, and abilities of the candidate, and alignment with market data)",
                "Comprehensive health plans",
                "Generous paid parental and bereavement leave",
                "Hybrid work practices for better work/life balance",
                "Industry leading vacation practices",
                "Paid volunteer time",
                "Retirement savings plan with employer matching",
                "Engaging employee recognition program",
                "Opportunities to grow and develop"
            ]
        ],
        [
            "Oasis Systems LLC",
            "FULLTIME",
            "Electrical Engineer",
            "https://oasiscareers-oasissystems.icims.com/jobs/16411/electrical-engineer/job",
            "Overview\n\nOasis Systems has an exciting opportunity for a full time Electrical Engineer to support research & development, operations, and testing of large Unmanned Surface Vessels (USV). This project team develops and operates cutting-edge robotic ships for the US Navy in San Diego, CA.\n\nLOCATION: San Diego, CAJOB STATUS: Full TimeTRAVEL: Some travel may be required\n\nREQUIRED QUALIFICATIONS: (Education, Certifications, Experience, Skills)\n\nThis candidate must have experience with the following:\n\nSECURITY CLEARANCE: Must be eligible for a Secret clearance. U.S. Citizenship is required for all applicants\n\nEDUCATION: BS in Electrical Engineering or similar field\n\nCERTIFICATIONS AND TOOLS: N/AEXPERIENCE LEVEL: Minimum of 3 years of experience as an Electrical Engineer\n\nOTHER QUALIFICATIONS/SKILLS:\n• 3 years experience as a working Electrical Engineer\n• Ability to troubleshoot shipboard electrical issues in a fast-paced, dynamic environment\n• Ability to perform duties on vessels at-sea\n• Ability to obtain a Secret security clearance\n\nPREFERRED SKILLS:\n• Experience with shipboard electrical systems a big plus\n• Experience with US Navy ship systems a plus\n• Will consider candidates with significant experience in lieu of B.S. degree\n\nRESPONSIBILITIES: Functionally, the successful candidate will:\n• Maintain, troubleshoot, and repair shipboard electrical systems on Autonomous unmanned vessels.\n• Troubleshoot and repair problems on vessels.\n• Assist with at-sea testing on military vessels.\n\nADDITIONAL INFORMATION:\n\nAt-sea testing may sometimes require up to 70-hour work weeks.\n\nSALARY RANGE: Estimated $85,000 USD - $110,000 USD annually\n\nBENEFITS:\n• Full time (30-40 hours): This role is eligible for comprehensive benefits including Medical, Dental, Vision, Life, Disability, 401(k), Paid Time Off (PTO), Supplemental and Voluntary Benefits and More!\n\nWho We Are Oasis Systems is a premier provider of customer-driven, cost-effective and quality Engineering Services; Enterprise Systems and Applications; Human Factors Engineering; Information Technology and Cyber Security; Professional Services; and Specialized Engineering Solutions to the Department of Defense, FAA, NRC and other federal agencies.\n\nWe strive to be an exciting and welcoming company that attracts, develops, motivates and retains the most talented, skilled and dedicated people in the industry; where they are encouraged to achieve personal excellence, purpose, and their full potential and career aspirations; while supporting mission-critical national security technologies and programs.\n\nOasis Systems is an equal opportunity employer and does not discriminate in hiring or employment on the basis of any legally protected characteristic including, but not limited to, race, color, religion, national origin, marital status, gender, sexual orientation, ancestry, age, medical condition, military veteran status or on the basis of physical handicap which, with reasonable accommodation, render the application to satisfactorily perform the job available.",
            "2023-03-20T07:00:00.000Z",
            [
                "SECURITY CLEARANCE: Must be eligible for a Secret clearance",
                "U.S. Citizenship is required for all applicants",
                "EDUCATION: BS in Electrical Engineering or similar field",
                "CERTIFICATIONS AND TOOLS: N/AEXPERIENCE LEVEL: Minimum of 3 years of experience as an Electrical Engineer",
                "Ability to troubleshoot shipboard electrical issues in a fast-paced, dynamic environment",
                "Ability to perform duties on vessels at-sea",
                "Ability to obtain a Secret security clearance"
            ],
            [
                "SALARY RANGE: Estimated $85,000 USD - $110,000 USD annually",
                "Full time (30-40 hours): This role is eligible for comprehensive benefits including Medical, Dental, Vision, Life, Disability, 401(k), Paid Time Off (PTO), Supplemental and Voluntary Benefits and More!"
            ]
        ],
        [
            "Leidos",
            "FULLTIME",
            "Electrical Engineer",
            "https://careers.leidos.com/jobs/12350711-electrical-engineer",
            "Description\n\nJob Description:\n\nLeidos Maritime System Solutions (MSS) is seeking an electrical engineer (EE) to work as part of a development team in a fast-paced, research, development, testing and evaluation environment at the Naval Information Warfare Center located in San Diego, CA.\n\nThis position will require the candidate to obtain and hold a Secret Clearance. This position is for a mid-level engineer to join a growing, fast-paced research, development, testing and evaluation team at Naval Information Warfare Center Pacific located in San Diego, California.\n\nPrimary Responsibilities\nThis individual will work with a small team of EEs and technicians in development, test, and delivery of sensor technology based on system requirements. Development includes design, implementation and integration of sensors onto systems for deployment at-sea. Testing involves working onboard small boats and ships on the ocean, launching and recovering systems at-sea, and performing post-test analysis of data. Reporting includes providing results from post-test data analysis into official reports or briefing material. Most development and testing will be conducted in San Diego; however, engineers may occasionally be asked to travel in support of testing and/or operations in other locations both in the U.S. and abroad, and may spend multiple day’s at-sea onboard ships.\nIn addition to primary duties, this individual will be encouraged to develop expertise on the functionality and operations of one or more AUV platforms, and may be asked operate the system at-sea during test and evaluation.\n\nBasic Qualifications\nA competitive candidate will possess a working knowledge of the following fundamental capabilities. The candidate must be willing to participate in on-the-job training to gain expert proficiency.\n• Fundamentals of analog and digital circuit design\n• Knowledge of PCB design, fabrication, and testing\nPreference for experience with Altium Designer\n• Experience with lightweight 8-Bit Microcontrollers using C/C++ language programming\n• Experience with Programmable Logic (CPLD & FPGA), preference for VHLD language\n• Comfortable with signal analysis using MATLAB\n• Experience with PC based data acquisition. The ideal candidate will have some experience using NI LabView and NI Measurement Studio.\n• Basic experience with Linux and system programming\n• Requires BS and 4 – 8 years of prior relevant experience or Masters with 2 – 6 years of prior relevant experience. Focus in acoustics desired.\n• Ability to obtain a Secret clearance.\nApplicant shall have experience working in teams to develop solutions, deliver products, and test and evaluate performance. Applicant shall have experience and skill analyzing experiment data to determine results as feedback into the development cycle. Applicant shall have strong technical writing skills to provide input to technical reports and briefing material.\nPreferred Qualifications\nAn ideal candidate would have experience with autonomous underwater vehicle (AUV) operations, including experience with acoustic sensors. Experience with at-sea test and evaluation (T&E) to include operations onboard small craft and large ships at sea is desired. A willingness to conduct such testing is required.\n\nPay Range:\nPay Range $78,000.00 - $120,000.00 - $162,000.00\n\nThe Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary. Additional factors considered in extending an offer include (but are not limited to) responsibilities of the job, education, experience, knowledge, skills, and abilities, as well as internal equity, alignment with market data, applicable bargaining agreement (if any), or other law.",
            "2023-04-18T12:57:02.000Z",
            [
                "A competitive candidate will possess a working knowledge of the following fundamental capabilities",
                "The candidate must be willing to participate in on-the-job training to gain expert proficiency",
                "Fundamentals of analog and digital circuit design",
                "Knowledge of PCB design, fabrication, and testing",
                "Preference for experience with Altium Designer",
                "Experience with lightweight 8-Bit Microcontrollers using C/C++ language programming",
                "Experience with Programmable Logic (CPLD & FPGA), preference for VHLD language",
                "Comfortable with signal analysis using MATLAB",
                "Experience with PC based data acquisition",
                "The ideal candidate will have some experience using NI LabView and NI Measurement Studio",
                "Basic experience with Linux and system programming",
                "Requires BS and 4 – 8 years of prior relevant experience or Masters with 2 – 6 years of prior relevant experience",
                "Applicant shall have experience working in teams to develop solutions, deliver products, and test and evaluate performance",
                "Applicant shall have experience and skill analyzing experiment data to determine results as feedback into the development cycle",
                "Applicant shall have strong technical writing skills to provide input to technical reports and briefing material",
                "An ideal candidate would have experience with autonomous underwater vehicle (AUV) operations, including experience with acoustic sensors",
                "A willingness to conduct such testing is required"
            ],
            [
                "Pay Range $78,000.00 - $120,000.00 - $162,000.00",
                "The Leidos pay range for this job level is a general guideline only and not a guarantee of compensation or salary"
            ]
        ],
        [
            "Apple",
            "FULLTIME",
            "Display Electrical Engineer",
            "https://www.indeed.com/viewjob?jk=cb4700a057d32e1a",
            "Summary\n\nPosted: Apr 19, 2023\n\nWeekly Hours: 40\n\nRole Number:200273254\n\nImagine what you could do at Apple. This is a place where great ideas have a way of becoming great products that delight millions of customers all around the world. Bring passion and dedication to your work and there’s no limit to what you could accomplish. Join us in crafting solutions the world doesn't know of yet. To be successful, you should be able to thrive in a dynamic, agile, multi-disciplinary, and hands-on environment that values engineering excellence, creativity, and innovation.\n\nKey Qualifications\n• 3+ years work experience\n• Strong communication and teamwork skills\n• Hands on experience with schematics, PCB layout, oscilloscope debugging, EMC, power management\n• Ability to travel internationally up to 10% of the time\n\nDescription\n\nAs an iPhone Display Hardware Engineer, you will drive technical projects, from prototypes to mass production. Specifically, you will design high speed PCB schematics, guide layout engineers, and debug PCB boards. You will collaborate with cross functional teams like Optics, ME, and SW to build a high quality seamless product from end to end. Each season you will travel to South Korea or China to meet with Apple vendors.\n\nEducation & Experience\n\nBS, MS, or PhD in EE or related field\n\nAdditional Requirements\n\nPay & Benefits\n• At Apple, base pay is one part of our total compensation package and is determined within a range. This provides the opportunity to progress as you grow and develop within a role. The base pay range for this role is between $113,500 and $207,000, and your base pay will depend on your skills, qualifications, experience, and location.\n\nApple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs. Apple employees are eligible for discretionary restricted stock unit awards, and can purchase Apple stock at a discount if voluntarily participating in Apple’s Employee Stock Purchase Plan. You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition. Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation. Learn more about Apple Benefits.\n\nNote: Apple benefit, compensation and employee stock programs are subject to eligibility requirements and other terms of the applicable plan or program.",
            "2023-04-24T23:45:36.000Z",
            [
                "3+ years work experience",
                "Strong communication and teamwork skills",
                "Hands on experience with schematics, PCB layout, oscilloscope debugging, EMC, power management",
                "Ability to travel internationally up to 10% of the time",
                "BS, MS, or PhD in EE or related field"
            ],
            [
                "Pay & Benefits",
                "At Apple, base pay is one part of our total compensation package and is determined within a range",
                "The base pay range for this role is between $113,500 and $207,000, and your base pay will depend on your skills, qualifications, experience, and location",
                "Apple employees also have the opportunity to become an Apple shareholder through participation in Apple’s discretionary employee stock programs",
                "You’ll also receive benefits including: Comprehensive medical and dental coverage, retirement benefits, a range of discounted products and free services, and for formal education related to advancing your career at Apple, reimbursement for certain educational expenses — including tuition",
                "Additionally, this role might be eligible for discretionary bonuses or commission payments as well as relocation"
            ]
        ],
        [
            "Lincoln Electric",
            "FULLTIME",
            "Electrical Engineer",
            "https://www.ziprecruiter.com/c/Lincoln-Electric/Job/Electrical-Engineer/-in-San-Diego,CA?jid=406e841157c8741b",
            "Arc Products, a subsidiary of Lincoln Electric, designs and manufactures automated welding systems focused on fixed automation, orbital TIG and orbital MIG. Located in San Diego, California, Arc Products engineers and manufactures standard and custom automation systems for simple to complex applications.\n\nReq. ID: 23092\n\nPosition Summary:\n\nThe Mechanized Electrical Engineer will participate as a team member in hardware development of motion systems. This activity will include design, development and support of all related welding motion system hardware.\n\nPrimary Responsibilities:\n• Develop and implement new motion control system electronics for fixed and portable mechanized welding equipment\n• Source components, build prototypes and conduct tests using common electrical lab equipment\n• Work collaboratively with software engineers to ensure successful product development\n• Support mechanical packaging and system design to support electrical/thermal requirements\n• Understand and navigate regulatory requirements to ensure designs meet required standards\n• Work with manufacturing engineers to establish policies and processes for building and testing product\n• Determine root cause for failed equipment\n• May lead functional teams or projects. Has accountability for the performance of a team within own discipline or function\n• Works independently, with guidance in only the most complex situations\n• Is recognized as an expert in own area within the organization\n• Interprets internal or external issues and recommends solutions/best practices\n• Solves complex problems; takes a broad perspective to identify solutions\n\nQualifications Required:\n• Bachelor’s degree in Electrical Engineering\n• Minimum 5 years’ experience designing embedded devices\n• Strong understanding of microcontrollers and peripheral circuits including digital and low frequency analog\n• Background in closed loop motion control, motors, sensors and associated devices\n• Knowledge of circuit level switching power supply design\n• Familiar with product lifecycle management tools utilized in PCB manufacturing, preferably Omnify Empower PLM\n• Knowledge of PCB Design tools for schematic capture and PCB layout, preferably Xpedition Enterprise\n• Knowledge of UL/CSA and CE EMC regulations and the design practices necessary to avert EMC testing failures\n\nBehavioral Skills/Job Competencies:\n• Strong analytical and problem solving skills\n• Uncompromising attitude towards quality and customer satisfaction\n• Ability to clearly convey concepts and present results to others\n• Develop professional relationships and build rapport with others\n• Adherence to safety policies and demonstrating safe work habits at all times is required\n• Strong interpersonal skills; excellent written and oral communication skills; must be able to communicate with internal and external teams and arbitrate difficult problems\n• Ability to work independently with little supervision; willing to work overtime as needed\n• Team oriented; interact with internal and external customers; interface with other departments regularly via phone, chat, email and video conference\n\nPhysical Demands and Work Environment:\n\nThe physical demands and work environment characteristics described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.\n• Physical Demands: Work is usually a mix of standing and walking, pushing, pulling, manipulating tools and being in awkward physical positions. In the office there is minimal reaching, bending and lifting in relationship to documents and stored records. When at a customer facility, there will be lifting, reaching, bending, dragging, pulling and carrying of parts and equipment. This individual may have to walk long distances to reach the equipment within the customer’s facility. This individual must be able to occasionally lift 50 pounds and frequently lift 25 pounds. This position requires manual dexterity and visual acuity to utilize the assembly equipment and tools. The position requires vision, hearing, smell, and speech.\n• Work Environment: Traveling is minimal; hours may be irregular. Temperature may be hot or cold, inside and outside.\n\nQualified applicants will receive consideration for employment without regard to their race, color, religion, national origin, sex, protected veteran status or disability.\n\nLincoln Electric is a $3.2B publicly traded company (NASDAQ) with over 11,000 employees around the world. With operations in over 56 manufacturing locations in 19 countries, we are well positioned to continue this partnership and poised to grow with our customers. As a part of that continuing legacy, you will contribute to a new generation of innovation and experience the pride that comes with being part of the solution to the world’s challenges. It is a great time to be part of the welding industry!\n\nLincoln Electric does not accept unsolicited resumes from third-party recruiters. Resumes submitted to any employee(s) of Lincoln Electric without a signed vendor agreement, by the Manager of Recruiting & Training, will become property of Lincoln Electric. Verbal or written commitments from any other member of Lincoln Electric will not be considered binding terms. Lincoln Electric will not pay a fee to any third-party recruiter that has not coordinated their recruiting activity through the Recruiting Department.\n\nEmployment Status: Salary Full-Time\nFunction: Engineering\nSection: Lincoln Cleveland (US10)\n\nEOE, including disability/veterans",
            "2023-04-24T00:00:00.000Z",
            [
                "Bachelor’s degree in Electrical Engineering",
                "Minimum 5 years’ experience designing embedded devices",
                "Strong understanding of microcontrollers and peripheral circuits including digital and low frequency analog",
                "Background in closed loop motion control, motors, sensors and associated devices",
                "Knowledge of circuit level switching power supply design",
                "Familiar with product lifecycle management tools utilized in PCB manufacturing, preferably Omnify Empower PLM",
                "Knowledge of PCB Design tools for schematic capture and PCB layout, preferably Xpedition Enterprise",
                "Knowledge of UL/CSA and CE EMC regulations and the design practices necessary to avert EMC testing failures",
                "Strong analytical and problem solving skills",
                "Uncompromising attitude towards quality and customer satisfaction",
                "Ability to clearly convey concepts and present results to others",
                "Adherence to safety policies and demonstrating safe work habits at all times is required",
                "Strong interpersonal skills; excellent written and oral communication skills; must be able to communicate with internal and external teams and arbitrate difficult problems",
                "Ability to work independently with little supervision; willing to work overtime as needed",
                "Team oriented; interact with internal and external customers; interface with other departments regularly via phone, chat, email and video conference",
                "Physical Demands: Work is usually a mix of standing and walking, pushing, pulling, manipulating tools and being in awkward physical positions",
                "This individual must be able to occasionally lift 50 pounds and frequently lift 25 pounds",
                "This position requires manual dexterity and visual acuity to utilize the assembly equipment and tools",
                "Work Environment: Traveling is minimal; hours may be irregular"
            ],
            "No benefits data available"
        ]
    ]
}